[
  {
    "content": "In the last chapter we developed the concepts of position, displacement, velocity and acceleration that are needed to describe the motion of an object along a straight line. We found that the directional aspect of these quantities can be taken care of by + and signs, as in one dimension only two directions are possible. But in order to describe motion of an object in two dimensions (a plane) or three dimensions (space), we need to use vectors to describe the above- mentioned physical quantities. Therefore, it is first necessary to learn the language of vectors. How to add, subtract and multiply vectors? What is the result of multiplying a vector by a real number? We shall learn this to enable us to use vectors for defining velocity and acceleration in a plane. We then discuss motion of an object in a plane. As a simple case of motion in a plane, we shall discuss motion with constant acceleration and treat in detail the projectile motion. Circular motion is a familiar class of motion that has a special significance in daily-life situations. We shall discuss uniform circular motion in some detail. The equations developed in this chapter for motion in a plane can be easily extended to the case of three dimensions.",
    "topic": "MOTION IN A PLANE"
  },
  {
    "content": "In physics, we can classify quantities as scalars or vectors. Basically, the difference is that a direction is associated with a vector but not with a scalar. A scalar quantity is a quantity with magnitude only. It is specified completely by a single number, along with the proper unit. Examples are the distance between two points, mass of an object, the temperature of a body and the time at which a certain event happened. The rules for combining scalars are the rules of ordinary algebra. Scalars can be added, subtracted, multiplied and divided just as the ordinary numbers. For example, if the length and breadth of a rectangle are 1.0 m and 0.5 m respectively, then its perimeter is the sum of the lengths of the four sides, $1.0~m+0.5~m+1.0~m+0.5~m = 3.0~m$. The length of each side is a scalar and the perimeter is also a scalar. A vector quantity is a quantity that has both a magnitude and a direction and obeys the triangle law of addition or equivalently the parallelogram law of addition. So, a vector is specified by giving its magnitude by a number and its direction. Some physical quantities that are represented by vectors are displacement, velocity, acceleration and force. To represent a vector, we use a bold face type in this book. Thus, a velocity vector can be represented by a symbol v. Since bold face is difficult to produce, when written by hand, a vector is often represented by an arrow placed over a letter, say $\\vec{v}$. Thus, both v and $\\vec{v}$ represent the velocity vector. The magnitude of a vector is often called its absolute value, indicated by $|v|$. A vector is represented by a bold face, e.g. by A, a, p, q, r, ... x, y, with respective magnitudes denoted by light face A, a, p, q, r, ... x, y.",
    "topic": "Scalars and Vectors"
  },
  {
    "content": "To describe the position of an object moving in a plane, we need to choose a convenient point, say O as origin. Let P and P' be the positions of the object at time t and t', respectively. We join O and P by a straight line. Then, OP is the position vector of the object at time t. An arrow is marked at the head of this line. It is represented by a symbol r, i.e. $OP=r$. Point P' is represented by another position vector, OP' denoted by r'. The length of the vector r represents the magnitude of the vector and its direction is the direction in which P lies as seen from O. If the object moves from P to P', the vector PP' (with tail at P and tip at P') is called the displacement vector corresponding to motion from point P (at time t) to point P' (at time t'). It is important to note that displacement vector is the straight line joining the initial and final positions and does not depend on the actual path undertaken by the object between the two positions. For example, given the initial and final positions as P and Q, the displacement vector is the same PQ for different paths of journey. Therefore, the magnitude of displacement is either less or equal to the path length of an object between two points. This fact was emphasised in the previous chapter also while discussing motion along a straight line.",
    "topic": "Position and Displacement Vectors"
  },
  {
    "content": "Two vectors A and B are said to be equal if, and only if, they have the same magnitude and the same direction. Note that vectors A' and B' have the same magnitude but they are not equal because they have different directions. Even if we shift B' parallel to itself so that its tail Q' coincides with the tail O' of A', the tip S' of B' does not coincide with the tip P' of A'.",
    "topic": "Equality of Vectors"
  },
  {
    "content": "Multiplying a vector A with a positive number $\\lambda$ gives a vector whose magnitude is changed by the factor $\\lambda$ but the direction is the same as that of A: $|lambda A|=\\lambda|A|if~\\lambda>0$. For example, if A is multiplied by 2, the resultant vector 2A is in the same direction as A and has a magnitude twice of $|A|$. Multiplying a vector A by a negative number $-\\lambda$ gives another vector whose direction is opposite to the direction of A and whose magnitude is $\\lambda$ times A. The factor $\\lambda$ by which a vector A is multiplied could be a scalar having its own physical dimension. Then, the dimension of A is the product of the dimensions of $\\lambda$ and A. For example, if we multiply a constant velocity vector by duration (of time), we get a displacement vector.",
    "topic": "Multiplication of Vectors by Real Numbers"
  },
  {
    "content": "Vectors, by definition, obey the triangle law or equivalently, the parallelogram law of addition. To find the sum $A+B$, we place vector B so that its tail is at the head of the vector A. Then, we join the tail of A to the head of B. This line OQ represents a vector R, that is, the sum of the vectors A and B. This graphical method is called the head-to-tail method. The two vectors and their resultant form three sides of a triangle, so this method is also known as triangle method of vector addition. If we find the resultant of $B+A$, the same vector R is obtained. Thus, vector addition is commutative: $A+B=B+A$. The addition of vectors also obeys the associative law: $(A+B)+C=A+(B+C)$. The sum of two equal and opposite vectors, A and -A, is a null vector or a zero vector, represented by 0, with zero magnitude: $A-A=0$. Subtraction of vectors is defined as the sum of two vectors A and -B: $A-B=A+(-B)$. We can also use the parallelogram method: bring their tails to a common origin, and the resultant vector R is the diagonal of the parallelogram from the common origin. The two methods are equivalent.",
    "topic": "Addition and Subtraction of Vectors - Graphical Method"
  },
  {
    "content": "Example 3.1\nRain is falling vertically with a speed of $35~m~s^{-1}$. Winds starts blowing after sometime with a speed of $12ms^{-1}$ in east to west direction. In which direction should a boy waiting at a bus stop hold his umbrella? The velocity of the rain ($v_r$) and the wind ($v_w$) are represented by vectors. The resultant of $v_r$ and $v_w$ is R. The magnitude of R is $R=\\sqrt{v_{r}^{2}+v_{w}^{2}}=\\sqrt{35^{2}+12^{2}}m~s^{-1}=37~m~s^{-1}$. The direction $\\theta$ that R makes with the vertical is given by $\\tan\\theta=\\frac{v_{w}}{v_{r}}=\\frac{12}{35}=0.343$. This gives $\\theta=\\tan^{-1}(0.343)=19^{\\circ}$. Therefore, the boy should hold his umbrella in the vertical plane at an angle of about 19° with the vertical towards the east.",
    "topic": "Addition and Subtraction of Vectors - Graphical Method"
  },
  {
    "content": "Any vector A in a plane can be expressed as a sum of two vectors, $\\lambda a$ and $\\mu b$, along two non-zero, non-collinear vectors a and b in that plane: $A = \\lambda a + \\mu b$. This is called resolving a vector into its component vectors. It is convenient to resolve a vector along the axes of a rectangular coordinate system using unit vectors $\\hat{i}$, $\\hat{j}$, and $\\hat{k}$ for the x-, y-, and z-axes, respectively. A vector A lying in the x-y plane can be expressed as $A=A_{x}\\hat{i}+A_{y}\\hat{j}$. The quantities $A_x$ and $A_y$ are the x- and y-components of A. These components can be expressed in terms of the magnitude A and angle $\\theta$ as $A_x = A \\cos\\theta$ and $A_y=A\\sin\\theta$. Conversely, the magnitude and direction can be found from the components using $A=\\sqrt{A_{x}^{2}+A_{y}^{2}}$ and $\\tan\\theta=\\frac{A_{y}}{A_{x}}$. For a vector A in three dimensions, the components are $A_x=A\\cos\\alpha$, $A_y=A\\cos\\beta$, and $A_z=A\\cos\\gamma$. The vector is then $A=A_x\\hat{i}+A_y\\hat{j}+A_z\\hat{k}$ and its magnitude is $A=\\sqrt{A_{x}^{2}+A_{y}^{2}+A_{z}^{2}}$.",
    "topic": "Resolution of Vectors"
  },
  {
    "content": "The analytical method of adding vectors is often easier and more accurate than the graphical method. To add two vectors A and B, you add their corresponding components. For two vectors in the x-y plane, $A=A_{x}\\hat{i}+A_{y}\\hat{j}$ and $B=B_{x}\\hat{i}+B_{y}\\hat{j}$, their sum is $R=A+B=(A_{x}+B_{x})\\hat{i}+(A_{y}+B_{y})\\hat{j}$. Thus, the components of the resultant vector are $R_{x}=A_{x}+B_{x}$ and $R_{y}=A_{y}+B_{y}$. This method can be extended to three dimensions. For a vector $T=a+b-c$, the components would be $T_{x}=a_{x}+b_{x}-c_{x}$, $T_{y}=a_{y}+b_{y}-c_{y}$, and $T_{z}=a_{z}+b_{z}-c_{z}$.",
    "topic": "Vector Addition Analytical Method"
  },
  {
    "content": "Example 3.2\nFind the magnitude and direction of the resultant of two vectors A and B in terms of their magnitudes and angle $\\theta$ between them. The resultant vector R is represented by the diagonal of a parallelogram. Its magnitude is given by the Law of Cosines: $R=\\sqrt{A^{2}+B^{2}+2AB\\cos\\theta}$. The direction can be determined using the Law of Sines: $\\frac{R}{\\sin\\theta}=\\frac{B}{\\sin\\alpha}=\\frac{A}{\\sin\\beta}$, or by the tangent function: $\\tan\\alpha=\\frac{B\\sin\\theta}{A+B\\cos\\theta}$.",
    "topic": "Vector Addition Analytical Method"
  },
  {
    "content": "Example 3.3\nA motorboat is racing towards north at $25~km/h$ and the water current in that region is $10~km/h$ in the direction of $60^{\\circ}$ east of south. Find the resultant velocity of the boat. The velocities of the boat ($v_b$) and current ($v_c$) are represented by vectors. The magnitude of the resultant velocity R is found using the Law of Cosines: $R=\\sqrt{v_{b}^{2}+v_{c}^{2}+2v_{b}v_{c}\\cos120^{\\circ}}=\\sqrt{25^{2}+10^{2}+2\\times25\\times10(-1/2)}\\approx22~km/h$. To find the direction, we apply the Law of Sines: $\\frac{R}{\\sin\\theta}=\\frac{v_{c}}{\\sin\\phi}$, which gives $\\sin\\phi=\\frac{v_{c}}{R}\\sin\\theta\\approx\\frac{10\\times\\sin120^{\\circ}}{21.8}\\approx0.397$. This results in $\\phi\\approx23.4^{\\circ}$.",
    "topic": "Vector Addition Analytical Method"
  },
  {
    "content": "In this section, we describe motion in two dimensions using vectors. The position vector r of a particle P is given by $r=x\\hat{i}+y\\hat{j}$. The displacement from P to P' is $\\Delta r=r'-r=\\hat{i}\\Delta x+\\hat{j}\\Delta y$. The average velocity is $\\overline{v}=\\frac{\\Delta r}{\\Delta t}$, and the instantaneous velocity is $v=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta r}{\\Delta t}=\\frac{dr}{dt}$. The direction of velocity is always tangential to the path of motion. In component form, $v=v_{x}\\hat{i}+v_{y}\\hat{j}$ where $v_{x}=\\frac{dx}{dt}$ and $v_{y}=\\frac{dy}{dt}$. The magnitude of velocity is $v=\\sqrt{v_{x}^{2}+v_{y}^{2}}$, and its direction is given by $\\tan\\theta=\\frac{v_{y}}{v_{x}}$. Similarly, the average acceleration is $\\overline{a}=\\frac{\\Delta v}{\\Delta t}$, and the instantaneous acceleration is $a=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta v}{\\Delta t}=\\frac{dv}{dt}$. The direction of acceleration changes as the velocity vector changes direction. The acceleration is a constant vector only in one dimension or if the motion is in a straight line. In two or three dimensions, the velocity and acceleration vectors can have any angle between $0^{\\circ}$ and 180° between them.",
    "topic": "Motion in a Plane"
  },
  {
    "content": "Example 3.4\nThe position of a particle is given by $r=3.0t\\hat{i}+2.0t^{2}\\hat{j}+5.0\\hat{k}$ where t is in seconds and the coefficients have the proper units for r to be in metres. (a) Find $v(t)$ and $a(t)$ of the particle. (b) Find the magnitude and direction of $v(t)$ at $t=1.0s$. \n\n**Answer**\n(a) The velocity is $v(t)=\\frac{dr}{d~t}=3.0\\hat{i}+4.0t\\hat{j}$. The acceleration is $a(t)=\\frac{dv}{dt}=+4.0\\hat{j}$, so the acceleration is constant with a magnitude of $4.0~m~s^{-2}$ along the y-direction. (b) At $t=1.0s$, the velocity is $v=3.0\\hat{i}+4.0\\hat{j}$. Its magnitude is $v=\\sqrt{3^{2}+4^{2}}=5.0~m~s^{-1}$. The direction $\\theta$ is given by $\\tan\\theta=\\frac{v_y}{v_x}=\\frac{4}{3}$, so $\\theta\\approx53^{\\circ}$ with the x-axis.",
    "topic": "Motion in a Plane"
  },
  {
    "content": "For an object moving in the x-y plane with a constant acceleration, the average acceleration will equal this constant value. The velocity at any time t is given by $v=v_0+at$. In component form, this is $v_x=v_{0x}+a_xt$ and $v_y=v_{0y}+a_yt$. The position vector changes with time according to $r=r_{0}+v_{0}t+\\frac{1}{2}at^{2}$. This can also be written in component form as $x=x_{o}+v_{ox}t+\\frac{1}{2}a_{x}t^{2}$ and $y=y_{o}+v_{oy}t+\\frac{1}{2}a_{y}t^{2}$. A key interpretation is that motions in the x- and y-directions can be treated independently of each other. Motion in a plane (two-dimensions) can be treated as two separate simultaneous one-dimensional motions with constant acceleration along two perpendicular directions.",
    "topic": "Motion in a Plane with Constant Acceleration"
  },
  {
    "content": "Example 3.5\nA particle starts from the origin at $t=0$ with a velocity $5.0\\hat{i}~m/s$ and moves in the x-y plane with a constant acceleration of $(3.0\\hat{i}+2.0\\hat{j})~m/s^{2}$. (a) What is the y-coordinate of the particle at the instant its x-coordinate is 84 m? (b) What is the speed of the particle at this time?. \n\n**Answer**\n(a) The position vector is $r(t)=v_{0}t+\\frac{1}{2}at^{2}=(5.0t+1.5t^{2})\\hat{i}+1.0t^{2}\\hat{j}$. The x- and y-coordinates are $x(t)=5.0t+1.5t^{2}$ and $y(t)=1.0t^{2}$ respectively. Setting $x(t)=84m$ gives $t=6s$. At this time, the y-coordinate is $y=1.0(6)^2=36.0~m$. (b) The velocity is $v=\\frac{dr}{dt}=(5.0+3.0t)\\hat{i}+2.0t\\hat{j}$. At $t=6s$, $v=23.0\\hat{i}+12.0\\hat{j}$. The speed is the magnitude of the velocity: $|v|=\\sqrt{23^{2}+12^{2}}\\cong26~m~s^{-1}$.",
    "topic": "Motion in a Plane with Constant Acceleration"
  },
  {
    "content": "Projectile motion is the motion of an object in flight, such as a football or a baseball. The motion can be analyzed as two independent, simultaneous components: a horizontal motion with zero acceleration and a vertical motion with constant acceleration due to gravity. This independence was first stated by Galileo. For a projectile launched from the origin with initial velocity $v_0$ at an angle $\\theta_0$, the acceleration is $a=-g\\hat{j}$. The position and velocity components at time t are $x=(v_{o}\\cos\\theta_{o})t$ and $y=(v_{o}\\sin\\theta_{o})t-\\frac{1}{2}gt^{2}$, and $V_x = V_{ox} = V_o \\cos\\theta_o$ and $V_y=V_o\\sin\\theta_o-gt$. The path of the projectile is a parabola, described by the equation $y=(tan~\\theta_{o})x-\\frac{g}{2(v_{o}\\cos\\theta_{o})^{2}}x^{2}$. The time to reach maximum height is $t_m=\\frac{v_{o}\\sin\\theta_{o}}{g}$. The total time of flight is $T_f=\\frac{2v_{o}\\sin\\theta_{o}}{g}$. The maximum height is $h_m=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}$, and the horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{0}}{g}$. The range is maximum when the projection angle is $45^{\\circ}$.",
    "topic": "Projectile Motion"
  },
  {
    "content": "Example 3.6\nGalileo stated that 'for elevations which exceed or fall short of 45° by equal amounts, the ranges are equal'. For a projectile with velocity $v_{o}$ at an angle $\\theta_{o}$, the range is $R=\\frac{v_{0}^{2}\\sin2\\theta_{0}}{g}$. For angles $(45+\\alpha)$ and $(45-\\alpha)$, the value of $2\\theta_0$ is $(90+2\\alpha)$ and $(90-2\\alpha)$ respectively. Since $\\sin(90+2\\alpha)$ and $\\sin(90-2\\alpha)$ are both equal to $\\cos(2\\alpha)$, the ranges are equal.",
    "topic": "Projectile Motion"
  },
  {
    "content": "Example 3.7\nA hiker on a cliff 490 m high throws a stone horizontally with an initial speed of $15~m~s^{-1}$. Find the time to reach the ground and the speed with which it hits. We choose the origin at the cliff's edge, with the y-axis pointing up. The equations of motion are $x(t)=x_{o}+v_{ox}t$ and $y(t)=y_{o}+v_{oy}t+\\frac{1}{2}a_{y}t^{2}$. We have $x_{o}=y_{o}=0$, $v_{oy}=0$, $a_{y}=-g=-9.8~m~s^{-2}$, and $v_{ox}=15~m~s^{-1}$. The stone hits the ground when $y(t)=-490~m$. Solving $-490=-\\frac{1}{2}(9.8)t^{2}$ gives $t=10~s$. The velocity components are $v_x=15~m~s^{-1}$ and $v_y=v_{oy}-gt = 0-9.8(10)=-98~m~s^{-1}$. The speed is the magnitude of the velocity, $\\sqrt{v_{x}^{2}+v_{y}^{2}}=\\sqrt{15^{2}+98^{2}}=99~m~s^{-1}$.",
    "topic": "Projectile Motion"
  },
  {
    "content": "Example 3.8\nA cricket ball is thrown at a speed of 28 m $s^{-1}$ in a direction 30° above the horizontal. Calculate: (a) the maximum height, (b) the time taken by the ball to return to the same level, and (c) the distance from the thrower to the point where the ball returns to the same level.\n\n**Answer**\n(a) The maximum height is $h_m=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}=\\frac{(28\\sin30^{\\circ})^{2}}{2(9.8)}m=10.0~m$. (b) The time of flight is $T_f=\\frac{2v_{o}\\sin\\theta_{o}}{g}=\\frac{2(28)\\sin30^{\\circ}}{9.8}\\approx2.9~s$. (c) The horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{o}}{g}=\\frac{28^{2}\\sin60^{\\circ}}{9.8}\\approx69~m$.",
    "topic": "Projectile Motion"
  },
  {
    "content": "Uniform circular motion is when an object follows a circular path at a constant speed. Since the velocity's direction continuously changes, the object undergoes acceleration. The acceleration, called centripetal acceleration, is directed towards the center of the circle and has a magnitude of $a_{c}=\\frac{v^{2}}{R}$. The angular speed $\\omega$ is the time rate of change of angular displacement, $\\omega=\\frac{\\Delta\\theta}{\\Delta t}$. The linear speed v is related to the angular speed by $v=R\\omega$. Therefore, centripetal acceleration can also be expressed as $a_{c}=\\omega^{2}R$. The time for one revolution is the time period T, and the frequency $\\nu$ is the number of revolutions per second ($v=1/T$). This leads to the relations $\\omega=2\\pi\\nu$, $v=2\\pi R\\nu$ and $a_{c}=4\\pi^{2}\\nu^{2}R$.",
    "topic": "Uniform Circular Motion"
  },
  {
    "content": "Example 3.9\nAn insect trapped in a circular groove of radius 12 cm moves along the groove steadily and completes 7 revolutions in 100 s. (a) What is the angular speed and linear speed? (b) Is the acceleration vector a constant vector? What is its magnitude?. \n\n**Answer**\n(a) The angular speed is $\\omega = \\frac{2\\pi}{T} = \\frac{2\\pi \\times 7}{100} \\approx 0.44~rad/s$. The linear speed is $v=\\omega R=0.44~rad/s\\times12~cm=5.3~cm/s$. (b) The acceleration vector is not a constant vector because its direction continuously changes, always pointing towards the center of the circle. However, its magnitude is constant: $a=\\omega^{2}R=(0.44~s^{-1})^2(12~cm)\\approx2.3~cm~s^{-2}$.",
    "topic": "Uniform Circular Motion"
  },
  {
    "content": "1. Scalar quantities have only magnitude, while vectors have both magnitude and direction.\n2. A vector multiplied by a real number changes its magnitude by that factor, and its direction may reverse if the scalar is negative.\n3. Vectors are added using graphical methods (head-to-tail, parallelogram). Vector addition is commutative ($A+B=B+A$) and associative ($(A+B)+C=A+(B+C)$).\n4. A null vector has zero magnitude. Vector subtraction is defined as the addition of the negative of a vector.\n5. A vector can be resolved into components along perpendicular axes, such as $A=A_{x}\\hat{i}+A_{y}\\hat{j}$.\n6. The analytical method of vector addition involves summing the corresponding components.\n7. The velocity is the derivative of the position vector with respect to time ($v=\\frac{dr}{dt}$). Acceleration is the derivative of the velocity vector with respect to time ($a=\\frac{dv}{dt}$).\n8. For motion with constant acceleration, the kinematic equations are $r=r_{o}+v_{o}t+\\frac{1}{2}at^{2}$ and $v=v_{0}+at$.\n9. A projectile follows a parabolic path. The maximum height is $h_{m}=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}$, and the horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{0}}{g}$.\n10. Uniform circular motion involves a constant speed but a continuously changing velocity and acceleration. The centripetal acceleration is $a_c=\\frac{v^2}{R}=\\omega^2R$.",
    "topic": "SUMMARY"
  },
  {
    "content": "In the preceding Chapter, our concern was to describe the motion of a particle in space quantitatively. We saw that uniform motion needs the concept of velocity alone whereas non-uniform motion requires the concept of acceleration in addition. So far, we have not asked the question as to what governs the motion of bodies. In this chapter, we turn to this basic question. To move a football at rest, someone must kick it. To throw a stone upwards, one has to give it an upward push. A breeze causes the branches of a tree to swing; a strong wind can even move heavy objects. A boat moves in a flowing river without anyone rowing it. Clearly, some external agency is needed to provide force to move a body from rest. Likewise, an external force is needed also to retard or stop motion. You can stop a ball rolling down an inclined plane by applying a force against the direction of its motion. In these examples, the external agency of force (hands, wind, stream, etc) is in contact with the object. This is not always necessary. A stone released from the top of a building accelerates downward due to the gravitational pull of the earth. A bar magnet can attract an iron nail from a distance. This shows that external agencies (e.g. gravitational and magnetic forces) can exert force on a body even from a distance. In short, a force is required to put a stationary body in motion or stop a moving body, and some external agency is needed to provide this force. The external agency may or may not be in contact with the body. But what if a body is moving uniformly (e.g. a skater moving straight with constant speed on a horizontal ice slab)? Is an external force required to keep a body in uniform motion?",
    "topic": "LAWS OF MOTION"
  },
  {
    "content": "The question posed above appears to be simple. However, it took ages to answer it. Indeed, the correct answer to this question given by Galileo in the seventeenth century was the foundation of Newtonian mechanics, which signalled the birth of modern science. The Greek thinker, Aristotle (384 B.C-322 B.C.), held the view that if a body is moving, something external is required to keep it moving. The Aristotelian law of motion may be phrased thus: An external force is required to keep a body in motion. This law is flawed because a moving toy car, for example, comes to rest because the external force of friction on the car by the floor opposes its motion. To counter this force, a child has to apply an external force on the car in the direction of motion. When the car is in uniform motion, there is no net external force acting on it: the force by the child cancels the force (friction) by the floor. If there were no friction, the child would not be required to apply any force to keep the toy car in uniform motion. Galileo imagined a world without frictional forces to arrive at the true law of nature for forces and motion.",
    "topic": "Aristotle's Fallacy"
  },
  {
    "content": "Galileo studied motion of objects on an inclined plane. He concluded that an object moving on a frictionless horizontal plane must neither have acceleration nor retardation, i.e. it should move with constant velocity. Another experiment by Galileo involved a double inclined plane, where a ball released from rest on one plane would climb up the other. In the ideal situation, when friction is absent, the final height of the ball is the same as its initial height. In the limiting case, when the slope of the second plane is zero (i.e. is a horizontal), the ball would travel an infinite distance, and its motion would never cease. Galileo arrived at the insight that the state of rest and the state of uniform linear motion (motion with constant velocity) are equivalent. In both cases, there is no net force acting on the body. To maintain a body in uniform motion, an external force is needed to counter the frictional force, so that the two forces sum up to zero net external force. This property of the body is called inertia, which means 'resistance to change'. A body does not change its state of rest or uniform motion unless an external force compels it to change that state. The state of rest or uniform linear motion both imply zero acceleration. The first law of motion can be simply expressed as: If the net external force on a body is zero, its acceleration is zero.",
    "topic": "The Law of Inertia"
  },
  {
    "content": "Ancient Indian thinkers had arrived at an elaborate system of ideas on motion. Force was thought to be of different kinds: force due to continuous pressure (nodan), impact (abhighat), persistent tendency (sanskara) to move in a straight line (vega), or restoration of shape in an elastic body. The notion of (vega) perhaps comes closest to the concept of inertia. Vega, the tendency to move in a straight line, was thought to be opposed by contact with objects including atmosphere, a parallel to the ideas of friction and air resistance. It was correctly summarised that the different kinds of motion (translational, rotational and vibrational) of an extended body arise from only the translational motion of its constituent particles. There was considerable focus in Indian thought on measurement of motion and units of length and time. Bhaskara (1150 A.D.) had introduced the concept of 'instantaneous motion' (tatkaliki gati), which anticipated the modern notion of instantaneous velocity using Differential Calculus. The difference between a wave and a current (of water) was clearly understood.",
    "topic": "Ideas on Motion in Ancient Indian Science"
  },
  {
    "content": "Galileo's ideas were the starting point for Isaac Newton, who formulated the three laws of motion. Newton's first law of motion states: Every body continues to be in its state of rest or of uniform motion in a straight line unless compelled by some external force to act otherwise. If the net external force on a body is zero, its acceleration is zero. For example, a spaceship in interstellar space with its rockets turned off has no net external force acting on it, so its acceleration must be zero. If it is in motion, it continues to move with a uniform velocity. On Earth, an object at rest or in uniform linear motion is not because there are no forces acting on it, but because the various external forces cancel out to give a zero net external force. The property of inertia is evident when a bus suddenly starts or stops, causing passengers to be thrown backward or forward, respectively.",
    "topic": "Newton's first law of motion"
  },
  {
    "content": "Example 4.1\nAn astronaut accidentally gets separated out of his small spaceship accelerating in inter stellar space at a constant rate of 100 $s^{-2}$ What is the acceleration of the astronaut the instant after he is outside the spaceship? (Assume that there are no nearby stars to exert gravitational force on him.).\n\n**Answer**\nSince there are no nearby stars to exert gravitational force on him and the small spaceship exerts negligible gravitational attraction on him, the net force acting on the astronaut, once he is out of the spaceship, is zero. By the first law of motion the acceleration of the astronaut is zero.",
    "topic": "Newton's first law of motion"
  },
  {
    "content": "The first law refers to the simple case when the net external force on a body is zero. The second law of motion refers to the general situation when there is a net external force acting on the body. It relates the net external force to the acceleration of the body. Momentum (p) of a body is defined as the product of its mass (m) and velocity (v): $p=mv$ (4.1). The rate of change of momentum of a body is directly proportional to the applied force and takes place in the direction in which the force acts. The second law can be expressed as $F=k\\frac{dp}{dt}$ where k is a constant of proportionality. For a body of fixed mass, this can be written as $F=kma$. In SI units, k is chosen to be 1, so the law becomes $F=\\frac{dp}{dt}=ma$. The SI unit of force is the newton (N), defined as $1~N=1~kg~m~s^{-2}$. The second law is a vector law and is consistent with the first law (F=0 implies a=0). The acceleration at an instant is determined by the force at that instant, not by the history of the motion. The second law applies to a single point particle, a rigid body, or a system of particles, where F is the total external force and a is the acceleration of the system's center of mass. Impulse is defined as the product of force and time duration, which equals the change in momentum. For a seasoned cricketer catching a ball, drawing hands backward increases the time for the momentum change, thus requiring a smaller force.",
    "topic": "Newton's second law of motion"
  },
  {
    "content": "Example 4.2\nA bullet of mass 0.04 kg moving with a speed of 90 m $S^{-1}$ enters a heavy wooden block and is stopped after a distance of 60 cm. What is the average resistive force exerted by the block on the bullet?\n\n**Answer**\nThe retardation 'a' of the bullet (assumed constant) is given by $a=\\frac{-u^{2}}{2s}=\\frac{-90\\times90}{2\\times0.6}m~s^{-2}=-6750~m~s^{-2}$. The retarding force, by the second law of motion, is $F=0.04~kg\\times6750~m~s^{-2}=270~N$. The actual resistive force and retardation may not be uniform, so the answer indicates the average resistive force.",
    "topic": "Newton's second law of motion"
  },
  {
    "content": "Example 4.3\nThe motion of a particle of mass m is described by $y=ut+\\frac{1}{2}gt^{2}$. Find the force acting on the particle.\n\n**Answer**\nWe know $y=ut+\\frac{1}{2}gt^{2}$. The velocity is $v=\\frac{dy}{dt}=u+gt$. The acceleration is $a=\\frac{dv}{dt}=g$. Then the force is given by Eq. (4.5) as $F=ma=mg$. The given equation describes the motion of a particle under acceleration due to gravity.",
    "topic": "Newton's second law of motion"
  },
  {
    "content": "Impulse is the product of force and time duration, and it equals the change in momentum. It is a useful concept when a large force acts for a very short duration, producing a finite change in momentum. For example, when a ball hits a wall, the force and time duration are hard to measure separately, but the impulse (change in momentum) is a measurable quantity. A large force acting for a short time to produce a finite change in momentum is called an impulsive force. Newtonian mechanics makes no distinction between impulsive forces and other forces, except that they are large and short-acting.",
    "topic": "Impulse"
  },
  {
    "content": "Example 4.4\nA batsman hits back a ball straight in the direction of the bowler without changing its initial speed of $12ms^{-1}$. If the mass of the ball is 0.15 kg, determine the impulse imparted to the ball. (Assume linear motion of the ball).\n\n**Answer**\nChange in momentum is $0.15\\times12-(-0.15\\times12)=3.6~N~s$. The impulse is 3.6 N s, in the direction from the batsman to the bowler. This example shows that the impulse can be calculated even when the force and contact time are difficult to know.",
    "topic": "Impulse"
  },
  {
    "content": "Newton's third law of motion states: To every action, there is always an equal and opposite reaction. A clear way to state the law is that forces always occur in pairs. The force on body A by B is equal and opposite to the force on body B by A ($F_{AB}=-F_{BA}$). The terms 'action' and 'reaction' mean nothing else but 'force'. There is no cause-effect relation implied; the forces act at the same instant. Action and reaction forces act on different bodies, so they cannot cancel each other out when considering the motion of a single body. However, for a system of two bodies, the internal action and reaction forces cancel away in pairs.",
    "topic": "Newton's third law of motion"
  },
  {
    "content": "Example 4.5\nTwo identical billiard balls strike a rigid wall with the same speed but at different angles, and get reflected without any change in speed, as shown in Fig. 4.6. What is (i) the direction of the force on the wall due to each ball? (ii) the ratio of the magnitudes of impulses imparted to the balls by the wall?\n\n**Answer**\nAn instinctive but wrong answer is that the force on the wall in case (b) is inclined at 30 degrees to the normal. The force on the wall is normal to the wall in both cases. Let u be the speed and m be the mass of each ball. We choose x and y axes as shown in the figure.\nCase (a): The initial x-component of momentum is $p_{x,initial}=mu$, and the final x-component is $p_{x,final}=-mu$. The y-component of momentum is zero both before and after the collision. The x-component of impulse is the change in momentum, which is $-2mu$. The force on the ball is in the negative x-direction, normal to the wall. By Newton's third law, the force on the wall is in the positive x-direction, normal to the wall.\nCase (b): The initial x-component of momentum is $(p_{x})_{initial}=mu\\cos30^{\\circ}$ and the final is $(p_{x})_{final}=-mu\\cos30^{\\circ}$. The y-component of momentum does not change. The x-component of impulse is $-2mu\\cos30^{\\circ}$. The direction of force is again normal to the wall along the negative x-direction. By Newton's third law, the force on the wall is normal to the wall along the positive x-direction. The ratio of the magnitudes of the impulses in (a) and (b) is $\\frac{2mu}{2mu\\cos30^{\\circ}}=\\frac{1}{\\cos30^{\\circ}}=\\frac{2}{\\sqrt{3}}\\approx1.2$.",
    "topic": "Newton's third law of motion"
  },
  {
    "content": "The second and third laws of motion lead to the law of conservation of momentum. In an isolated system (one with no external force), the mutual forces between pairs of particles in the system can cause individual momentum changes, but since these forces are equal and opposite, the total momentum remains unchanged. This is the law of conservation of momentum: The total momentum of an isolated system of interacting particles is conserved. For a collision between two bodies A and B, with initial momenta $p_{A}$ and $p_{B}$, and final momenta $p'_{A}$ and $p'_{B}$ respectively, the total final momentum equals the initial momentum: $p'_{A}+p'_{B}=p_{A}+p_{B}$. This holds true for both elastic and inelastic collisions.",
    "topic": "Conservation of momentum"
  },
  {
    "content": "Equilibrium of a particle in mechanics occurs when the net external force on it is zero. According to the first law, this means the particle is either at rest or in uniform motion. If two forces $F_{1}$ and $F_{2}$ act on a particle, equilibrium requires $F_{1}=-F_{2}$. For three concurrent forces $F_{1}$, $F_{2}$, and $F_{3}$, equilibrium requires their vector sum to be zero: $F_{1}+F_{2}+F_{3}=0$. The three forces in equilibrium can be represented by the sides of a closed triangle. This can be generalized to any number of forces, where they can be represented by the sides of a closed n-sided polygon. The component form of the equilibrium condition for three forces is $F_{1x}+F_{2x}+F_{3x}=0$, $F_{1y}+F_{2y}+F_{3y}=0$, and $F_{1z}+F_{2z}+F_{3z}=0$.",
    "topic": "Equilibrium of a particle"
  },
  {
    "content": "Example 4.6\nA mass of 6 kg is suspended by a rope of length 2 m from the ceiling. A force of 50 N is applied horizontally at the midpoint P of the rope. What is the angle the rope makes with the vertical in equilibrium? (Take $g=10~m~s^{-2}$). Neglect the mass of the rope.\n\n**Answer**\nFigures 4.8(b) and 4.8(c) are free-body diagrams. Considering the equilibrium of the weight W, the tension $T_{2}=6\\times10=60$ N. For the equilibrium of point P under the three forces ($T_{1}$, $T_{2}$, and 50 N), the horizontal and vertical components of the resultant force must vanish. This gives the equations: $T_{1}\\cos\\theta=T_{2}=60~N$ and $T_{1}\\sin\\theta=50~N$. Dividing the two equations gives $\\tan\\theta=\\frac{50}{60}=\\frac{5}{6}$, so $\\theta=\\tan^{-1}(\\frac{5}{6})\\approx40^{\\circ}$. The answer does not depend on the length of the rope or where the force is applied.",
    "topic": "Equilibrium of a particle"
  },
  {
    "content": "In mechanics, we encounter several types of forces. The gravitational force is pervasive and can act at a distance. Other common forces are contact forces, which arise from contact with other objects. The component of a contact force normal to the surfaces is called normal reaction, and the component parallel to the surfaces is called friction. Other examples of contact forces include buoyant force, viscous force, and air resistance. Tension in a string and the force due to a spring are also common forces. For a spring, the restoring force F is proportional to the displacement x ($F=-kx$), where k is the force constant. At the microscopic level, these contact forces arise from electrical forces between the charged constituents of bodies.",
    "topic": "Common forces in mechanics"
  },
  {
    "content": "Friction is a force that comes into play when there is an applied force on a body, and it opposes the impending or actual relative motion between surfaces in contact. Static friction ($f_{s}$) opposes impending motion, and its limiting value is $(f_{s})_{max}=\\mu_{s}N$, where $\\mu_{s}$ is the coefficient of static friction and N is the normal force. Kinetic friction ($f_{k}$) opposes actual relative motion once a body is sliding, and it is given by $f_{k}=\\mu_{k}N$, where $\\mu_{k}$ is the coefficient of kinetic friction. Experiments show that $\\mu_{k}$ is less than $\\mu_{s}$. Friction is independent of the area of contact and is nearly independent of velocity. Static friction is essential for daily activities like walking and for a car to accelerate.",
    "topic": "Friction"
  },
  {
    "content": "Example 4.7\nDetermine the maximum acceleration of the train in which a box lying on its floor will remain stationary, given that the co-efficient of static friction between the box and the train's floor is 0.15.\n\n**Answer**\nSince the acceleration of the box is due to the static friction, $ma=f_{s}\\le\\mu_{s}N=\\mu_{s}mg$. This means $a\\le\\mu_{s}g$, so the maximum acceleration is $a_{max}=\\mu_{s}g=0.15\\times10~m~s^{-2}=1.5~m~s^{-2}$.",
    "topic": "Friction"
  },
  {
    "content": "Example 4.8\nA mass of 4 kg rests on a horizontal plane. The plane is gradually inclined until at an angle $\\theta=15^{\\circ}$ with the horizontal, the mass just begins to slide. What is the coefficient of static friction between the block and the surface?\n\n**Answer**\nThe forces acting on the block are weight (mg), normal force (N), and static frictional force ($f_{s}$). In equilibrium, the resultant of these forces is zero. Resolving the weight along the two directions gives $mg\\sin\\theta=f_{s}$ and $mg\\cos\\theta=N$. When the block is about to slide, the static friction reaches its maximum value, $(f_{s})_{max}=\\mu_{s}N$. Therefore, $\\tan\\theta_{max}=\\mu_{s}$ or $\\theta_{max}=\\tan^{-1}\\mu_{s}$. For $\\theta_{max}=15^{\\circ}$, $\\mu_{s}=\\tan15^{\\circ}=0.27$.",
    "topic": "Friction"
  },
  {
    "content": "Example 4.9\nWhat is the acceleration of the block and trolley system shown in Fig. 4.12(a), if the coefficient of kinetic friction between the trolley and the surface is 0.04? What is the tension in the string? (Take $g=10~m/s^{2}$). Neglect the mass of the string.\n\n**Answer**\nSince the string is inextensible and the pulley is smooth, the 3 kg block and the 20 kg trolley have the same magnitude of acceleration. Applying the second law to the block: $30-T=3a$. Applying the second law to the trolley: $T-f_{k}=20a$. The kinetic friction is $f_{k}=\\mu_{k}N=\\mu_{k}mg=0.04\\times(20\\times10)=8~N$. The equation for the trolley's motion is $T-8=20a$. Solving these two equations gives $a=\\frac{22}{23}~m~s^{-2}\\approx0.96~m~s^{-2}$ and $T=27.1~N$.",
    "topic": "Friction"
  },
  {
    "content": "A body rolling without slipping over a horizontal plane will, in an ideal situation, experience no friction. In practice, however, rolling friction does occur, and an applied force is needed to keep the body rolling. For the same weight, rolling friction is much smaller than static or sliding friction, which is why the discovery of the wheel was a major milestone. Rolling friction is caused by the slight deformation of the surfaces in contact, resulting in a finite area of contact rather than a single point. Rolling friction is often undesirable in machines, and lubricants or ball bearings are used to reduce it.",
    "topic": "Rolling friction"
  },
  {
    "content": "The acceleration of a body moving in a circle of radius R with uniform speed v is $v^{2}/R$ directed towards the centre. According to Newton's second law, the force providing this acceleration is the centripetal force, $f_{c}=\\frac{mv^{2}}{R}$ (4.16). This force is always directed towards the center. For a car taking a circular turn on a horizontal road, the centripetal force is provided by the force of static friction. The maximum speed for a car on a level road is given by $v_{max}=\\sqrt{\\mu_{s}Rg}$ (4.18), which is independent of the car's mass. On a banked road, the horizontal components of the normal force and the frictional force provide the centripetal force. The maximum permissible speed on a banked road is given by $v_{max}=(Rg\\frac{\\mu_{s}+tan\\theta}{1-\\mu_{s}tan\\theta})^{1/2}$ (4.21). At the optimum speed, $v_{o}=(R~g~tan~\\theta)^{1/2}$, frictional force is not needed at all.",
    "topic": "Circular motion"
  },
  {
    "content": "Example 4.10\nA cyclist speeding at $18~km/h$ on a level road takes a sharp circular turn of radius 3 m without reducing the speed. The co-efficient of static friction between the tyres and the road is 0.1. Will the cyclist slip while taking the turn?\n\n**Answer**\nOn an unbanked road, the condition for not slipping is $v^{2}\\le\\mu_{s}R~g$. Given $R=3~m, g=9.8~m~s^{-2}, \\mu_{s}=0.1$, the value of $\\mu_{s}Rg$ is $2.94~m^{2}s^{-2}$. The speed of the cyclist is $v=18~km/h=5~ms^{-1}$, so $v^{2}=25~m^{2}s^{-2}$. Since the condition is not obeyed ($25 > 2.94$), the cyclist will slip.",
    "topic": "Circular motion"
  },
  {
    "content": "Example 4.11\nA circular racetrack of radius 300 m is banked at an angle of 15°. If the coefficient of friction between the wheels of a race-car and the road is 0.2, what is the (a) optimum speed of the race-car to avoid wear and tear on its tyres, and (b) maximum permissible speed to avoid slipping?\n\n**Answer**\n(a) The optimum speed $v_{o}$ is given by $v_{o}=(R~g~tan~\\theta)^{1/2}$ (4.22). With $R=300~m, \\theta=15^{\\circ}, g=9.8~m~s^{-2}$, the optimum speed is $v_{o}=28.1~m~s^{-1}$.\n(b) The maximum permissible speed $v_{max}$ is given by $v_{max}=(Rg\\frac{\\mu_{s}+tan\\theta}{1-\\mu_{s}tan\\theta})^{1/2}$ (4.21). Substituting the values, we get $v_{max}=38.1~m~s^{-1}$.",
    "topic": "Circular motion"
  },
  {
    "content": "To solve problems in mechanics, one can choose any part of an assembly of bodies as a 'system' and apply the laws of motion to it, including all forces from the environment on that system. A useful tool for this is a 'free-body diagram', which is a separate diagram showing the chosen system and all the forces acting on it. When using free-body diagrams for different systems, Newton's third law should be employed: if a force on body A due to B is shown as F, then the force on B due to A must be shown as -F.",
    "topic": "Solving problems in mechanics"
  },
  {
    "content": "Example 4.12\nA wooden block of mass 2 kg rests on a soft horizontal floor. An iron cylinder of mass 25 kg is placed on top of the block, and the floor yields, causing the block and cylinder to go down with an acceleration of $0.1~m~s^{-2}$. What is the action of the block on the floor (a) before and (b) after the floor yields? (Take $g=10~m~s^{-2}$). Identify the action-reaction pairs in the problem.\n\n**Answer**\n(a) Before the floor yields, the block is at rest. The force of gravity on the block is $2\\times10=20~N$ and the normal force R from the floor is also 20 N (by the First Law). By the third law, the action of the block on the floor is 20 N downwards.\n(b) After the floor yields, the total mass is $2+25=27~kg$. The system accelerates downwards with $0.1~m~s^{-2}$. The forces on the system are gravity ($27\\times10=270~N$) and the normal force $R'$ from the floor. Applying the second law to the system: $270-R'=27\\times0.1$, which gives $R'=267.3~N$. By the third law, the action of the system on the floor is 267.3 N downwards.\n**Action-reaction pairs**\n* For (a): The force of gravity (20 N) on the block by the earth and the force of gravity on the earth by the block (reaction). Also, the force on the floor by the block and the force on the block by the floor.\n* For (b): The force of gravity (270 N) on the system by the earth and the force of gravity on the earth by the system (reaction). Also, the force on the floor by the system and the force on the system by the floor. Additionally, the force on the block by the cylinder and the force on the cylinder by the block form an action-reaction pair.",
    "topic": "Solving problems in mechanics"
  },
  {
    "content": "1. Aristotle's view that a force is necessary to keep a body in uniform motion is wrong. In practice, a force is necessary to counter opposing forces like friction.\n2. Newton's first law of motion is based on Galileo's law of inertia: \"Everybody continues to be in its state of rest or of uniform motion in a straight line unless compelled by some external force to act otherwise\". In simple terms, if the net external force on a body is zero, its acceleration is zero.\n3. Momentum (p) is the product of a body's mass (m) and velocity (v): $p=mv$.\n4. Newton's second law states that the rate of change of momentum is proportional to the applied force. The equation is $F=\\frac{dp}{dt}=ma$, where F is the net external force and a is acceleration. The SI unit of force is the newton ($1~N=1~kg~m~s^{-2}$).\n5. Impulse is the product of force and time, equal to the change in momentum.\n6. Newton's third law states: \"To every action, there is always an equal and opposite reaction\". Forces always occur in pairs, acting on different bodies.\n7. The law of conservation of momentum states that the total momentum of an isolated system of particles is conserved, a consequence of the second and third laws.\n8. Frictional force opposes impending or actual relative motion between surfaces. Static friction ($f_{s}$) opposes impending motion ($f_{s}\\le\\mu_{s}R$), and kinetic friction ($f_{k}$) opposes actual motion ($f_{k}=\\mu_{k}R$). The coefficient of kinetic friction $\\mu_{k}$ is less than the coefficient of static friction $\\mu_{s}$.\n9. The centripetal force is not a new kind of force but is the force that provides the inward radial acceleration for circular motion.",
    "topic": "SUMMARY"
  },
  {
    "content": "Measurement of any physical quantity involves comparison with a certain basic, arbitrarily chosen, internationally accepted reference standard called unit. The result of a measurement of a physical quantity is expressed by a number (or numerical measure) accompanied by a unit. Although the number of physical quantities appears to be very large, we need only a limited number of units for expressing all the physical quantities, since they are inter- related with one another. The units for the fundamental or base quantities are called fundamental or base units. The units of all other physical quantities can be expressed as combinations of the base units. Such units obtained for the derived quantities are called derived units. A complete set of these units, both the base units and derived units, is known as the system of units.",
    "topic": "UNITS  AND  MEASUREMENT"
  },
  {
    "content": "In earlier time scientists of different countries were using different systems of units for measurement. Three such systems, the CGS, the FPS (or British) system and the MKS system were in use extensively till recently. The base units for length, mass and time in these systems were as follows: In CGS system they were centimetre, gram and second respectively. In FPS system they were foot, pound and second respectively. In MKS system they were metre, kilogram and second respectively. The system of units which is at present internationally accepted for measurement is the Système Internationale d' Unites (French for International System of Units), abbreviated as SI. The SI, with standard scheme of symbols, units and abbreviations, developed by the Bureau International des Poids et measures (The International Bureau of Weights and Measures, BIPM) in 1971 were recently revised by the General Conference on Weights and Measures in November 2018. The scheme is now for international usage in scientific, technical, industrial and commercial work. Because SI units used decimal system, conversions within the system are quite simple and convenient. We shall follow the SI units in this book. In SI, there are seven base units as given in Table 1.1. Besides the seven base units, there are two more units that are defined for (a) plane angle $d\\theta$ as the ratio of length of arc ds to the radius r and (b) solid angle $d\\Omega$ as the ratio of the intercepted area dA of the spherical surface, described about the apex O as the centre, to the square of its radius r, as shown in Fig. 1.1(a) and (b) respectively. The unit for plane angle is radian with the symbol rad and the unit for the solid angle is steradian with the symbol sr. Both these are dimensionless quantities.",
    "topic": "The International System of Units"
  },
  {
    "content": "Base quantity: Length, Name: metre, Symbol: m, Definition: The metre, symbol m, is the SI unit of length. It is defined by taking the fixed numerical value of the speed of light in vacuum c to be 299792458 when expressed in the unit m $S^{-1}$, where the second is defined in terms of the caesium frequency $\\Delta Vcs$.\nBase quantity: Mass, Name: kilogram, Symbol: kg, Definition: The kilogram, symbol kg, is the SI unit of mass. It is defined by taking the fixed numerical value of the Planck constant h to be 6.62607015 $10^{-34}$ when expressed in the unit J s, which is equal to $kg~m^{2}s^{-1}$ where the metre and the second are defined in terms of e and $\\Delta VCs$.\nBase quantity: Time, Name: second, Symbol: s, Definition: The second, symbol s, is the SI unit of time. It is defined by taking the fixed numerical value of the caesium frequency $\\Delta VCs$, the unperturbed ground- state hyperfine transition frequency of the caesium-133 atom, to be 9192631770 when expressed in the unit Hz, which is equal to $s^{-1}$.\nBase quantity: Electric current, Name: ampere, Symbol: A, Definition: The ampere, symbol A, is the SI unit of electric current. It is defined by taking the fixed numerical value of the elementary charge e to be 1.602176634 $10^{-19}$ when expressed in the unit C. which is equal to A s. where the second is defined in terms of $\\Delta V_{CS}$.\nBase quantity: Thermodynamic Temperature, Name: kelvin, Symbol: K, Definition: The kelvin, symbol K. is the SI unit of thermodynamic temperature. It is defined by taking the fixed numerical value of the Boltzmann constant k to be 1.380649 $10^{-23}$ when expressed in the unit J $K^{-1}$ which is equal to kg m² $s^{-2}k^{-1}$, where the kilogram, metre and second are defined in terms of h, c and $\\Delta Vcs$.",
    "topic": "SI Base Quantities and Units"
  },
  {
    "content": "Base quantity: Amount of substance, Name: mole, Symbol: mol., Definition: The mole, symbol mol. is the SI unit of amount of substance. One mole contains exactly 6.02214076 $10^{23}$ elementary entities. This number is the fixed numerical value of the Avogadro constant, $N_{*},$ when expressed in the unit mol and is called the Avogadro number. The amount of substance, symbol n, of a system is a measure of the number of specified elementary entities. An elementary entity may be an atom, a molecule, an ion, an electron, any other particle or specified group of particles.\nBase quantity: Luminous intensity, Name: candela, Symbol: cd, Definition: The candela, symbol cd, is the SI unit of luminous intensity in given direction. It is defined by taking the fixed numerical value of the luminous efficacy of monochromatic radiation of frequency 540 $10^{12}$ Hz, $K_{cd^{+}}$ to be 683 when expressed in the unit Im $W^{-1}$ which is equal to cd sr $W^{-1}.$ or cd sr $kg^{-1}m^{-2}s^{3}$ where the kilogram, metre and second are defined in terms of h, c and $\\Delta VCs$.\nThe values mentioned here need not be remembered or asked in a test. They are given here only to indicate the extent of accuracy to which they are measured. With progress in technology, the measuring techniques get improved leading to measurements with greater precision. The definitions of base units are revised to keep up with this progress.",
    "topic": "SI Base Quantities and Units"
  },
  {
    "content": "Name: minute, Symbol: min, Value in SI Unit: 60 s\nName: hour, Symbol: h, Value in SI Unit: $60~min=3600~s$\nName: day, Symbol: d, Value in SI Unit: $24~h=86400~s$\nName: year, Symbol: , Value in SI Unit: $365.25~d=3.156\\times10^{7};s$\nName: degree, Symbol: , Value in SI Unit: $1^{\\circ}=(\\pi/180)ri$ rad\nName: litre, Symbol: L, Value in SI Unit: $I~dm^{3}=10^{-3}m^{3}$\nName: tonne, Symbol: t, Value in SI Unit: $10^{3}$ kg\nName: carat, Symbol: C, Value in SI Unit: 200 mg\nName: bar, Symbol: bar, Value in SI Unit: $0.1~MPa=10^{6}Pa$\nName: curie, Symbol: Ci, Value in SI Unit: $3.7\\times10^{10}s^{-1}$\nName: roentgen, Symbol: R, Value in SI Unit: $2.58\\times10^{-1}C/kg$\nName: quintal, Symbol: q, Value in SI Unit: 100 kg\nName: barn, Symbol: b, Value in SI Unit: $100~fm^{2}=10^{-28}m^{2}$\nName: are, Symbol: a, Value in SI Unit: $1~dam^{2}=10^{2}m^{2}$\nName: hectare, Symbol: ha, Value in SI Unit: $1~hm^{2}=10^{4}m^{2}$\nName: standard atmospheric pressure, Symbol: atm, Value in SI Unit: $101325~Pa=1.013\\times10^{5}Pa$",
    "topic": "Some units retained for general use (Though outside SI)"
  },
  {
    "content": "Note that when mole is used, the elementary entities must be specified. These entities may be atoms, molecules, ions, electrons, other particles or specified groups of such particles. We employ units for some physical quantities that can be derived from the seven base units (Appendix A 6). Some derived units in terms of the SI base units are given in (Appendix A 6.1). Some SI derived units are given special names (Appendix A 6.2) and some derived SI units make use of these units with special names and the seven base units (Appendix A 6.3). These are given in Appendix A 6.2 and A 6.3 for your ready reference. Other units retained for general use are given in Table 1.2. Common SI prefixes and symbols for multiples and sub-multiples are given in Appendix A2. General guidelines for using symbols for physical quantities, chemical elements and nuclides are given in Appendix A7 and those for SI units and some other units are given in Appendix A8 for your guidance and ready reference. As discussed above, every measurement involves errors. Thus, the result of measurement should be reported in a way that indicates the precision of measurement. Normally, the reported result of measurement is a number that includes all digits in the number that are known reliably plus the first digit that is uncertain. The reliable digits plus the first uncertain digit are known as significant digits or significant figures. If we say the period of oscillation of a simple pendulum is 1.62 s, the digits 1 and 6 are reliable and certain, while the digit 2 is uncertain. Thus, the measured value has three significant figures. The length of an object reported after measurement to be 287.5 cm has four significant figures, the digits 2, 8, 7 are certain while the digit 5 is uncertain. Clearly, reporting",
    "topic": "Significant Figures"
  },
  {
    "content": "2 is uncertain. Thus, the measured value has three significant figures. The length of an object reported after measurement to be 287.5 cm has four significant figures, the digits 2, 8, 7 are certain while the digit 5 is uncertain. Clearly, reporting the result of measurement that includes more digits than the significant digits is superfluous and also misleading since it would give a wrong idea about the precision of measurement. The rules for determining the number of significant figures can be understood from the following examples. Significant figures indicate, as already mentioned, the precision of measurement which depends on the least count of the measuring instrument. A choice of change of different units does not change the number of significant digits or figures in a measurement. This important remark makes most of the following observations clear: (1) For example, the length 2.308 cm has four significant figures. But in different units, the same value can be written as 0.02308 m or 23.08 mm or $23080~\\mu m$. All these numbers have the same number of significant figures (digits 2, 3, 0, 8), namely four.",
    "topic": "Significant Figures"
  },
  {
    "content": "This shows that the location of decimal point is of no consequence in determining the number of significant figures. The example gives the following rules:\nAll the non-zero digits are significant.\nAll the zeros between two non-zero digits are significant, no matter where the decimal point is, if at all.\nIf the number is less than 1, the zero(s) on the right of decimal point but to the left of the first non-zero digit are not significant. [In 0.00 2308, the underlined zeroes are not significant].\nThe terminal or trailing zero(s) in a number without a decimal point are not significant. [Thus $123~m=12300~cm=123000$ mm has three significant figures, the trailing zero(s) being not significant.] However, you can also see the next observation.\nThe trailing zero(s) in a number with a decimal point are significant. [The numbers 3.500 or 0.06900 have four significant figures each.]\n(2) There can be some confusion regarding the trailing zero(s). Suppose a length is reported to be 4.700 m. It is evident that the zeroes here are meant to convey the precision of measurement and are, therefore, significant. [If these were not, it would be superfluous to write them explicitly, the reported measurement would have been simply 4.7 ml. Now suppose we change units, then $4.700~m=470.0~cm=4700~mm=0.004700~km$. Since the last number has trailing zero(s) in a number with no decimal, we would conclude erroneously from observation (1) above that the number has two significant figures, while in fact, it has four significant figures and a mere change of units cannot change the number of significant figures.",
    "topic": "Rules for Significant Figures"
  },
  {
    "content": "(3) To remove such ambiguities in determining the number of significant figures, the best way is to report every measurement in scientific notation (in the power of 10). In this notation, every number is expressed as $a\\times10^{b}$ where a is a number between 1 and 10, and b is any positive or negative exponent (or power) of 10. In order to get an approximate idea of the number, we may round off the number a to 1 (for $a\\le5$) and to 10 (for $5<a\\le10)$. Then the number can be expressed approximately as $10^{b}$ in which the exponent (or power) b of 10 is called order of magnitude of the physical quantity. When only an estimate is required, the quantity is of the order of $10^{b}$ For example, the diameter of the earth $(1.28\\times10^{7}m)$ is of the order of $10^{7}m$ with the order of magnitude 7. The diameter of hydrogen atom $(1.06\\times10^{-10}m)$ is of the order of $10^{-10}m$, with the order of magnitude -10. Thus, the diameter of the earth is 17 orders of magnitude larger than the hydrogen atom. It is often customary to write the decimal after the first digit. Now the confusion mentioned in (a) above disappears : $4.700~m=4.700\\times10^{2}cm =4.700\\times10^{3}mm=4.700\\times10^{-3}km$. The power of 10 is irrelevant to the determination of significant figures. However, all zeroes appearing in the base number in the scientific notation are significant. Each number in this case has four significant figures. Thus, in the scientific notation, no confusion arises about the trailing zero(s) in the base number a. They are always significant.",
    "topic": "Rules for Significant Figures"
  },
  {
    "content": "(4) The scientific notation is ideal for reporting measurement. But if this is not adopted, we use the rules adopted in the preceding example : For a number greater than 1, without any decimal, the trailing zero(s) are not significant. For a number with a decimal, the trailing zero(s) are significant.\n(5) The digit 0 conventionally put on the left of a decimal for a number less than 1 (like 0.1250) is never significant. However, the zeroes at the end of such number are significant in a measurement.\n(6) The multiplying or dividing factors which are neither rounded numbers nor numbers representing measured values are exact and have infinite number of significant digits. For example in $r=\\frac{d}{2}$ or $s=2\\pi r$ the factor 2 is an exact number and it can be written as 2.0, 2.00 or 2.0000 as required. Similarly, in $T=\\frac{t}{n}$, n is an exact number.",
    "topic": "Rules for Significant Figures"
  },
  {
    "content": "The result of a calculation involving approximate measured values of quantities (i.e. values with limited number of significant figures) must reflect the uncertainties in the original measured values. It cannot be more accurate than the original measured values themselves on which the result is based. In general, the final result should not have more significant figures than the original data from which it was obtained. Thus, if mass of an object is measured to be, say, 4.237 g (four significant figures) and its volume is measured to be $2.51~cm^{3}$ then its density, by mere arithmetic division, is $1.68804780876~g/cm^{3}$ upto 11 decimal places. It would be clearly absurd and irrelevant to record the calculated value of density to such a precision when the measurements on which the value is based, have much less precision. The following rules for arithmetic operations with significant figures ensure that the final result of a calculation is shown with the precision that is consistent with the precision of the input measured values:\n(1) In multiplication or division, the final result should retain as many significant figures as are there in the original number with the least significant figures. Thus, in the example above, density should be reported to three significant figures. Density = $\\frac{4.237g}{2.51~cm^{3}}=1.69~g~cm^{-3}$. Similarly, if the speed of light is given as $3.00\\times10^{8}$ m $S^{-1}$ (three significant figure) and one year ( $(1y=365.25~d)$ has $3.1557\\times10^{7}s$ (five significant figures), the light year is $9.47\\times10^{15}n$ (three significant figures).",
    "topic": "Rules for Arithmetic Operations with Significant Figures"
  },
  {
    "content": "(2) In addition or subtraction, the final result should retain as many decimal places as are there in the number with the least decimal places. For example, the sum of the numbers 436.32 g, 227.2 g and 0.301 g by mere arithmetic addition, is 663.821 g. But the least precise measurement (227.2 g) is correct to only one decimal place. The final result should, therefore, be rounded off to 663.8 g. Similarly, the difference in length can be expressed as: $0.307~m-0.304~m = 0.003~m = 3\\times10^{-3}~m$. Note that we should not use the rule (1) applicable for multiplication and division and write 664 g as the result in the example of addition and $3.00\\times10^{-3}$ m in the example of subtraction. They do not convey the precision of measurement properly. For addition and subtraction, the rule is in terms of decimal places.",
    "topic": "Rules for Arithmetic Operations with Significant Figures"
  },
  {
    "content": "The result of computation with approximate numbers, which contain more than one uncertain digit, should be rounded off. The rules for rounding off numbers to the appropriate significant figures are obvious in most cases. A number 2.746 rounded off to three significant figures is 2.75, while the number 1.743 would be 1.74. The rule by convention is that the preceding digit is raised by 1 if the insignificant digit to be dropped (the underlined digit in this case) is more than 5, and is left unchanged if the latter is less than 5. But what if the number is 2.745 in which the insignificant digit is 5. Here, the convention is that if the preceding digit is even, the insignificant digit is simply dropped and, if it is odd, the preceding digit is raised by 1. Then, the number 2.745 rounded off to three significant figures becomes 1.74. On the other hand, the number 2.735 rounded off to three significant figures becomes 1.74 since the preceding digit is odd. In any involved or complex multi-step calculation, you should retain, in intermediate steps, one digit more than the significant digits and round off to proper significant figures at the end of the calculation. Similarly, a number known to be within many significant figures, such as in $2.99792458\\times10^{8}m/s$ for the speed of light in vacuum, is rounded off to an approximate value $3\\times10^{8}m/s$, which is often employed in computations. Finally, remember that exact numbers that appear in formulae like $2~\\pi~in~T=2\\pi\\sqrt{\\frac{L}{g}},$ have a large (infinite) number of significant figures. The value of $\\pi=$ 3.1415926.... is known to a large number of significant figures. You may take the value as 3.142 or 3.14 for $\\pi$. with limited number of significant figures as required in specific cases.",
    "topic": "Rounding off the Uncertain Digits"
  },
  {
    "content": "Example 1.1\nEach side of a cube is measured to be 7.203 m. What are the total surface area and the volume of the cube to appropriate significant figures?\n\n**Answer**\nThe number of significant figures in the measured length is 4. The calculated area and the volume should therefore be rounded off to 4 significant figures.\nSurface area of the cube $=6(7.203)^{2}m^{2}$\n$=311.299254~m^{2}$\n$=311.3~m^{2}$\nVolume of the cube $=(7.203)^{3}m^{3}$\n$=373.714754~m^{3}$\n$=373.7~m^{3}$",
    "topic": "Significant Figures"
  },
  {
    "content": "Example 1.2\n5.74 g of a substance occupies 1.2 $cm^{3}.$ Express its density by keeping the significant figures in view.\n\n**Answer**\nThere are 3 significant figures in the measured mass whereas there are only 2 significant figures in the measured volume. Hence the density should be expressed to only 2 significant figures.\nDensity = $\\frac{5.74}{1.2}$ g cm³\n$=4.8g~cm^{-3}$.",
    "topic": "Significant Figures"
  },
  {
    "content": "The rules for determining the uncertainty or error in the number/measured quantity in arithmetic operations can be understood from the following examples.\n(1) If the length and breadth of a thin rectangular sheet are measured, using a metre scale as 16.2 cm and, 10.1 cm respectively, there are three significant figures in each measurement. It means that the length may be written as $16.2 \\pm 0.1~cm$ $=16.2~cm\\pm0.6\\%$. Similarly, the breadth b may be written as $b=10.1\\pm0.1~cm$ $=10.1~cm\\pm1\\%$. Then, the error of the product of two (or more) experimental values, using the combination of errors rule, will be $I~b=163.62~cm^{2}\\pm1.6\\%$ $=163.62+2.6~cm^{2}$. This leads us to quote the final result as $1b164+3~cm^{2}$. Here $3~cm^{2}$ is the uncertainty or error in the estimation of area of rectangular sheet.\n(2) If a set of experimental data is specified to n significant figures, a result obtained by combining the data will also be valid to n significant figures. However, if data are subtracted, the number of significant figures can be reduced. For example, 12.9 g - 7.06 g. both specified to three significant figures, cannot properly be evaluated as 5.84 g but only as 5.8 g, as uncertainties in subtraction or addition combine in a different fashion (smallest number of decimal places rather than the number of significant figures in any of the number added or subtracted).",
    "topic": "Rules for Determining the Uncertainty in the Results of Arithmetic Calculations"
  },
  {
    "content": "(3) The relative error of a value of number specified to significant figures depends not only on n but also on the number itself. For example, the accuracy in measurement of mass 1.02 g is $\\pm0.01$ g whereas another measurement 9.89 g is also accurate to $\\pm0.01$ g. The relative error in 1.02 g is $=(\\pm0.01/1.02)\\times100\\%$ $=\\pm1\\%$. Similarly, the relative error in 9.89 g is $=(\\pm0.01/9.89)\\times100\\%$ $=\\pm0.1\\%$.\nFinally, remember that intermediate results in a multi-step computation should be calculated to one more significant figure in every measurement than the number of digits in the least precise measurement. These should be justified by the data and then the arithmetic operations may be carried out; otherwise rounding errors can build up. For example, the reciprocal of 9.58, calculated (after rounding off) to the same number of significant figures (three) is 0.104, but the reciprocal of 0.104 calculated to three significant figures is 9.62. However, if we had written $1/9.58=0.1044$ and then taken the reciprocal to three significant figures, we would have retrieved the original value of 9.58. This example justifies the idea to retain one more extra digit (than the number of digits in the least precise measurement) in intermediate steps of the complex multi-step calculations in order to avoid additional errors in the process of rounding off the numbers.",
    "topic": "Rules for Determining the Uncertainty in the Results of Arithmetic Calculations"
  },
  {
    "content": "The nature of a physical quantity is described by its dimensions. All the physical quantities represented by derived units can be expressed in terms of some combination of seven fundamental or base quantities. We shall call these base quantities as the seven dimensions of the physical world, which are denoted with square brackets [ ]. Thus, length has the dimension [L], mass [M], time [T], electric current [A], thermodynamic temperature [K], luminous intensity [cd], and amount of substance [mol]. The dimensions of a physical quantity are the powers (or exponents) to which the base quantities are raised to represent that quantity. Note that using the square brackets [ ] around a quantity means that we are dealing with 'the dimensions of the quantity. In mechanics, all the physical quantities can be written in terms of the dimensions [L], [M] and [T]. For example, the volume occupied by an object is expressed as the product of length, breadth and height, or three lengths. Hence the dimensions of volume are $[L]\\times[L]\\times[L]=[L]^{3}=[L^{3}]$. As the volume is independent of mass and time, it is said to possess zero dimension in mass [$M^{0}$], zero dimension in time [$T^{0}$] and three dimensions in length. Similarly, force, as the product of mass and acceleration, can be expressed as Force = mass x acceleration = mass $\\times$ (length)/(time)². The dimensions of force are [M] $[L]/[T]^{2}=[MLT^{-2}]$. Thus, the force has one dimension in mass, one dimension in length, and -2 dimensions in time. The dimensions in all other base quantities are zero. Note that in this type of representation, the magnitudes are not considered. It is the quality of the type of the physical quantity that enters. Thus, a change in velocity, initial velocity, average velocity, final",
    "topic": "Dimensions of Physical Quantities"
  },
  {
    "content": "other base quantities are zero. Note that in this type of representation, the magnitudes are not considered. It is the quality of the type of the physical quantity that enters. Thus, a change in velocity, initial velocity, average velocity, final velocity, and speed are all equivalent in this context. Since all these quantities can be expressed as length/time, their dimensions are [L]/[T] or $[L~T^{-1}]$.",
    "topic": "Dimensions of Physical Quantities"
  },
  {
    "content": "The expression which shows how and which of the base quantities represent the dimensions of a physical quantity is called the dimensional formula of the given physical quantity. For example, the dimensional formula of the volume is $[M^{0}L^{3}T^{0}]$, and that of speed or velocity is $[M^{0}LT^{-1}]$. Similarly, $[M^{0}LT^{-2}]$ is the dimensional formula of acceleration and [M $L^{-3}$ $T^{0}$] that of mass density. An equation obtained by equating a physical quantity with its dimensional formula is called the dimensional equation of the physical quantity. Thus, the dimensional equations are the equations, which represent the dimensions of a physical quantity in terms of the base quantities. For example, the dimensional equations of volume [V], speed [u], force [F] and mass density [ρ] may be expressed as $[V]=[M^{0}L^{3}T^{0}]$ $[v]=[M^{0}L~T^{-1}]$ $[F]=[ML~T^{-2}]$ $[ρ]=[M~L^{-3}T^{0}]$. The dimensional equation can be obtained from the equation representing the relations between the physical quantities. The dimensional formulae of a large number and wide variety of physical quantities, derived from the equations representing the relationships among other physical quantities and expressed in terms of base quantities are given in Appendix 9 for your guidance and ready reference.",
    "topic": "Dimensional Formulae and Dimensional Equations"
  },
  {
    "content": "The recognition of concepts of dimensions, which guide the description of physical behaviour is of basic importance as only those physical quantities can be added or subtracted which have the same dimensions. A thorough understanding of dimensional analysis helps us in deducing certain relations among different physical quantities and checking the derivation, accuracy and dimensional consistency or homogeneity of various mathematical expressions. When magnitudes of two or more physical quantities are multiplied, their units should be treated in the same manner as ordinary algebraic symbols. We can cancel identical units in the numerator and denominator. The same is true for dimensions of a physical quantity. Similarly, physical quantities represented by symbols on both sides of a mathematical equation must have the same dimensions.",
    "topic": "Dimensional Analysis and its Applications"
  },
  {
    "content": "The magnitudes of physical quantities may be added together or subtracted from one another only if they have the same dimensions. In other words, we can add or subtract similar physical quantities. Thus, velocity cannot be added to force, or an electric current cannot be subtracted from the thermodynamic temperature. This simple principle called the principle of homogeneity of dimensions in an equation is extremely useful in checking the correctness of an equation. If the dimensions of all the terms are not same, the equation is wrong. Hence, if we derive an expression for the length (or distance) of an object, regardless of the symbols appearing in the original mathematical relation, when all the individual dimensions are simplified, the remaining dimension must be that of length. Similarly, if we derive an equation of speed, the dimensions on both the sides of equation, when simplified, must be of length/ time, or $[L~T^{-1}]$. Dimensions are customarily used as a preliminary test of the consistency of an equation, when there is some doubt about the correctness of the equation. However, the dimensional consistency does not guarantee correct equations. It is uncertain to the extent of dimensionless quantities or functions. The arguments of special functions, such as the trigonometric, logarithmic and exponential functions must be dimensionless. A pure number, ratio of similar physical quantities, such as angle as the ratio (length/length), refractive index as the ratio (speed of light in vacuum/speed of light in medium) etc., has no dimensions. Now we can test the dimensional consistency or homogeneity of the equation $x=x_{0}+v_{0}t+(1/2)at^{2}$ for the distance x travelled by a particle or body in time t which starts from the position $x_{0}$ with an initial velocity",
    "topic": "Checking the Dimensional Consistency of Equations"
  },
  {
    "content": "has no dimensions. Now we can test the dimensional consistency or homogeneity of the equation $x=x_{0}+v_{0}t+(1/2)at^{2}$ for the distance x travelled by a particle or body in time t which starts from the position $x_{0}$ with an initial velocity $v_{0}$ at time $t=0$ and has uniform acceleration a along the direction of motion. The dimensions of each term may be written as $[x]=[L]$ $[x_{0}]=[L]$ $[v_{0}t]=[L~T^{-1}][T] = [L]$ $[(1/2)a~t^{2}]=[L~T^{-2}][T^{2}]$ = [L]. As each term on the right hand side of this equation has the same dimension, namely that of length, which is same as the dimension of left hand side of the equation, hence this equation is a dimensionally correct equation. It may be noted that a test of consistency of dimensions tells us no more and no less than a test of consistency of units, but has the advantage that we need not commit ourselves to a particular choice of units, and we need not worry about conversions among multiples and sub-multiples of the units. It may be borne in mind that if an equation fails this consistency test, it is proved wrong, but if it passes, it is not proved right. Thus, a dimensionally correct equation need not be actually an exact (correct) equation, but a dimensionally wrong (incorrect) or inconsistent equation must be wrong.",
    "topic": "Checking the Dimensional Consistency of Equations"
  },
  {
    "content": "Example 1.3\nLet us consider an equation $\\frac{1}{2}mv^{2}=mgh$ where m is the mass of the body, u its velocity, g is the acceleration due to gravity and h is the height. Check whether this equation is dimensionally correct.\n\n**Answer**\nThe dimensions of LHS are [M] $[L~T^{-1}]^{2}=[M][L^{2}T^{-2}]$ = $[M~L^{2}T^{-2}]$.\nThe dimensions of RHS are [M][L$T^{-2}$] $[L]=[M][L^{2}T^{-2}]$ $=[M~L^{2}T^{-2}]$.\nThe dimensions of LHS and RHS are the same and hence the equation is dimensionally correct.",
    "topic": "Dimensional Analysis and its Applications"
  },
  {
    "content": "Example 1.4\nThe SI unit of energy is $J=kg~m^{2}s^{-2}$ that of speed v is m $S^{-1}$ and of acceleration a is m $S^{-2}$ , Which of the formulae for kinetic energy (K) given below can you rule out on the basis of dimensional arguments (m stands for the mass of the body):\n(a) $K=m^{3}v^{3}$\n(b) $K=(1/2)mv^{2}$\n(c) $K=ma$\n(d) $K=(3/16)mv^{2}$\n(e) $K=(1/2)mv^{2}+ma$\n\n**Answer**\nEvery correct formula or equation must have the same dimensions on both sides of the equation. Also, only quantities with the same physical dimensions can be added or subtracted. The dimensions of the quantity on the right side are $[M^{2}L^{3}T^{-3}]$ for (a); $[M~L^{2}T^{-2}]$ for (b) and (d); $[M~L~T^{-2}]$ for (c). The quantity on the right side of (e) has no proper dimensions since two quantities of different dimensions have been added. Since the kinetic energy K has the dimensions of $[M~L^{2}T^{-2}]$, formulas (a), (c) and (e) are ruled out. Note that dimensional arguments cannot tell which of the two, (b) or (d), is the correct formula. For this, one must turn to the actual definition of kinetic energy (see Chapter 5). The correct formula for kinetic energy is given by (b).",
    "topic": "Dimensional Analysis and its Applications"
  },
  {
    "content": "The method of dimensions can sometimes be used to deduce relation among the physical quantities. For this we should know the dependence of the physical quantity on other quantities (upto three physical quantities or linearly independent variables) and consider it as a product type of the dependence. Let us take an example.",
    "topic": "Deducing Relation among the Physical Quantities"
  },
  {
    "content": "Example 1.5\nConsider a simple pendulum, having a bob attached to a string, that oscillates under the action of the force of gravity. Suppose that the period of oscillation of the simple pendulum depends on its length (l), mass of the bob (m) and acceleration due to gravity (g). Derive the expression for its time period using method of dimensions.\n\n**Answer**\nThe dependence of time period T on the quantities l, g and m as a product may be written as: $T=k~l^{x}~g^{y}~m^{z}$ where k is dimensionless constant and x, y and z are the exponents.\nBy considering dimensions on both sides, we have $[L^{0}M^{0}T^{1}]=[L^{1}]^{x}[L^{1}T^{-2}]^{y}[M^{1}]^{z}$ $=L^{x} T^{-2y} M^{z}$.\nOn equating the dimensions on both sides, we have $x+y=0;-2y=1$; and $z=0$.\nSo that $y=-1/2$, $x=1/2$, $z=0$.\nThen, $T=k~l^{\\frac{1}{2}}g^{-\\frac{1}{2}}$ or, $T=k\\sqrt{\\frac{l}{g}}$.\nNote that value of constant k can not be obtained by the method of dimensions. Here it does not matter if some number multiplies the right side of this formula, because that does not affect its dimensions. Actually, $k=2\\pi$ so that $T = 2\\pi\\sqrt{\\frac{l}{g}}$.\nDimensional analysis is very useful in deducing relations among the interdependent physical quantities. However, dimensionless constants cannot be obtained by this method. The method of dimensions can only test the dimensional validity, but not the exact relationship between physical quantities in any equation. It does not distinguish between the physical quantities having same dimensions.\nA number of exercises at the end of this chapter will help you develop skill in dimensional analysis.",
    "topic": "Deducing Relation among the Physical Quantities"
  },
  {
    "content": "1. Physics is a quantitative science, based on measurement of physical quantities. Certain physical quantities have been chosen as fundamental or base quantities (such as length, mass, time, electric current, thermodynamic temperature, amount of substance, and luminous intensity).\n2. Each base quantity is defined in terms of a certain basic, arbitrarily chosen but properly standardised reference standard called unit (such as metre, kilogram, second, ampere, kelvin, mole and candela). The units for the fundamental or base quantities are called fundamental or base units.\n3. Other physical quantities, derived from the base quantities, can be expressed as a combination of the base units and are called derived units. A complete set of units, both fundamental and derived, is called a system of units.\n4. The International System of Units (SI) based on seven base units is at present internationally accepted unit system and is widely used throughout the world.\n5. The SI units are used in all physical measurements, for both the base quantities and the derived quantities obtained from them. Certain derived units are expressed by means of Sl units with special names (such as joule, newton, watt, etc).\n6. The SI units have well defined and internationally accepted unit symbols (such as m for metre, kg for kilogram, s for second, A for ampere, N for newton etc.).\n7. Physical measurements are usually expressed for small and large quantities in scientific notation, with powers of 10. Scientific notation and the prefixes are used to simplify measurement notation and numerical computation, giving indication to the precision of the numbers.",
    "topic": "SUMMARY"
  },
  {
    "content": "8. Certain general rules and guidelines must be followed for using notations for physical quantities and standard symbols for SI units, some other units and SI prefixes for expressing properly the physical quantities and measurements.\n9. In computing any physical quantity, the units for derived quantities involved in the relationship(s) are treated as though they were algebraic quantities till the desired units are obtained.\n10. In measured and computed quantities proper significant figures only should be retained. Rules for determining the number of significant figures, carrying out arithmetic operations with them, and 'rounding off the uncertain digits must be followed.\n11. The dimensions of base quantities and combination of these dimensions describe the nature of physical quantities. Dimensional analysis can be used to check the dimensional consistency of equations, deducing relations among the physical quantities, etc.. A dimensionally consistent equation need not be actually an exact (correct) equation. but a dimensionally wrong or inconsistent equation must be wrong.",
    "topic": "SUMMARY"
  },
  {
    "content": "In the earlier chapters we primarily considered the motion of a single particle. A particle is ideally represented as a point mass having no size. We applied the results of our study even to the motion of bodies of finite size, assuming that motion of such bodies can be described in terms of the motion of a particle. Any real body which we encounter in daily life has a finite size. In dealing with the motion of extended bodies (bodies of finite size) often the idealised model of a particle is inadequate. In this chapter we shall try to go beyond this inadequacy. We shall attempt to build an understanding of the motion of extended bodies. An extended body, in the first place, is a system of particles. We shall begin with the consideration of motion of the system as a whole. The centre of mass of a system of particles will be a key concept here. We shall discuss the motion of the centre of mass of a system of particles and usefulness of this concept in understanding the motion of extended bodies. A large class of problems with extended bodies can be solved by considering them to be rigid bodies. Ideally a rigid body is a body with a perfectly definite and unchanging shape. The distances between all pairs of particles of such a body do not change. It is evident from this definition of a rigid body that no real body is truly rigid, since real bodies deform under the influence of forces. But in many situations the deformations are negligible. In a number of situations involving bodies such as wheels, tops, steel beams, molecules and planets on the other hand, we can ignore that they warp (twist out of shape), bend or vibrate and treat them as rigid.",
    "topic": "SYSTEMS OF PARTICLES AND ROTATIONAL MOTION"
  },
  {
    "content": "Let us try to explore this question by taking some examples of the motion of rigid bodies. Let us begin with a rectangular block sliding down an inclined plane without any sidewise movement. The block is taken as a rigid body. Its motion down the plane is such that all the particles of the body are moving together, i.e. they have the same velocity at any instant of time. The rigid body here is in pure translational motion. In pure translational motion at any instant of time, all particles of the body have the same velocity. Consider now the rolling motion of a solid metallic or wooden cylinder down the same inclined plane. The rigid body in this problem, namely the cylinder, shifts from the top to the bottom of the inclined plane, and thus, seems to have translational motion. But as Fig. 6.2 shows, all its particles are not moving with the same velocity at any instant. The body, therefore, is not in pure translational motion. Its motion is translational plus 'something else.' In order to understand what this 'something else' is, let us take a rigid body so constrained that it cannot have translational motion. The most common way to constrain a rigid body so that it does not have translational motion is to fix it along a straight line. The only possible motion of such a rigid body is rotation. The line or fixed axis about which the body is rotating is its axis of rotation. If you look around, you will come across many examples of rotation about an axis, a ceiling fan, a potter's wheel, a giant wheel in a fair, a merry-go-round and so on. You may notice that in rotation of a rigid body about a fixed axis, every particle of the body moves in a circle, which lies in a plane perpendicular to the axis and has its centre on the axis. Fig. 6.4 shows the rotational motion of a",
    "topic": "What kind of motion can a rigid body have?"
  },
  {
    "content": "and so on. You may notice that in rotation of a rigid body about a fixed axis, every particle of the body moves in a circle, which lies in a plane perpendicular to the axis and has its centre on the axis. Fig. 6.4 shows the rotational motion of a rigid body about a fixed axis (the z-axis of the frame of reference). Note that the circles described by (P_1) and (P_2) may lie in different planes; both these planes, however, are perpendicular to the fixed axis. For any particle on the axis like (P_3), (r=0). Any such particle remains stationary while the body rotates. In some examples of rotation, however, the axis may not be fixed. A prominent example of this kind of rotation is a top spinning in place. We know from experience that the axis of such a spinning top moves around the vertical through its point of contact with the ground, sweeping out a cone. Another simple example of this kind of rotation is the oscillating table fan or a pedestal fan. You may have observed that the axis of rotation of such a fan has an oscillating (sidewise) movement in a horizontal plane about the vertical through the point at which the axis is pivoted. While the fan rotates and its axis moves sidewise, this point is fixed. Thus, in more general cases of rotation, one point and not one line, of the rigid body is fixed. In our study, however, we mostly deal with the simpler and special case of rotation in which one line (i.e. the axis) is fixed. The rolling motion of a cylinder down an inclined plane is a combination of rotation about a fixed axis and translation. The 'something else' in the case of rolling motion which we referred to earlier is rotational motion. We now recapitulate the most important observations of the present section: The motion of a rigid body which is not pivoted or",
    "topic": "What kind of motion can a rigid body have?"
  },
  {
    "content": "and translation. The 'something else' in the case of rolling motion which we referred to earlier is rotational motion. We now recapitulate the most important observations of the present section: The motion of a rigid body which is not pivoted or fixed in some way is either a pure translation or a combination of translation and rotation. The motion of a rigid body which is pivoted or fixed in some way is rotation. The rotation may be about an axis that is fixed (e.g. a ceiling fan) or moving (e.g. an oscillating table fan). We shall, in the present chapter, consider rotational motion about a fixed axis only.",
    "topic": "What kind of motion can a rigid body have?"
  },
  {
    "content": "We shall first see what the centre of mass of a system of particles is and then discuss its significance. For simplicity we shall start with a two particle system. We shall take the line joining the two particles to be the x- axis. Let the distances of the two particles be (x_1) and (x_2) respectively from some origin O. Let (m_1) and (m_2) be respectively the masses of the two particles. The centre of mass of the system is that point C which is at a distance X from O, where X is given by: \n[ X=\\frac{m_{1}x_{1}+m_{2}x_{2}}{m_{1}+m_{2}} ] \nIn this equation, X can be regarded as the mass- weighted mean of (x_1) and (x_2). If we have n particles of masses (m_1, m_2, ... m_n) respectively, along a straight line taken as the x-axis, then by definition the position of the centre of the mass of the system of particles is given by: \n[ X=\\frac{m_{1}x_{1}+m_{2}x_{2}+...+m_{n}x_{n}}{m_{1}+m_{2}+...+m_{n}} = \\frac{\\sum_{i=1}^{n}m_{i}x_{i}}{\\sum_{i=1}^{n}m_{i}} = \\frac{\\sum m_{i}x_{i}}{M} ] \nwhere (M=\\sum m_{i}) is the total mass of the system. For a system of n particles distributed in space, the centre of mass is at (X, Y, Z), where: \n[ X=\\frac{\\sum m_{i}x_{i}}{M} ] \n[ Y=\\frac{\\sum m_{i}y_{i}}{M} ] \n[ Z=\\frac{\\sum m_{i}z_{i}}{M} ] \nThese can be combined into one vector equation: \n[ R=\\frac{\\sum m_{i}r_{i}}{M} ] \nIf the origin is chosen to be the centre of mass, then (\\sum m_i r_i=0). For a rigid body, treated as a continuous distribution of mass, the coordinates of the centre of mass are given by: \n[ X=\\frac{1}{M}\\int x~dm, Y=\\frac{1}{M}\\int y~dm, Z=\\frac{1}{M}\\int z~dm ]",
    "topic": "Centre of mass"
  },
  {
    "content": "[ X=\\frac{1}{M}\\int x~dm, Y=\\frac{1}{M}\\int y~dm, Z=\\frac{1}{M}\\int z~dm ] \nFor homogeneous bodies of regular shapes, their centre of mass coincides with their geometric centre due to symmetry. This can be seen by considering that for every mass element at a point (x, y, z), there is a corresponding element at (-x, y, z), making the integrals zero.",
    "topic": "Centre of mass"
  },
  {
    "content": "Example 6.1\nFind the centre of mass of three particles at the vertices of an equilateral triangle. The masses of the particles are 100g, 150g, and 200g respectively. Each side of the equilateral triangle is 0.5m long. \n\n**Answer**\nWith the x- and y-axes chosen as shown in Fig. 6.9, the coordinates of the vertices O, A and B are respectively (0,0), (0.5,0), and $(0.25,0.25\\sqrt{3})$. Let the masses 100 g, 150g and 200g be located at O, A and B. Then the coordinates of the centre of mass (X, Y) are: \n[ X=\\frac{100(0)+150(0.5)+200(0.25)gm}{(100+150+200)g} = \\frac{75+50}{450}m=\\frac{125}{450}m=\\frac{5}{18}m ] \n[ Y=\\frac{100(0)+150(0)+200(0.25\\sqrt{3})}{450g} = \\frac{50\\sqrt{3}}{450}m=\\frac{\\sqrt{3}}{9}m=\\frac{1}{3\\sqrt{3}}m ] \nThe centre of mass is shown in the figure. It is not the geometric centre of the triangle because the masses are not equal.",
    "topic": "Centre of mass"
  },
  {
    "content": "Example 6.2\nFind the centre of mass of a triangular lamina. \n\n**Answer**\nBy subdividing the lamina into narrow strips parallel to the base, we can see that the centre of mass of each strip is at its midpoint. The line joining the midpoints of all the strips forms the median. Therefore, the centre of mass of the triangle must lie on the median. By repeating this argument for other medians, we find that the centre of mass of the triangle is at the point of concurrence of the medians, which is the centroid G of the triangle.",
    "topic": "Centre of mass"
  },
  {
    "content": "Example 6.3\nFind the centre of mass of a uniform L-shaped lamina (a thin flat plate) with dimensions as shown. The mass of the lamina is 3 kg. \n\n**Answer**\nWe can divide the L-shaped lamina into three 1m x 1m squares, each with a mass of 1 kg. The center of mass of each square is at its geometric center. These centers of mass have coordinates (C_1=(1/2,1/2)), (C_2=(3/2,1/2)), and (C_3=(1/2,3/2)). The center of mass of the entire L-shaped lamina (X, Y) is the center of mass of these three points: \n[ X=\\frac{1(1/2)+1(3/2)+1(1/2)}{1+1+1}m = \\frac{5}{6}m ] \n[ Y=\\frac{1(1/2)+1(1/2)+1(3/2)}{1+1+1}m = \\frac{5}{6}m ] \nThus, the center of mass is at ((\\frac{5}{6}, \\frac{5}{6})).",
    "topic": "Centre of mass"
  },
  {
    "content": "The motion of the centre of mass of a system of particles is a key concept. Differentiating the position vector of the centre of mass with respect to time gives the velocity of the centre of mass: \n[ MV = m_1 v_1 + m_2 v_2 + ... + m_n v_n = \\sum m_i v_i ] \nwhere V is the velocity of the centre of mass. Differentiating again gives the acceleration of the centre of mass: \n[ MA = m_1 a_1 + m_2 a_2 + ... + m_n a_n = \\sum F_i = F_{ext} ] \nwhere (F_{ext}) is the sum of all external forces on the system. This equation states that the centre of mass of a system of particles moves as if all the mass was concentrated at that point and all external forces were applied there. This is a powerful concept because it means we don't need to know the internal forces to determine the motion of the centre of mass. The motion of the center of mass of a projectile is a good illustration: even if the projectile explodes, the center of mass continues along the same parabolic trajectory as if no explosion had occurred, because the explosion forces are internal to the system.",
    "topic": "Motion of centre of mass"
  },
  {
    "content": "The linear momentum of a system of particles is defined as the vector sum of all individual particle momenta: \n[ P = p_1 + p_2 + ... + p_n = m_1 v_1 + m_2 v_2 + ... + m_n v_n ] \nThis can be written in terms of the total mass M and the velocity of the center of mass V as (P=MV). Newton's second law for a system of particles is then (\\frac{dP}{dt}=F_{ext}). If the total external force acting on the system is zero, the total linear momentum is conserved: (\\frac{dP}{dt}=0 \\implies P=\\text{constant}). This means the velocity of the centre of mass remains constant. This principle is widely used, for example, in analyzing the radioactive decay of a nucleus, where the fragments move in a way that the centre of mass of the system continues along the original path of the nucleus.",
    "topic": "Linear momentum of a system of particles"
  },
  {
    "content": "The vector product (or cross product) of two vectors a and b is a vector c, defined such that its magnitude is (c=ab\\sin\\theta), where (\\theta) is the angle between a and b. The vector c is perpendicular to the plane containing a and b, with its direction given by the right-hand screw rule or the right-hand rule. The vector product is not commutative, i.e. (a\\times b = -b\\times a). A vector product of a vector with itself is the null vector, (a\\times a=0). This leads to elementary cross products for unit vectors: (\\hat{i}\\times\\hat{i}=0, \\hat{j}\\times\\hat{j}=0, \\hat{k}\\times\\hat{k}=0), and (\\hat{i}\\times\\hat{j}=\\hat{k}, \\hat{j}\\times\\hat{k}=\\hat{i}, \\hat{k}\\times\\hat{i}=\\hat{j}). The component form of the vector product (c = a\\times b) is (c=(a_{y}b_{z}-a_{z}b_{y})\\hat{i}+(a_{z}b_{x}-a_{x}b_{z})\\hat{j}+(a_{x}b_{y}-a_{y}b_{x})\\hat{k}).",
    "topic": "Vector product of two vectors"
  },
  {
    "content": "Example 6.4\nFind the scalar and vector products of two vectors: (a=(3\\hat{i}-4\\hat{j}+5\\hat{k})) and (b=(-2\\hat{i}+\\hat{j}+3\\hat{k})). \n\n**Answer**\nThe scalar product is (a\\cdot b=(3\\hat{i}-4\\hat{j}+5\\hat{k})\\cdot(-2\\hat{i}+\\hat{j}+3\\hat{k}) = (3)(-2)+(-4)(1)+(5)(3) = -6-4+15 = 5). The vector product is (a\\times b = ((-4)(3)-(5)(1))\\hat{i}+((5)(-2)-(3)(3))\\hat{j}+((3)(1)-(-4)(-2))\\hat{k} = -17\\hat{i}-19\\hat{j}-5\\hat{k}).",
    "topic": "Vector product of two vectors"
  },
  {
    "content": "For a rigid body rotating about a fixed axis, every particle moves in a circle in a plane perpendicular to the axis. All particles have the same angular velocity (\\omega), which is defined as the time rate of change of angular displacement: (\\omega = d\\theta/dt). The angular velocity is a vector that lies along the axis of rotation, and its direction is given by the right-hand screw rule. The linear velocity v of a particle at a perpendicular distance r from the axis is given by (v=\\omega r). In vector form, the relationship is (v=\\omega\\times r). The angular acceleration (\\alpha) is defined as the time rate of change of angular velocity: (\\alpha=d\\omega/dt). For a fixed axis, the vector equation reduces to the scalar equation (\\alpha=d\\omega/dt).",
    "topic": "Angular velocity and its relation with linear velocity"
  },
  {
    "content": "Torque (or moment of force) is the rotational analogue of force in linear motion. For a force F acting on a particle with position vector r, the torque (\\tau) with respect to the origin is defined as the vector product (\\tau=r\\times F). The magnitude is (\\tau=rF\\sin\\theta), and the direction is given by the right-hand rule. Angular momentum is the rotational analogue of linear momentum. For a single particle, the angular momentum l is defined as (l=r\\times p), where p is the linear momentum. The time rate of change of angular momentum is equal to the torque acting on it: (\\frac{dl}{dt}=\\tau). For a system of particles, the total angular momentum L is the vector sum of individual angular momenta, (L=\\sum_i l_i). The total external torque on a system is equal to the time rate of change of the total angular momentum: (\\frac{dL}{dt}=\\tau_{ext}). If the total external torque is zero, the total angular momentum is conserved ((L=\\text{constant})).",
    "topic": "Torque and angular momentum"
  },
  {
    "content": "Example 6.5\nFind the torque of a force (F=7\\hat{i}+3\\hat{j}-5\\hat{k}) about the origin. The force acts on a particle whose position vector is (r=\\hat{i}-\\hat{j}+\\hat{k}). \n\n**Answer**\nThe torque is given by (\\tau=r\\times F). Using the determinant rule: \n[ \\tau=\\begin{vmatrix} \\hat{i} & \\hat{j} & \\hat{k} \\\\ 1 & -1 & 1 \\\\ 7 & 3 & -5 \\end{vmatrix} = ((-1)(-5)-(1)(3))\\hat{i}-((1)(-5)-(1)(7))\\hat{j}+((1)(3)-(-1)(7))\\hat{k} = (5-3)\\hat{i}-(-5-7)\\hat{j}+(3-(-7))\\hat{k} = 2\\hat{i}+12\\hat{j}+10\\hat{k} ] \nThus, (\\tau=2\\hat{i}+12\\hat{j}+10\\hat{k}).",
    "topic": "Torque and angular momentum"
  },
  {
    "content": "Example 6.6\nShow that the angular momentum about any point of a single particle moving with constant velocity remains constant throughout the motion. \n\n**Answer**\nThe angular momentum is given by (l=r\\times p = r\\times mv). Its magnitude is (l=mvr\\sin\\theta), where (\\theta) is the angle between r and v. For constant velocity, the line of direction of v remains the same, so the perpendicular distance of the line of direction of v from the origin, (r\\sin\\theta), is a constant. The direction of l is perpendicular to the plane of r and v, and this direction also remains constant. Thus, l remains constant in both magnitude and direction, and is conserved. The external torque on the particle is (\\tau=\\frac{dl}{dt}=0).",
    "topic": "Torque and angular momentum"
  },
  {
    "content": "A rigid body is in mechanical equilibrium if its linear momentum and angular momentum are constant. This means the total force and total torque on the body are both zero. The conditions for equilibrium are: 1. Translational equilibrium: The vector sum of all forces is zero, (\\sum F_{i}=0). This is equivalent to three scalar equations: (\\sum F_{ix}=0), (\\sum F_{iy}=0), and (\\sum F_{iz}=0). 2. Rotational equilibrium: The vector sum of all torques is zero, (\\sum \\tau_{i}=0). This is also equivalent to three scalar equations: (\\sum \\tau_{ix}=0), (\\sum \\tau_{iy}=0), and (\\sum \\tau_{iz}=0). These six conditions must be satisfied for mechanical equilibrium. A body can be in partial equilibrium. A couple is a pair of equal and opposite forces with different lines of action, which produces rotation without translation. The moment of a couple is independent of the point about which it is taken.",
    "topic": "Equilibrium of a rigid body"
  },
  {
    "content": "Example 6.7\nShow that moment of a couple does not depend on the point about which you take the moments. \n\n**Answer**\nConsider a couple with forces F and -F acting at points B and A, with position vectors (r_2) and (r_1) from an origin O. The moment of the couple is the sum of the moments of the two forces: (\\tau = r_2 \\times F + r_1 \\times (-F) = (r_2 - r_1) \\times F). Since (r_2 - r_1) is the vector from A to B, the moment is (AB \\times F), which is independent of the origin O.",
    "topic": "Equilibrium of a rigid body"
  },
  {
    "content": "The centre of gravity (CG) of a body is the point where the total gravitational torque on the body is zero. In a uniform gravitational field, the centre of gravity coincides with the centre of mass. The position vectors (r_i) of all particles relative to the CG satisfy (\\sum m_i r_i=0). The CG can be determined experimentally by suspending the body from different points; the intersection of the vertical lines through the suspension points gives the CG.",
    "topic": "Centre of gravity"
  },
  {
    "content": "Example 6.8\nA metal bar 70 cm long and 4.00 kg in mass is supported on two knife-edges placed 10 cm from each end. A 6.00 kg load is suspended at 30 cm from one end. Find the reactions at the knife-edges. \n\n**Answer**\nLet the left end be A and the right end be B. The knife-edges are at (K_1) and (K_2). The weight of the rod W acts at its center of gravity G, which is at 35 cm from A. The suspended load (W_1) is at P, 30 cm from A. For translational equilibrium, the upward normal reactions (R_1) and (R_2) balance the downward weights: (R_1+R_2-W_1-W=0). Taking moments about G, for rotational equilibrium, the sum of moments is zero: (-R_1(0.25)+W_1(0.05)+R_2(0.25)=0). Solving these two equations with the given values for masses and distances gives (R_1=54.88~N) and (R_2=43.12~N).",
    "topic": "Equilibrium of a rigid body"
  },
  {
    "content": "Example 6.9\nA 3m long ladder weighing 20 kg leans on a frictionless wall. Its feet rest on the floor 1 m from the wall. Find the reaction forces of the wall and the floor. \n\n**Answer**\nThe ladder AB is 3 m long, its foot A is at distance $AC=1$ m from the wall. From Pythagoras theorem, $BC=2\\sqrt{2}$ m. The forces on the ladder are its weight W acting at its centre of gravity D, reaction forces $F_1$ and $F_2$ of the wall and the floor respectively. Force $F_1$ is perpendicular to the wall, since the wall is frictionless. Force $F_2$ is resolved into two components, the normal reaction N and the force of friction F. For translational equilibrium, taking the forces in the vertical direction gives $N-W=0$, and in the horizontal direction gives $F-F_1=0$. For rotational equilibrium, taking the moments of the forces about A, we have $BC~F_1 - AD~W = 0$, where D is the midpoint of the ladder. This simplifies to $2\\sqrt{2}F_{1}-(1/2)W=0$. Solving these equations gives $N=196.0~N$, $F_1=34.6~N$ and $F=34.6~N$. The total reaction force of the floor is $F_2=\\sqrt{F^2+N^2}\\approx199.0~N$. The angle it makes with the horizontal is $\\tan\\alpha=N/F=4\\sqrt{2}$, or $\\alpha=\\tan^{-1}(4\\sqrt{2})\\approx80^{\\circ}$.",
    "topic": "Equilibrium of a rigid body"
  },
  {
    "content": "Moment of inertia (I) is the rotational analogue of mass in linear motion. It measures a body's rotational inertia. For a rigid body rotating about a fixed axis, the total kinetic energy is $K=\\frac{1}{2}I\\omega^{2}$, where I is defined as $I=\\sum_{i=1}^{n}m_{i}r_{i}^{2}$. Here, (m_i) is the mass of the (i^{th}) particle and (r_i) is its perpendicular distance from the axis of rotation. The moment of inertia depends on the mass distribution and the axis of rotation. The radius of gyration (k) is defined as the distance from the axis of a point mass whose moment of inertia is equal to that of the body, so $I=Mk^2$. Moment of inertia has dimensions of ([ML^2]) and SI units of (kg~m^2). A flywheel has a large moment of inertia to resist sudden changes in speed.",
    "topic": "Moment of Inertia"
  },
  {
    "content": "The kinematics of rotational motion about a fixed axis are analogous to those of linear motion. The corresponding quantities are: angular displacement (\\theta), angular velocity (\\omega), and angular acceleration (\\alpha). For uniform angular acceleration, the kinematic equations are: \n[ \\omega = \\omega_0 + \\alpha t ] \n[ \\theta = \\theta_0 + \\omega_0 t + \\frac{1}{2}\\alpha t^2 ] \n[ \\omega^2 = \\omega_0^2 + 2\\alpha(\\theta-\\theta_0) ] \nwhere (\\theta_0) and (\\omega_0) are the initial angular displacement and velocity, respectively.",
    "topic": "Kinematics of rotational motion about a fixed axis"
  },
  {
    "content": "Example 6.10\nObtain Eq. (6.36) from first principles. \n\n**Answer**\nThe angular acceleration is uniform, so (\\alpha = d\\omega/dt = \\text{constant}). Integrating this equation gives (\\omega = \\int\\alpha~dt+c=\\alpha t+c). At (t=0), (\\omega = \\omega_0), so the constant (c=\\omega_0). Thus, (\\omega=\\omega_0+\\alpha t).",
    "topic": "Kinematics of rotational motion about a fixed axis"
  },
  {
    "content": "Example 6.11\nThe angular speed of a motor wheel is increased from 1200 rpm to 3120 rpm in 16 seconds. (i) What is its angular acceleration, assuming the acceleration to be uniform? (ii) How many revolutions does the engine make during this time? \n\n**Answer**\n(i) The initial angular speed is (\\omega_0 = 1200~rev/min = \\frac{1200\\times2\\pi}{60}~rad/s=40\\pi~rad/s). The final angular speed is (\\omega = 3120~rev/min = \\frac{3120\\times2\\pi}{60}~rad/s=104\\pi~rad/s). The angular acceleration is (\\alpha=\\frac{\\omega-\\omega_0}{t}=\\frac{104\\pi-40\\pi}{16}=4\\pi~rad~s^{-2}). \n(ii) The angular displacement is (\\theta=\\omega_0t+\\frac{1}{2}\\alpha t^2 = 40\\pi(16)+\\frac{1}{2}(4\\pi)(16)^2 = 640\\pi+512\\pi=1152\\pi~rad). The number of revolutions is (\\frac{1152\\pi}{2\\pi}=576).",
    "topic": "Kinematics of rotational motion about a fixed axis"
  },
  {
    "content": "The rotational analogue of Newton's second law is (\\tau=I\\alpha), where (\\tau) is the torque and I is the moment of inertia. This equation relates torque to angular acceleration. The instantaneous power for rotational motion is (P=\\tau\\omega). For a rigid body rotating about a fixed axis, the work done by the total external torque is (W=\\int\\tau d\\theta). The rate at which work is done is equated to the rate of increase of kinetic energy, (\\tau\\omega = I\\omega\\alpha), which leads to (\\tau=I\\alpha).",
    "topic": "Dynamics of rotational motion about a fixed axis"
  },
  {
    "content": "Example 6.12\nA cord of negligible mass is wound round the rim of a flywheel of mass 20 kg and radius 20 cm. A steady pull of 25 N is applied. (a) Compute the angular acceleration. (b) Find the work done by the pull when 2m of the cord is unwound. (c) Find the kinetic energy of the wheel. (d) Compare answers to (b) and (c).\n\n**Answer**\n(a) The torque is (\\tau=FR = 25~N \\times 0.20~m = 5.0~N~m). The moment of inertia of the flywheel is (I=\\frac{1}{2}MR^2 = \\frac{1}{2}(20~kg)(0.2~m)^2=0.4~kg~m^2). The angular acceleration is (\\alpha=\\frac{\\tau}{I}=\\frac{5.0}{0.4}=12.5~s^{-2}). \n(b) The work done is (W = F\\times s = 25~N\\times2~m=50~J). \n(c) The angular displacement is (\\theta=s/R = 2~m/0.2~m=10~rad). The final angular velocity squared is (\\omega^2=\\omega_0^2+2\\alpha\\theta = 0+2(12.5)(10)=250~(rad/s)^2). The kinetic energy is (K=\\frac{1}{2}I\\omega^2=\\frac{1}{2}(0.4)(250)=50~J). \n(d) The work done by the force is equal to the kinetic energy gained by the wheel, confirming the work-energy theorem.",
    "topic": "Dynamics of rotational motion about a fixed axis"
  },
  {
    "content": "The total angular momentum of a system of particles about a point is given by (L=\\sum_{i=1}^{n}r_{i}\\times p_{i}). For a rigid body rotating about a fixed axis, the component of the angular momentum along the fixed axis is (L_z=I\\omega\\hat{k}). In general, the angular momentum vector L for a particle is not parallel to the angular velocity vector (\\omega). However, for symmetric rigid bodies rotating about an axis of symmetry, the angular momentum is parallel to the axis of rotation, (L=I\\omega\\hat{k}). For rotation about a fixed axis, the component of angular momentum perpendicular to the axis is constant. The time rate of change of the component of angular momentum along the axis is equal to the external torque along that axis: (\\frac{dL_z}{dt}=\\tau_{ext}). If the external torque is zero, the angular momentum along the axis is conserved, (L_z=I\\omega=\\text{constant}).",
    "topic": "Angular momentum in case of rotation about a fixed axis"
  },
  {
    "content": "1. A rigid body is one for which the distances between different particles do not change.\n2. A rigid body fixed at one point or along a line can have only rotational motion. A rigid body not fixed in some way can have either pure translational motion or a combination of translational and rotational motions.\n3. In rotation about a fixed axis, every particle of the rigid body moves in a circle which lies in a plane perpendicular to the axis and has its centre on the axis. Every Point in the rotating rigid body has the same angular velocity at any instant of time.\n4. In pure translation, every particle of the body moves with the same velocity at any instant of time.\n5. Angular velocity is a vector. Its magnitude is (\\omega=d\\theta/dt) and it is directed along the axis of rotation. For rotation about a fixed axis, this vector has a fixed direction.\n6. The vector or cross product of two vector a and b is a vector written as $a\\times b$ The magnitude of this vector is absin(\\theta) and its direction is given by the right handed screw or the right hand rule.\n7. The linear velocity of a particle of a rigid body rotating about a fixed axis is given by $v=\\omega\\times r$, where r is the position vector of the particle with respect to an origin along the fixed axis. The relation applies even to more general rotation of a rigid body with one point fixed. In that case r is the position vector of the particle with respect to the fixed point taken as the origin.",
    "topic": "SUMMARY OF SYSTEMS OF PARTICLES AND ROTATIONAL MOTION"
  },
  {
    "content": "8. The centre of mass of a system of n particles is defined as the point whose position vector is $R=\\frac{\\sum m_{i}r_{i}}{M}$. The centre of mass moves as if all the mass of the system is concentrated at this point and all the external forces act at it. If the total external force on the system is zero, then the total linear momentum of the system is constant.\n9. The angular momentum of a system of n particles about the origin is $L=\\sum_{l=1}^{n}r_{l}\\times p_{l}$. The torque or moment of force on a system of n particles about the origin is $\\tau=\\sum_{l}r_{i}\\times F_{i}$. The force $F_i$ acting on the $i^{th}$ particle includes the external as well as internal forces. Assuming Newton's third law of motion and that forces between any two particles act along the line joining the particles, we can show that (\\tau_{int}=0) and (\\frac{dL}{dt}=\\tau_{ext}).\n10. A rigid body is in mechanical equilibrium if it is in translational equilibrium, i.e., the total external force on it is zero: $\\sum F_{i}=0$ and it is in rotational equilibrium, i.e. the total external torque on it is zero: $\\sum\\tau_{i}=\\sum\\tau_{i}\\times F_{i}=0$. \n11. The centre of gravity of an extended body is that point where the total gravitational torque on the body is zero. \n12. The moment of intertia of a rigid body about an axis is defined by the formula $I=\\sum m_{i}r_{i}^{2}$ where $r_i$ is the perpendicular distance of the ith point of the body from the axis. The kinetic energy of rotation is $K=\\frac{1}{2}I\\omega^{2}$.",
    "topic": "SUMMARY OF SYSTEMS OF PARTICLES AND ROTATIONAL MOTION"
  },
  {
    "content": "Motion is common to everything in the universe. We walk, run and ride a bicycle. Even when we are sleeping, air moves into and out of our lungs and blood flows in arteries and veins. We see leaves falling from trees and water flowing down a dam. Automobiles and planes carry people from one place to the other. The earth rotates once every twenty-four hours and revolves round the sun once in a year. The sun itself is in motion in the Milky Way, which is again moving within its local group of galaxies. Motion is change in position of an object with time. How does the position change with time? In this chapter, we shall learn how to describe motion. For this, we develop the concepts of velocity and acceleration. We shall confine ourselves to the study of motion of objects along a straight line, also known as rectilinear motion. For the case of rectilinear motion with uniform acceleration, a set of simple equations can be obtained. Finally, to understand the relative nature of motion, we introduce the concept of relative velocity. In our discussions, we shall treat the objects in motion as point objects. This approximation is valid so far as the size of the object is much smaller than the distance it moves in a reasonable duration of time. In a good number of situations in real-life, the size of objects can be neglected and they can be considered as point-like objects without much error. In Kinematics, we study ways to describe motion without going into the causes of motion. What causes motion described in this chapter and the next chapter forms the subject matter of Chapter 4.",
    "topic": "MOTION IN A STRAIGHT LINE"
  },
  {
    "content": "The average velocity tells us how fast an object has been moving over a given time interval but does not tell us how fast it moves at different instants of time during that interval. For this, we define instantaneous velocity or simply velocity vat an instant t. The velocity at an instant is defined as the limit of the average velocity as the time interval $\\Delta t$ becomes infinitesimally small. In other words, $v=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta x}{\\Delta t}$ $=\\frac{dx}{dt}$ (2.1a) where the symbol $\\Delta t\\rightarrow0$ stands for the operation of taking limit as $\\Delta t\\rightarrow0$ of the quantity on its right. In the language of calculus, the quantity on the right hand side of Eq. (2.1a) is the differential coefficient of x with respect to t and is denoted by $\\frac{dx}{dt}$ (see Appendix 2.1). It is the rate of change of position with respect to time. at that instant. We can use Eq. (2.la) for obtaining the value of velocity at an instant either graphically or numerically. Suppose that we want to obtain graphically the value of velocity at time $t=4$ 4s (point P) for the motion of the car represented in Fig.2.1 calculation. Let us take $\\Delta t=2$ s centred at $t=4$ s. Then, by the definition of the average velocity, the slope of line $P_{1}P_{2}$ (Fig. 2.1) gives the value of average velocity over the interval 3s to 5 s. We see from Table 2.1 that as we decrease the value of $\\Delta t$ from 2.0 s to 0.010 s, the value of the average velocity approaches the limiting value 3.84 m $S^{-1}$ which is the value of velocity at $t=4.0$ s, i.e. the value of $\\frac{dx}{dt}$ at $t=4.0$ s. In this manner, we can calculate velocity at each instant for motion of the car. The graphical method for the determination of the instantaneous velocity is always not a",
    "topic": "Instantaneous Velocity and Speed"
  },
  {
    "content": "value of velocity at $t=4.0$ s, i.e. the value of $\\frac{dx}{dt}$ at $t=4.0$ s. In this manner, we can calculate velocity at each instant for motion of the car. The graphical method for the determination of the instantaneous velocity is always not a convenient method. For this, we must carefully plot the position-time graph and calculate the value of average velocity as $\\Delta t$ becomes smaller and smaller. It is easier to calculate the value of velocity at different instants if we have data of positions at different instants or exact expression for the position as a function of time. Then, we calculate $\\Delta x/\\Delta t$ from the data for decreasing the value of $\\Delta t$ and find the limiting value as we have done in Table 2.1 or use differential calculus for the given expression and calculate $\\frac{dx}{dt}$ at different instants as done in the following example. Instantaneous speed or simply speed is the magnitude of velocity. For example, a velocity of + 24.0 m $s^{-1}$ and a velocity of 24.0 m $s^{-1}-$ both have an associated speed of 24.0 m $S^{-1}.$ It should be noted that though average speed over a finite interval of time is greater or equal to the magnitude of the average velocity. instantaneous speed at an instant is equal to the magnitude of the instantaneous velocity at that instant. Why so ?",
    "topic": "Instantaneous Velocity and Speed"
  },
  {
    "content": "The following table:\n\"At\n (8)\n2.0\n\",\"(s)\n3.0\n\",\"(8)\n5.0\n\",\"$x(t_{1})$\n (m\n2.16\n\",\"$x(ty)$\n (m\n10.0\n\",\"Ax\n (m)\n7.84\n\",\"$\\Delta x/\\Delta t$\n $(m\\cdot g^{-3})$\n3.92\n\"\n\"1.0\n\",\"3.5\n\",\"4.5\n\",\"3.43\n\",\"7.29\n\",\"3.86\n\",\"3.86\n\"\n\"0.5\n\",\"3.75\n\",\"4.25\n\",\"4.21875\n\",\"6.14125\n\",\"1.9225\n\",\"3.845\n\"\n\"0.1\n\",\"3.95\n\",\"4.05\n\",\"4.93039\n\",\"5.31441\n\",\"0.38402\n\",\"3.8402\n\"\n\"0.01\n\",\"3.995\n\",\"4.005\n\",\"5.100824\n\",\"5.139224\n\",\"0.0384\n\",\"3.8400\n\"",
    "topic": "Table 2.1 Limiting value of $\\frac{\\Delta x}{\\Delta t}$ at $t=4~s$"
  },
  {
    "content": "Example 2.1\nThe position of an object moving along x-axis is given by $x=a+bt^{2}$ where $a=8.5$ m. $b=2.5$ m $s^{-2}$ and tis measured in seconds. What is its velocity at $t=0$ s and $t=2.0$ s. What is the average velocity between $t=2.0$ s and t = 4.0 s?\n\n**Answer**\nIn notation of differential calculus, the velocity is $v=\\frac{dx}{dt}=\\frac{d}{dt}(a+bt^{2})=2b~t=5.0~tm~s^{-1}$. At $t=0$ s, $v=0m~s^{-1}$ and at $t=2.0$ s. $v=10~ms^{-1}$. Average velocity $=\\frac{x(4.0)-x(2.0)}{4.0-2.0}$ $=\\frac{a+16b-a-4b}{2.0}=6.0\\times b$ =6.0\\times2.5=15 m s¹. Note that for uniform motion, velocity is the same as the average velocity at all instants.",
    "topic": "Instantaneous Velocity and Speed"
  },
  {
    "content": "The velocity of an object, in general, changes during its course of motion. How to describe this change? Should it be described as the rate of change in velocity with distance or with time? This was a problem even in Galileo's time. It was first thought that this change could be described by the rate of change of velocity with distance. But, through his studies of motion of freely falling objects and motion of objects on an inclined plane, Galileo concluded that the rate of change of velocity with time is a constant of motion for all objects in free fall. On the other hand, the change in velocity with distance is not constant - it decreases with the increasing distance of fall. This led to the concept of acceleration as the rate of change of velocity with time. The average acceleration a over a time interval is defined as the change of velocity divided by the time interval: $\\overline{a}=\\frac{v_{2}-v_{1}}{t_{2}-t_{1}}=\\frac{\\Delta v}{\\Delta t}$ (2.2) where $V_{2}$ and $V_{1}$ are the instantaneous velocities or simply velocities at time $t_{2}$ $t_{1}$. It is the average change of velocity per unit time. The SI unit of acceleration is $S^{-2}$. On a plot of velocity versus time, the average acceleration is the slope of the straight line connecting the points corresponding to (v₂, t₂) and $(V_{1},t_{1})$. Instantaneous acceleration is defined in the same way as the instantaneous velocity: $a=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta v}{\\Delta t}=\\frac{dv}{dt}$ (2.3) The acceleration at an instant is the slope of the tangent to the $v-t$ curve at that instant. Since velocity is a quantity having both magnitude and direction, a change in velocity may involve either or both of these factors. Acceleration, therefore, may result from a change in speed (magnitude), a change in",
    "topic": "Acceleration"
  },
  {
    "content": "the $v-t$ curve at that instant. Since velocity is a quantity having both magnitude and direction, a change in velocity may involve either or both of these factors. Acceleration, therefore, may result from a change in speed (magnitude), a change in direction or changes in both. Like velocity, acceleration can also be positive. negative or zero. Position-time graphs for motion with positive, negative and zero acceleration are shown in Figs. 2.4 (a), (b) and (c), respectively. Note that the graph curves upward for positive acceleration: downward for negative acceleration and it is a straight line for zero acceleration. Although acceleration can vary with time. our study in this chapter will be restricted to motion with constant acceleration. In this case, the average acceleration equals the constant value of acceleration during the interval. If the velocity of an object is $V_{p}$ at t $=0$ and vat time t, we have or, $v=v_{0}+at$. An interesting feature of a velocity-time graph for any moving object is that the area under the curve represents the displacement over a given time interval. A general proof of this statement requires use of calculus. We can, however, see that it is true for the simple case of an object moving with constant velocity u. Its velocity-time graph is as shown in Fig. 2.4. The v-t curve is a straight line parallel to the time axis and the area under it between $t=0$ and $t=T$ is the area of the rectangle of height u and base T. Therefore, area $=u\\times T=$ uT which is the displacement in this time interval. How come in this case an area is equal to a distance? Think! Note the dimensions of quantities on the two coordinate axes, and you will arrive at the answer. Note that the x-t, v-t, and a-t graphs shown in several figures in this chapter have",
    "topic": "Acceleration"
  },
  {
    "content": "How come in this case an area is equal to a distance? Think! Note the dimensions of quantities on the two coordinate axes, and you will arrive at the answer. Note that the x-t, v-t, and a-t graphs shown in several figures in this chapter have sharp kinks at some points implying that the functions are not differentiable at these points. In any realistic situation, the functions will be differentiable at all points and the graphs will be smooth. What this means physically is that acceleration and velocity cannot change values abruptly at an instant. Changes are always continuous.",
    "topic": "Acceleration"
  },
  {
    "content": "For uniformly accelerated motion, we can derive some simple equations that relate displacement (x), time taken (t), initial velocity $(v_{o})$, final velocity ( ) and acceleration (a). Equation (2.4) already obtained gives a relation between final and initial velocities vand $v_{o}$ of an object moving with uniform acceleration a: $v=v_{0}+at$ (2.4) This relation is graphically represented in Fig. 2.5. The area under this curve is: Area between instants 0 and $t=$ Area of triangle ABC + Area of rectangle OACD $=\\frac{1}{2}(\\nu-\\nu_{0})t+\\nu_{0}t$. As explained in the previous section, the area under v-t curve represents the displacement. Therefore, the displacement x of the object is: $x=\\frac{1}{2}(v-v_{0})t+v_{0}t$ But $v-v_{0}=at$. Therefore, $x=\\frac{1}{2}a~t^{2}+v_{0}t$ or, $x=v_{0}t+\\frac{1}{2}at^{2}$ (2.5) Equation (2.5) can also be written as $x=\\frac{v+v_{0}}{2}t=\\overline{v}t$ (2.6) where, $\\overline{v}=\\frac{v+v_{0}}{2}$ (constant acceleration only) (2.7b) Equations (2.7a) and (2.7b) mean that the object has undergone displacement x with an average velocity equal to the arithmetic average of the initial and final velocities. From Eq. (2.4), $t=(v-v_{0})/a.$ Substituting this in Eq. (2.7a), we get $x=\\overline{v}t=(\\frac{v+v_{0}}{2})(\\frac{v-v_{0}}{a})=\\frac{v^{2}-v_{0}^{2}}{2a}$ $v^{2}=v_{0}^{2}+2ax$ (2.8) This equation can also be obtained by substituting the value of t from Eq. (2.4) into Eq. (2.6). Thus, we have obtained three important equations: $v=v_{0}+at$ (2.9a) $x=v_{0}t+\\frac{1}{2}at^{2}$ $v^{2}=v_{0}^{2}+2ax$ connecting five quantities v, a, tand x. These are kinematic equations of rectilinear motion for constant acceleration. The set of Eq. (2.9a) were obtained by assuming that at $t=0$, the position of the particle. xis 0. We can obtain a more",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "connecting five quantities v, a, tand x. These are kinematic equations of rectilinear motion for constant acceleration. The set of Eq. (2.9a) were obtained by assuming that at $t=0$, the position of the particle. xis 0. We can obtain a more general equation if we take the position coordinate at $t=0$ as non- zero, say $x_{0}$. Then Eqs. (2.9a) are modified (replacing x by $x-x_{0}$ to: $v=v_{0}+at$ (2.9b) $x=x_{0}+v_{0}t+\\frac{1}{2}at^{2}$ (2.9c) $v^{2}=v_{0}^{2}+2a(x-x_{0})$. The advantage of this method is that it can be used for motion with non-uniform acceleration also. Now, we shall use these equations to some important cases.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "Example 2.2\nObtain equations of motion for constant acceleration using method of calculus.\n\n**Answer**\nBy definition $a=\\frac{dv}{dt}$. So $dv=a~dt$. Integrating both sides $\\int_{v_{0}}^{v}dv=\\int_{0}^{t}adt$ $=a\\int_{0}^{t}dt$ (a is constant). So $\\nu-\\nu_{0}=at$ be $v=v_{0}+at$. Further, $v=\\frac{dx}{dt}$. So $dx=v~dt$. Integrating both sides $\\int_{x_{0}}^{x}dx=\\int_{0}^{t}v~dt$. We can write $=\\int_{0}^{t}(v_{0}+at)dt$. So $x-x_{0}=\\nu_{0}t+\\frac{1}{2}a~t^{2}$ $x=x_{0}+v_{0}t+\\frac{1}{2}a~t^{2}$. Also $a=\\frac{dv}{dt}=\\frac{dv}{dx}\\frac{dx}{dt}=v\\frac{dv}{dx}$. Or, $v~dv=a~dx$. Integrating both sides, $\\int_{v_{0}}^{v}v~dv=\\int_{x_{0}}^{x}a~dx$ $\\frac{v^{2}-v_{0}^{2}}{2}=a(x-x_{0})$. Finally, $v^{2}=v_{0}^{2}+2a(x-x_{0})$.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "Example 2.3\nA ball is thrown vertically upwards with a velocity of 20 m $s^{-1}$ from the top of a multistorey building. The height of the point from where the ball is thrown is 25.0 m from the ground. (a) How high will the ball rise? and (b) how long will it be before the ball hits the ground? Take g = 10 $ms^{-2}$.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "**Answer**\n(a) Let us take the y-axis in the vertically upward direction with zero at the ground, as shown in Fig. 2.6. Now $v_{o}=+20ms^{-1}$, $a=-g=-10~m~s^{-2}$, $v=0~m~s^{-1}$. If the ball rises to height y from the point of launch, then using the equation $v^{2}=v_{0}^{2}+2a(y-y_{0})$ we get $0=(20)^{2}+2(-10)(y-y_{0})$. Solving, we get. $(y-y_{0})=20$ m.\n(b) We can solve this part of the problem in two ways. Note carefully the methods used. FIRST METHOD: In the first method, we split the path in two parts: the upward motion (A to B) and the downward motion (B to C) and calculate the corresponding time taken $t_{i}$ and $t_{2}.$ Since the velocity at B is zero, we have: $v=v_{0}+at$ Or, $0=20-10t_{1}$ $t_{1}=2$ s. This is the time in going from A to B. From B, or the point of the maximum height, the ball falls freely under the acceleration due to gravity. The ball is moving in negative y direction. We use equation $y=y_{0}+v_{0}t+\\frac{1}{2}at^{2}$. We have, $y_{0}=45m.$ $y=0,$ $v_{0}=0$ $a=-g=-10ms^{-2}$. $0=45+(\\frac{1}{2})(-10)t^{2}$. Solving, we get $t_{2}=3$ s. Therefore, the total time taken by the ball before it hits the ground $=t_{1}+t_{2}=2~s+3~s=5~s$. SECOND METHOD: The total time taken can also be calculated by noting the coordinates of initial and final positions of the ball with respect to the origin chosen and using equation $y=y_{0}+v_{0}t+\\frac{1}{2}at^{2}$. Now $y_{0}=25~m$ $y=0~m$. $v_{o}=20ms^{-1}$, $a=-10m~s^{-2}$, $t=?$. $0=25+20t+(\\frac{1}{2})$ (-10) t². Or. $5t^{2}-20t-25=0$. Solving this quadratic equation for t, we get $t=5s$. Note that the second method is better since we do not have to worry about the path of the motion as the motion is under constant acceleration.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "Example 2.4\nFree-fall Discuss the motion of an object under free fall. Neglect air resistance.\n\n**Answer**\nAn object released near the surface of the Earth is accelerated downward under the influence of the force of gravity. The magnitude of acceleration due to gravity is represented by g. If air resistance is neglected, the object is said to be in free fall. If the height through which the object falls is small compared to the earth's radius, g can be taken to be constant, equal to $9.8~m~s^{-2}$ Free fall is thus a case of motion with uniform acceleration. We assume that the motion is in y-direction, more correctly in-y-direction because we choose upward direction as positive. Since the acceleration due to gravity is always downward, it is in the negative direction and we have $a=-g=-9.8~m~s^{-2}$. The object is released from rest at $y=0$ Therefore, $v_{0}=0$ and the equations of motion become: $v=0-gt=-9.8~t$ ms¹. $y=0-\\frac{1}{2}g~t^{2}=-4.9~t^{2}$ $v^{2}=0-2~g~y=-19.6~y$ $m^{2}s^{-2}$. These equations give the velocity and the distance travelled as a function of time and also the variation of velocity with distance. The variation of acceleration, velocity, and distance, with time have been plotted in Fig. 2.7(a), (b) and (c).",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "Example 2.5\nGalileo's law of odd numbers: \"The distances traversed, during equal intervals of time, by a body falling from rest, stand to one another in the same ratio as the odd numbers beginning with unity namely, 1:3: 5:7......[. \"Prove it.\n\n**Answer**\nLet us divide the time interval of motion of an object under free fall into many equal intervals and find out the distances traversed during successive intervals of time. Since initial velocity is zero, we have $y=-\\frac{1}{2}gt^{2}$. Using this equation, we can calculate the position of the object after different time intervals, 0, $\\tau$. 2$\\tau$. 3$\\tau$... which are given in second column of Table 2.2. If we take $(-1/2)$ $g\\tau^{2}$ $y_{o}$ - the position coordinate after first time interval t, then third column gives the positions in the unit of $y_{o}.$ The fourth column gives the distances traversed in successive . We find that the distances are in the simple ratio 1: 3:5: 7:9: 11... as shown in the last column. This law was established by Galileo Galilei (1564-1642) who was the first to make quantitative studies of free fall.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "The following table:\n\"t\n\",\"y\n\",\"y in terms of\n$[=(-\\frac{1}{2})$ $g~\\tau^{2}I$\n\",\"Distance\ntraversed in\n\",\"Ratio of\ndistances\n\"\n\",,\",\"successive\n intervals\n\",\"traversed\n\"\n\"0\n\",\"0\n\",,\n\"$-\\frac{1}{2}g~\\tau^{2}$\n\",\"$y_{a}$\n\",\"$y_{a}$\n\",\"1\n\"\n\"2 $\\tau$\n\",\"$-4(\\frac{1}{2})$ $g~\\tau^{2}$\n\",\"$4~y_{o}$\n\",\"$3y_{o}$\n\",\"3\n\"\n\"3 $\\tau$\n\",\"$-9(\\frac{1}{2})$ g $\\xi~\\tau^{2}$\n\",\"$9y_{o}$\n\",\"$5y_{o}$\n\",\"5\n\"\n\"4 $\\tau$\n\",\"$-16(\\frac{1}{2})g$\n\",\"16 $y_{o}$\n\",\"$7y_{0}$\n\",\"7\n\"\n\"5 $\\tau$\n\",\"$-25(\\frac{1}{2})$ g $\\tau^{2}$\n\",\"25 $y_{u}$\n\",\"$9y_{o}$\n\",\"9\n\"\n\"6 $\\tau$\n\",\"$-36(\\frac{1}{2})$ $g~\\tau^{2}$\n\",\"$36y_{0}$\n\",\"$11y_{0}$\n\",\"11\n\"",
    "topic": "Table 2.2 (from Kinematic equations for uniformly accelerated motion)"
  },
  {
    "content": "Example 2.6\nStopping distance of vehicles: When brakes are applied to a moving vehicle, the distance it travels before stopping is called stopping distance. It is an important factor for road safety and depends on the initial velocity ( $(v_{0})$ and the braking capacity, or deceleration. -a that is caused by the braking. Derive an expression for stopping distance of a vehicle in terms of $\\mathcal{D}_{n}$ anda.\n\n**Answer**\nLet the distance travelled by the vehicle before it stops be $d_{s}$ Then, using equation of motion $\\nu^{2}=\\nu_{0}^{2}+2$ ax, and noting that $v=0,$ we have the stopping distance $d_{s}=\\frac{-v_{0}^{2}}{2a}$. Thus, the stopping distance is proportional to the square of the initial velocity. Doubling the initial velocity increases the stopping distance by a factor of 4 (for the same deceleration). For the car of a particular make, the braking distance was found to be 10 m, 20 m, 34 m and 50 m corresponding to velocities of 11, 15, 20 and $25~m/s$ which are nearly consistent with the above formula. Stopping distance is an important factor considered in setting speed limits, for example, in school zones.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "Example 2.7\nReaction time: When a situation demands our immediate action, it takes some time before we really respond. Reaction time is the time a person takes to observe, think and act. For example, if a person is driving and suddenly a boy appears on the road, then the time elapsed before he slams the brakes of the car is the reaction time. Reaction time depends on complexity of the situation and on an individual. You can measure your reaction time by a simple experiment. Take a ruler and ask your friend to drop it vertically through the gap between your thumb and forefinger (Fig. 2.8). After you catch it, find the distance d travelled by the ruler. In a particular case, d was found to be 21.0 cm. Estimate reaction time.\n\n**Answer**\nThe ruler drops under free fall. Therefore, $v_{O}=0$ and $a=-g=-9.8$ m s². The distance travelled dand the reaction time tare related by $d=-\\frac{1}{2}gt_{r}^{2}$. Or, $t_{r}=\\sqrt{\\frac{2d}{g}}s$. Given $d=21.0$ cm and $g=9.8~m~s^{-2}$ the reaction time is $t_{r}=\\sqrt{\\frac{2\\times0.21}{9.8}}s\\equiv0.2~s$.",
    "topic": "Kinematic equations for uniformly accelerated motion"
  },
  {
    "content": "1. An object is said to be in motion if its position changes with time. The position of the object can be specified with reference to a conveniently chosen origin. For motion in a straight line, position to the right of the origin is taken as positive and to the left as negative.\n2. The average speed of an object is greater or equal to the magnitude of the average velocity over a given time interval.\n3. Instantaneous velocity or simply velocity is defined as the limit of the average velocity as the time interval $\\Delta t$ becomes infinitesimally small : $v=lim_{\\Delta t\\rightarrow0}\\overline{v}=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta x}{\\Delta t}=\\frac{dx}{d~t}$. The velocity at a particular instant is equal to the slope of the tangent drawn on position-time graph at that instant.\n4. Average acceleration is the change in velocity divided by the time interval during which the change occurs: $\\overline{a}=\\frac{\\Delta v}{\\Delta t}$.\n5. Instantaneous acceleration is defined as the limit of the average acceleration as the time interval $\\Delta t$ goes to zero: $a=lim_{\\Delta t\\rightarrow0}\\overline{a}=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta v}{\\Delta t}=\\frac{dv}{dt}$. The acceleration of an object at a particular time is the slope of the velocity-time graph at that instant of time.\n6. For uniform motion, acceleration is zero and the $x-t$ graph is a straight line inclined to the time axis and the v-t graph is a straight line parallel to the time axis. For motion with uniform acceleration, $x-t$ graph is a parabola while the v-t graph is a straight line inclined to the time axis.\n7. The area under the velocity-time curve between times t₁ and $t_{2}$ is equal to the displacement of the object during that interval of time.",
    "topic": "SUMMARY"
  },
  {
    "content": "7. The area under the velocity-time curve between times t₁ and $t_{2}$ is equal to the displacement of the object during that interval of time.\n8. For objects in uniformly accelerated rectilinear motion, the five quantities, displacement x, time taken t, initial velocity $v_{0}$, final velocity v and acceleration a are related by a set of simple equations called kinematic equations of motion: $v=v_{0}+at$ $x=v_{0}t+\\frac{1}{2}at^{2}$ $v^{2}=v_{0}^{2}+2ax$. if the position of the object at time $t=0$ is O. If the particle starts at $X=x_{0}$, x in above equations is replaced by $(x-x_{0})$.",
    "topic": "SUMMARY"
  },
  {
    "content": "The terms 'work', 'energy' and 'power' are frequently used in everyday language. A farmer ploughing the field, a construction worker carrying bricks, a student studying for a competitive examination, an artist painting a beautiful landscape, all are said to be working. In physics, however, the word 'Work' covers a definite and precise meaning. Somebody who has the capacity to work for 14-16 hours a day is said to have a large stamina or energy. We admire a long distance runner for her stamina or energy. Energy is thus our capacity to do work. In Physics too, the term 'energy' is related to work in this sense, but as said above the term 'work' itself is defined much more precisely. The word 'power' is used in everyday life with different shades of meaning. In karate or boxing we talk of 'powerful' punches. These are delivered at a great speed. This shade of meaning is close to the meaning of the word 'power' used in physics. We shall find that there is at best a loose correlation between the physical definitions and the physiological pictures these terms generate in our minds. The aim of this chapter is to develop an understanding of these three physical quantities. Before we proceed to this task, we need to develop a mathematical prerequisite, namely the scalar product of two vectors.",
    "topic": "WORK, ENERGY AND POWER"
  },
  {
    "content": "We have learnt about vectors and their use in Chapter 3. Physical quantities like displacement, velocity, acceleration, force etc. are vectors. We have also learnt how vectors are added or subtracted. We now need to know how vectors are multiplied. There are two ways of multiplying vectors which we shall come across: one way known as the scalar product gives a scalar from two vectors and the other known as the vector product produces a new vector from two vectors. The scalar product or dot product of any two vectors A and B, denoted as (A cdot B) is defined as: \n[ A \\cdot B=A B \\cos \\theta \\] \nwhere (\\theta) is the angle between the two vectors. Since A, B and \\(cos \\theta\\) are scalars, the dot product of A and B is a scalar quantity. Each vector, A and B, has a direction but their scalar product does not have a direction. From the equation, we have: \n(A \\cdot B=A(B \\cos \\theta) = B(A \\cos \\theta))",
    "topic": "The Scalar Product"
  },
  {
    "content": "(A \\cdot B=A(B \\cos \\theta) = B(A \\cos \\theta)) \nGeometrically, (B \\cos \\theta) is the projection of B onto A and (A \\cos \\theta) is the projection of A onto B. So, (A \\cdot B) is the product of the magnitude of A and the component of B along A. Alternatively, it is the product of the magnitude of B and the component of A along B. The scalar product follows the commutative law: (A \\cdot B=B \\cdot A). Scalar product obeys the distributive law: (A \\cdot(B+C)=A \\cdot B+A \\cdot C). Further, (A \\cdot(\\lambda B)=\\lambda(A \\cdot B)) where (\\lambda) is a real number. For unit vectors \\(\\hat{i}, \\hat{j}, \\hat{k}\\) we have \\(\\hat{i} \\cdot \\hat{i}=\\hat{j} \\cdot \\hat{j}=\\hat{k} \\cdot \\hat{k}=1\\) and \\(\\hat{i} \\cdot \\hat{j}=\\hat{j} \\cdot \\hat{k}=\\hat{k} \\cdot \\hat{i}=0\\). Given two vectors in component form: (A=A_{x} \\hat{i}+A_{y} \\hat{j}+A_{z} \\hat{k}) and (B=B_{x} \\hat{i}+B_{y} \\hat{j}+B_{z} \\hat{k}), their scalar product is (A \\cdot B=A_{x} B_{x}+A_{y} B_{y}+A_{z} B_{z}). From this definition, we have (A \\cdot A = A^{2} = A_{x}^{2}+A_{y}^{2}+A_{z}^{2}), and (A \\cdot B=0) if A and B are perpendicular.",
    "topic": "The Scalar Product"
  },
  {
    "content": "Example 5.1\nFind the angle between force (F=(3\\hat{i}+4\\hat{j}-5\\hat{k})) unit and displacement (d=(5\\hat{i}+4\\hat{j}+3\\hat{k})) unit. Also find the projection of F on d. \n\n**Answer**\nThe dot product is (F \\cdot d=F_{x}d_{x}+F_{y}d_{y}+F_{z}d_{z} = 3(5)+4(4)+(-5)(3) = 16\\) unit. The magnitudes squared are (F^{2}=F_{x}^{2}+F_{y}^{2}+F_{z}^{2} = 9+16+25 = 50) unit and (d^{2}=d_{x}^{2}+d_{y}^{2}+d_{z}^{2} = 25+16+9 = 50) unit. The angle is found from (F \\cdot d=Fd \\cos \\theta), so (\\cos \\theta=\\frac{16}{\\sqrt{50}\\sqrt{50}}=\\frac{16}{50}=0.32), which gives (\\theta=\\cos^{-1}0.32). The projection of F on d is (F \\cos \\theta = \\frac{F \\cdot d}{d} = \\frac{16}{\\sqrt{50}}\\) unit.",
    "topic": "The Scalar Product"
  },
  {
    "content": "The relation for rectilinear motion under constant acceleration is (v^{2}-u^{2}=2 as). Multiplying both sides by (m/2) gives (\\frac{1}{2}mv^{2}-\\frac{1}{2}mu^{2}=mas=Fs), where (F=ma) from Newton's Second Law. This can be generalized to three dimensions as (\\frac{1}{2}mv^{2}-\\frac{1}{2}mu^{2}=m a\\cdot d=F\\cdot d). The quantity (\\frac{1}{2}mv^{2}) is defined as kinetic energy (K). The quantity (W = F \\cdot d) is defined as work. The work-energy (WE) theorem states that the change in kinetic energy of a particle is equal to the work done on it by the net force: (K_f - K_i = W). Work is done by a force on a body over a certain displacement.",
    "topic": "Notions of Work and Kinetic Energy: The Work-Energy Theorem"
  },
  {
    "content": "Example 5.2\nA raindrop of mass 1.00 g falls from a height of 1.00 km and hits the ground with a speed of (50.0~m~s^{-1}). (a) What is the work done by the gravitational force? (b) What is the work done by the unknown resistive force? \n\n**Answer**\n(a) The work done by the gravitational force is (W_g=mgh = 10^{-3} \\times 10 \\times 10^{3} = 10.0~J). (b) The change in kinetic energy of the drop is (\\Delta K=\\frac{1}{2}m v^{2}-0 = \\frac{1}{2}\\times10^{-3}\\times50\\times50 = 1.25~J). From the work-energy theorem, (\\Delta K = W_g + W_r), where (W_r) is the work done by the resistive force. Thus, (W_r = \\Delta K - W_g = 1.25 - 10 = -8.75~J). The work done by the resistive force is negative.",
    "topic": "Notions of Work and Kinetic Energy: The Work-Energy Theorem"
  },
  {
    "content": "Work is related to force and the displacement over which it acts. For a constant force F acting on an object that undergoes a displacement d, the work done is defined as the scalar product of the force and displacement vectors: (W=(F \\cos \\theta)d=F\\cdot d). Work done is zero if (i) the displacement is zero, (ii) the force is zero, or (iii) the force and displacement are mutually perpendicular ((\\theta=90^{\\circ})). Work can be positive (if (0^{\\circ} \\le \\theta < 90^{\\circ})) or negative (if (90^{\\circ} < \\theta \\le 180^{\\circ})). The work done by a frictional force, which opposes displacement, is typically negative. The dimensions of work are ([ML^{2}T^{-2}]), and its SI unit is the joule (J). The work done on a body A by body B is not necessarily equal and opposite to the work done on B by A, even though the forces between them are equal and opposite (Newton's Third Law).",
    "topic": "Work"
  },
  {
    "content": "Example 5.3\nA cyclist comes to a skidding stop in 10 m. During this process, the force on the cycle due to the road is 200 N and is directly opposed to the motion. (a) How much work does the road do on the cycle? (b) How much work does the cycle do on the road? \n\n**Answer**\n(a) The work done on the cycle by the road is the work done by the frictional force. The angle between the force and displacement is 180°. The work done is (W_r=Fd \\cos \\theta = 200\\times10\\times\\cos\\pi = -2000~J). (b) By Newton's Third Law, an equal and opposite force acts on the road due to the cycle. However, the road undergoes no displacement, so the work done by the cycle on the road is zero.",
    "topic": "Work"
  },
  {
    "content": "If an object of mass m has velocity v, its kinetic energy K is (K=\\frac{1}{2}mv^{2}). It is a scalar quantity and a measure of the work an object can do by virtue of its motion. The dimensions of kinetic energy are ([ML^{2}T^{-2}]), and its SI unit is the joule (J). The kinetic energy of various objects is listed in Table 5.2.",
    "topic": "Kinetic energy"
  },
  {
    "content": "Example 5.4\nIn a ballistics demonstration, a police officer fires a bullet of mass 50.0 g with speed (200~m~s^{-1}) on soft plywood of thickness 2.00 cm. The bullet emerges with only 10% of its initial kinetic energy. What is the emergent speed of the bullet? \n\n**Answer**\nThe initial kinetic energy is (K_i = \\frac{1}{2}mv^2 = \\frac{1}{2}(0.05~kg)(200~m~s^{-1})^2=1000~J). The final kinetic energy is 10% of this, or (K_f=100~J). The emergent speed (v_f) is found from (K_f = \\frac{1}{2}mv_f^2). Solving for (v_f) gives (v_f=\\sqrt{\\frac{2\\times100~J}{0.05~kg}}=63.2~m~s^{-1}).",
    "topic": "Kinetic energy"
  },
  {
    "content": "For a variable force, work is calculated differently. If the force (F(x)) is a function of displacement x, the work done over a small displacement (\\Delta x) can be approximated as (\\Delta W=F(x)\\Delta x). The total work done over a larger displacement from (x_i) to (x_f) is the sum of these small work elements. As (\\Delta x \\rightarrow 0), this sum becomes a definite integral: \n[ W=\\lim_{\\Delta x\\rightarrow0}\\sum_{x_{i}}^{x_{f}}F(x)\\Delta x =\\int_{x_{i}}^{x_{f}}F(x)dx \\]",
    "topic": "Work done by a variable force"
  },
  {
    "content": "Example 5.5\nA woman pushes a trunk on a rough railway platform. She applies a force of 100 N over 10 m, then her force reduces linearly to 50 N over the next 10 m. The frictional force is a constant 50 N. Plot the forces versus displacement and calculate the work done by the woman and by friction over the total 20 m. \n\n**Answer**\nThe plot of the applied force F is a rectangle from 0 to 10 m and a trapezium from 10 m to 20 m. The work done by the woman is the area under this curve, which is (W_F = 100\\times10 + \\frac{1}{2}(100+50)\\times10 = 1000+750 = 1750~J). The frictional force f is constant at -50 N (opposing the motion). The work done by friction is the area of a rectangle with height -50 N and base 20 m, which is (W_f=(-50)\\times20=-1000~J).",
    "topic": "Work done by a variable force"
  },
  {
    "content": "The work-energy theorem can be extended to a variable force. The time rate of change of kinetic energy is (\\frac{dK}{dt}=\\frac{d}{dt}(\\frac{1}{2}m v^{2})=m v\\frac{dv}{dt}=F\\frac{dx}{dt}). This gives (dK=Fdx). Integrating from an initial position (x_i) to a final position (x_f), we get: \n[ K_{f}-K_{i}=\\int_{x_{i}}^{x_{f}}Fdx = W \\] \nThus, the change in kinetic energy equals the work done, even for a variable force. However, the WE theorem is a scalar form of Newton's second law and does not explicitly contain all the temporal and directional information present in the vector form of Newton's law. It is an integral form of Newton's second law.",
    "topic": "The work-energy theorem for a variable force"
  },
  {
    "content": "Example 5.6\nA block of mass (m=1~kg) moving on a horizontal surface with speed (v_i=2~m~s^{-1}) enters a rough patch from (x=0.10~m) to (x=2.01~m). The retarding force is (F_r=-\\frac{k}{x}) in this range, where (k=0.5~J). What is the final kinetic energy and speed (v_f) of the block as it crosses this patch? \n\n**Answer**\nUsing the work-energy theorem, (K_f=K_i+\\int_{0.1}^{2.01}F_r~dx). The initial kinetic energy is (K_i=\\frac{1}{2}mv_i^2 = \\frac{1}{2}(1)(2)^2=2~J). The work done by the retarding force is (W = \\int_{0.1}^{2.01}\\frac{-k}{x}dx = -k[\\ln x]_{0.1}^{2.01} = -0.5(\\ln 2.01 - \\ln 0.1) = -0.5\\ln(20.1) \\approx -1.5~J). The final kinetic energy is (K_f = 2 - 1.5 = 0.5~J). The final speed is (v_f=\\sqrt{\\frac{2K_f}{m}} = \\sqrt{\\frac{2\\times0.5}{1}}=1~m~s^{-1}).",
    "topic": "The work-energy theorem for a variable force"
  },
  {
    "content": "Potential energy is 'stored' energy by virtue of a body's position or configuration. A stretched bow-string or fault lines in the earth's crust are examples. Gravitational potential energy is defined as the negative of the work done by the gravitational force in raising an object to a certain height. For an object of mass m raised to a height h near the earth's surface, the potential energy is (V(h)=mgh), where g is considered constant. The gravitational force can be expressed as the negative derivative of the potential energy with respect to height, (F=-\\frac{d}{dh}V(h)=-mg). The notion of potential energy is only applicable to conservative forces, where the work done against the force is stored as energy and depends only on the initial and final positions. The dimensions of potential energy are ([ML^{2}T^{-2}]). The zero of potential energy is arbitrary and is chosen for convenience, such as the ground level for gravitational potential energy.",
    "topic": "The concept of potential energy"
  },
  {
    "content": "For a body acted upon by a conservative force, the sum of its kinetic energy (K) and potential energy (V) is constant. This is the principle of conservation of mechanical energy: (\\Delta(K+V)=0), or (K_i+V(x_i)=K_f+V(x_f)). The total mechanical energy (E = K+V) is conserved. A force is conservative if it can be derived from a scalar potential energy function, (F(x)=-\\frac{dV}{dx}), or if the work it does over a closed path is zero. The example of a ball dropped from a cliff demonstrates this conservation, as the initial potential energy (E_H=mgH) is converted into kinetic energy, becoming fully kinetic at the ground, (E_0 = \\frac{1}{2}mv_f^2).",
    "topic": "The conservation of mechanical energy"
  },
  {
    "content": "Example 5.7\nA bob of mass m is suspended by a string of length L. It is imparted a horizontal velocity (v_0) at the lowest point A such that it completes a semi-circular trajectory, becoming slack at the topmost point C. Obtain an expression for (i) (v_0), (ii) the speeds at points B and C, and (iii) the ratio of the kinetic energies at B and C. \n\n**Answer**\n(i) The total mechanical energy is conserved since the string tension does no work. Taking potential energy as zero at A, the energy at A is (E_A=\\frac{1}{2}mv_0^2). At the highest point C, the tension (T_C=0), so from Newton's second law, the gravitational force provides the centripetal force: (mg=\\frac{mv_C^2}{L}). The energy at C is (E_C=\\frac{1}{2}mv_C^2+2mgL). By conservation of energy, (E_A=E_C), which gives (v_0=\\sqrt{5gL}). \n(ii) From the tension equation at C, (v_C=\\sqrt{gL}). At point B, the energy is (E_B=\\frac{1}{2}mv_B^2+mgL). Equating this to (E_A), we get (v_B=\\sqrt{3gL}). \n(iii) The ratio of kinetic energies is (\\frac{K_B}{K_C}=\\frac{\\frac{1}{2}mv_B^2}{\\frac{1}{2}mv_C^2}=\\frac{3gL}{gL}=3). \nAfter the string breaks at C, the bob will undergo projectile motion with a horizontal projection.",
    "topic": "The conservation of mechanical energy"
  },
  {
    "content": "The spring force is a conservative, variable force that obeys Hooke's law: (F_s=-kx), where k is the spring constant and x is the displacement from equilibrium. The work done by the spring force when it is stretched or compressed from (x_i) to (x_f) is (W_s=\\int_{x_{i}}^{x_{f}}(-kx)dx = \\frac{1}{2}kx_{i}^{2}-\\frac{1}{2}kx_{f}^{2}). Since the work done depends only on the end points, the spring force is a conservative force. The potential energy of a spring is defined as (V(x)=\\frac{1}{2}kx^{2}), with the zero of potential energy at the equilibrium position. The total mechanical energy of a spring-mass system is conserved, so (\\frac{1}{2}kx_m^2=\\frac{1}{2}kx^2+\\frac{1}{2}mv^2). The speed and kinetic energy are maximum at the equilibrium position, (v_m=\\sqrt{\\frac{k}{m}}x_m).",
    "topic": "The potential energy of a spring"
  },
  {
    "content": "Example 5.8\nA car of mass 1000 kg moving with a speed of (18.0~km/h) collides with a horizontally mounted spring of spring constant (5.25\\times10^{3}~N~m^{-1}). What is the maximum compression of the spring? \n\n**Answer**\nAt maximum compression, the kinetic energy of the car is entirely converted into the potential energy of the spring. The car's speed is (18~km~h^{-1}=5~m~s^{-1}). The initial kinetic energy is (K=\\frac{1}{2}mv^2=\\frac{1}{2}(1000)(5)^2=1.25\\times10^{4}~J). At maximum compression (x_m), the potential energy is (V=\\frac{1}{2}kx_m^2). By conservation of mechanical energy, (V=K), so (\\frac{1}{2}(5.25\\times10^3)x_m^2=1.25\\times10^4), which gives (x_m\\approx2.00~m).",
    "topic": "The potential energy of a spring"
  },
  {
    "content": "Example 5.9\nConsider Example 5.8 taking the coefficient of friction, (\\mu), to be 0.5 and calculate the maximum compression of the spring. \n\n**Answer**\nWith friction, we use the work-energy theorem instead of conservation of energy. The work done by the net force is the sum of the work done by the spring force ((W_s=-\\frac{1}{2}kx_m^2)) and the work done by friction ((W_f=-\\mu mg x_m)). The change in kinetic energy is (\\Delta K = 0-\\frac{1}{2}mv^2). Equating these, we get (\\frac{1}{2}mv^2=\\frac{1}{2}kx_m^2+\\mu mg x_m). Rearranging gives a quadratic equation in (x_m): (kx_m^2+2\\mu mg x_m-mv^2=0). Solving for (x_m) using the positive root gives (x_m\\approx1.35~m), which is less than the frictionless case.",
    "topic": "The potential energy of a spring"
  },
  {
    "content": "Power is the time rate at which work is done or energy is transferred. The average power is (P_{av}=\\frac{W}{t}), and the instantaneous power is (P=\\frac{dW}{dt}). The instantaneous power can also be expressed as the dot product of force and velocity: (P=F\\cdot v). Power is a scalar quantity with dimensions ([ML^{2}T^{-3}]). The SI unit of power is the watt (W), where (1~W=1~J~s^{-1}). Another unit is horsepower (hp), where (1~hp=746~W). Electrical energy consumption is often measured in kilowatt-hours (kWh), which is a unit of energy, not power, with (1~kWh=3.6\\times10^{6}~J).",
    "topic": "Power"
  },
  {
    "content": "Example 5.10\nAn elevator can carry a maximum load of 1800 kg and moves up with a constant speed of (2~m~s^{-1}). The frictional force opposing the motion is 4000 N. Determine the minimum power delivered by the motor to the elevator in watts and in horsepower.\n\n**Answer**\nThe total downward force is the sum of the gravitational force and the frictional force: (F=mg+F_{f}=(1800\\times10)+4000=22000~N). To move at a constant speed, the motor must apply an upward force of this magnitude. The minimum power delivered by the motor is (P=Fv=22000\\times2=44000~W). In horsepower, this is (P=\\frac{44000}{746}\\approx59~hp).",
    "topic": "Power"
  },
  {
    "content": "In physics, we study collisions as a way to understand the conservation of momentum and energy. In all collisions, the total linear momentum is conserved because the internal forces between the colliding objects cancel out according to Newton's Third Law. However, the total kinetic energy may not be conserved due to energy transformations into heat, sound, or deformation. An elastic collision is one where the total kinetic energy is conserved. A completely inelastic collision is one where the two particles stick together and move as one after the collision. An inelastic collision is an intermediate case where some kinetic energy is lost.",
    "topic": "Collisions"
  },
  {
    "content": "Example 5.11\nSlow down of neutrons: In a nuclear reactor, a neutron of high speed must be slowed to a lower speed so that it can cause fission. Show that a neutron can lose most of its kinetic energy in an elastic collision with a light nucleus like deuterium or carbon, which has a mass of only a few times the neutron mass. \n\n**Answer**\nThe fractional kinetic energy lost by the neutron ($m_1$) in a head-on elastic collision with a stationary nucleus ($m_2$) is given by (f_1=\\frac{K_{1f}}{K_{1i}}=(\\frac{m_1-m_2}{m_1+m_2})^2). The fractional kinetic energy gained by the moderating nucleus is (f_2=1-f_1=\\frac{4m_1m_2}{(m_1+m_2)^2}). For deuterium ($m_2=2m_1$), (f_1 = (\\frac{1-2}{1+2})^2 = \\frac{1}{9}), so almost 90% of the neutron's energy is transferred. For carbon, the fractional loss is smaller, but still significant.",
    "topic": "Collisions"
  },
  {
    "content": "Example 5.12\nConsider the collision of two billiard balls with equal masses ($m_1=m_2$). The first ball (cue) strikes the second ball (target) which is at rest. The player wants to 'sink' the target ball in a corner pocket at an angle $\\theta_2=37^{\\circ}$. Assuming an elastic collision and that friction and rotational motion are negligible, obtain $\\theta_1$.\n\n**Answer**\nFrom momentum conservation, (v_{1i}=v_{1f}+v_{2f}) since (m_1=m_2). Squaring this gives (v_{1i}^2=v_{1f}^2+v_{2f}^2+2v_{1f}v_{2f}\\cos(\\theta_1+\\theta_2)). From conservation of kinetic energy for an elastic collision, (v_{1i}^2=v_{1f}^2+v_{2f}^2). Comparing these two equations, we find that (2v_{1f}v_{2f}\\cos(\\theta_1+\\theta_2)=0). Since the velocities are non-zero, this implies (\\cos(\\theta_1+\\theta_2)=0), so (\\theta_1+\\theta_2=90^{\\circ}). Given (\\theta_2=37^{\\circ}), we find (\\theta_1=53^{\\circ}). This proves that for a glancing elastic collision between two equal masses, one initially at rest, they will move at right angles to each other after the collision.",
    "topic": "Collisions"
  },
  {
    "content": "1. The work-energy theorem states that the change in kinetic energy of a body is the work done by the net force on the body: (K_f-K_i=W_{net}).\n2. A force is conservative if the work it does is path-independent, or if the work done over a closed loop is zero. For a conservative force in one dimension, a potential energy function (V(x)) can be defined such that (F(x)=-\\frac{dV(x)}{dx}).\n3. The principle of conservation of mechanical energy states that the total mechanical energy ((E=K+V)) of a body remains constant if the only forces doing work on it are conservative.\n4. The gravitational potential energy of a particle of mass m at height x is (V(x)=mgx). The elastic potential energy of a spring with force constant k and extension x is (V(x)=\\frac{1}{2}kx^{2}).\n5. The scalar or dot product of two vectors A and B is a scalar quantity defined as (A\\cdot B=AB\\cos\\theta). The scalar product of unit vectors is: (\\hat{i}\\cdot\\hat{i}=\\hat{j}\\cdot\\hat{j}=\\hat{k}\\cdot\\hat{k}=1) and (\\hat{i}\\cdot\\hat{j}=\\hat{j}\\cdot\\hat{k}=\\hat{k}\\cdot\\hat{i}=0).\n6. Power is the rate at which work is done, (P=\\frac{dW}{dt}), and can be expressed as the dot product of force and velocity, (P=F\\cdot v). Its SI unit is the watt (W).\n7. In all collisions, total linear momentum is conserved. In an elastic collision, total kinetic energy is also conserved. In a completely inelastic collision, the two bodies stick together.",
    "topic": "SUMMARY OF WORK, ENERGY AND POWER"
  }
]