[
  {
    "topic": "LAWS OF MOTION",
    "content": "In the preceding Chapter, our concern was to describe the motion of a particle in space quantitatively. We saw that uniform motion needs the concept of velocity alone whereas non-uniform motion requires the concept of acceleration in addition. So far, we have not asked the question as to what governs the motion of bodies. In this chapter, we turn to this basic question. To move a football at rest, someone must kick it. To throw a stone upwards, one has to give it an upward push. A breeze causes the branches of a tree to swing; a strong wind can even move heavy objects. A boat moves in a flowing river without anyone rowing it. Clearly, some external agency is needed to provide force to move a body from rest. Likewise, an external force is needed also to retard or stop motion. You can stop a ball rolling down an inclined plane by applying a force against the direction of its motion. In these examples, the external agency of force (hands, wind, stream, etc) is in contact with the object. This is not always necessary. A stone released from the top of a building accelerates downward due to the gravitational pull of the earth. A bar magnet can attract an iron nail from a distance. This shows that external agencies (e.g. gravitational and magnetic forces) can exert force on a body even from a distance. In short, a force is required to put a stationary body in motion or stop a moving body, and some external agency is needed to provide this force. The external agency may or may not be in contact with the body. But what if a body is moving uniformly (e.g. a skater moving straight with constant speed on a horizontal ice slab)? Is an external force required to keep a body in uniform motion?"
  },
  {
    "topic": "Aristotle's Fallacy",
    "content": "The question posed above appears to be simple. However, it took ages to answer it. Indeed, the correct answer to this question given by Galileo in the seventeenth century was the foundation of Newtonian mechanics, which signalled the birth of modern science. The Greek thinker, Aristotle (384 B.C-322 B.C.), held the view that if a body is moving, something external is required to keep it moving. The Aristotelian law of motion may be phrased thus: An external force is required to keep a body in motion. This law is flawed because a moving toy car, for example, comes to rest because the external force of friction on the car by the floor opposes its motion. To counter this force, a child has to apply an external force on the car in the direction of motion. When the car is in uniform motion, there is no net external force acting on it: the force by the child cancels the force (friction) by the floor. If there were no friction, the child would not be required to apply any force to keep the toy car in uniform motion. Galileo imagined a world without frictional forces to arrive at the true law of nature for forces and motion."
  },
  {
    "topic": "The Law of Inertia",
    "content": "Galileo studied motion of objects on an inclined plane. He concluded that an object moving on a frictionless horizontal plane must neither have acceleration nor retardation, i.e. it should move with constant velocity. Another experiment by Galileo involved a double inclined plane, where a ball released from rest on one plane would climb up the other. In the ideal situation, when friction is absent, the final height of the ball is the same as its initial height. In the limiting case, when the slope of the second plane is zero (i.e. is a horizontal), the ball would travel an infinite distance, and its motion would never cease. Galileo arrived at the insight that the state of rest and the state of uniform linear motion (motion with constant velocity) are equivalent. In both cases, there is no net force acting on the body. To maintain a body in uniform motion, an external force is needed to counter the frictional force, so that the two forces sum up to zero net external force. This property of the body is called inertia, which means 'resistance to change'. A body does not change its state of rest or uniform motion unless an external force compels it to change that state. The state of rest or uniform linear motion both imply zero acceleration. The first law of motion can be simply expressed as: If the net external force on a body is zero, its acceleration is zero."
  },
  {
    "topic": "Ideas on Motion in Ancient Indian Science",
    "content": "Ancient Indian thinkers had arrived at an elaborate system of ideas on motion. Force was thought to be of different kinds: force due to continuous pressure (nodan), impact (abhighat), persistent tendency (sanskara) to move in a straight line (vega), or restoration of shape in an elastic body. The notion of (vega) perhaps comes closest to the concept of inertia. Vega, the tendency to move in a straight line, was thought to be opposed by contact with objects including atmosphere, a parallel to the ideas of friction and air resistance. It was correctly summarised that the different kinds of motion (translational, rotational and vibrational) of an extended body arise from only the translational motion of its constituent particles. There was considerable focus in Indian thought on measurement of motion and units of length and time. Bhaskara (1150 A.D.) had introduced the concept of 'instantaneous motion' (tatkaliki gati), which anticipated the modern notion of instantaneous velocity using Differential Calculus. The difference between a wave and a current (of water) was clearly understood."
  },
  {
    "topic": "Newton's first law of motion",
    "content": "Galileo's ideas were the starting point for Isaac Newton, who formulated the three laws of motion. Newton's first law of motion states: Every body continues to be in its state of rest or of uniform motion in a straight line unless compelled by some external force to act otherwise. If the net external force on a body is zero, its acceleration is zero. For example, a spaceship in interstellar space with its rockets turned off has no net external force acting on it, so its acceleration must be zero. If it is in motion, it continues to move with a uniform velocity. On Earth, an object at rest or in uniform linear motion is not because there are no forces acting on it, but because the various external forces cancel out to give a zero net external force. The property of inertia is evident when a bus suddenly starts or stops, causing passengers to be thrown backward or forward, respectively."
  },
  {
    "topic": "Newton's first law of motion",
    "content": "Example 4.1\nAn astronaut accidentally gets separated out of his small spaceship accelerating in inter stellar space at a constant rate of 100 $s^{-2}$ What is the acceleration of the astronaut the instant after he is outside the spaceship? (Assume that there are no nearby stars to exert gravitational force on him.).\n\n**Answer**\nSince there are no nearby stars to exert gravitational force on him and the small spaceship exerts negligible gravitational attraction on him, the net force acting on the astronaut, once he is out of the spaceship, is zero. By the first law of motion the acceleration of the astronaut is zero."
  },
  {
    "topic": "Newton's second law of motion",
    "content": "The first law refers to the simple case when the net external force on a body is zero. The second law of motion refers to the general situation when there is a net external force acting on the body. It relates the net external force to the acceleration of the body. Momentum (p) of a body is defined as the product of its mass (m) and velocity (v): $p=mv$ (4.1). The rate of change of momentum of a body is directly proportional to the applied force and takes place in the direction in which the force acts. The second law can be expressed as $F=k\\frac{dp}{dt}$ where k is a constant of proportionality. For a body of fixed mass, this can be written as $F=kma$. In SI units, k is chosen to be 1, so the law becomes $F=\\frac{dp}{dt}=ma$. The SI unit of force is the newton (N), defined as $1~N=1~kg~m~s^{-2}$. The second law is a vector law and is consistent with the first law (F=0 implies a=0). The acceleration at an instant is determined by the force at that instant, not by the history of the motion. The second law applies to a single point particle, a rigid body, or a system of particles, where F is the total external force and a is the acceleration of the system's center of mass. Impulse is defined as the product of force and time duration, which equals the change in momentum. For a seasoned cricketer catching a ball, drawing hands backward increases the time for the momentum change, thus requiring a smaller force."
  },
  {
    "topic": "Newton's second law of motion",
    "content": "Example 4.2\nA bullet of mass 0.04 kg moving with a speed of 90 m $S^{-1}$ enters a heavy wooden block and is stopped after a distance of 60 cm. What is the average resistive force exerted by the block on the bullet?\n\n**Answer**\nThe retardation 'a' of the bullet (assumed constant) is given by $a=\\frac{-u^{2}}{2s}=\\frac{-90\\times90}{2\\times0.6}m~s^{-2}=-6750~m~s^{-2}$. The retarding force, by the second law of motion, is $F=0.04~kg\\times6750~m~s^{-2}=270~N$. The actual resistive force and retardation may not be uniform, so the answer indicates the average resistive force."
  },
  {
    "topic": "Newton's second law of motion",
    "content": "Example 4.3\nThe motion of a particle of mass m is described by $y=ut+\\frac{1}{2}gt^{2}$. Find the force acting on the particle.\n\n**Answer**\nWe know $y=ut+\\frac{1}{2}gt^{2}$. The velocity is $v=\\frac{dy}{dt}=u+gt$. The acceleration is $a=\\frac{dv}{dt}=g$. Then the force is given by Eq. (4.5) as $F=ma=mg$. The given equation describes the motion of a particle under acceleration due to gravity."
  },
  {
    "topic": "Impulse",
    "content": "Impulse is the product of force and time duration, and it equals the change in momentum. It is a useful concept when a large force acts for a very short duration, producing a finite change in momentum. For example, when a ball hits a wall, the force and time duration are hard to measure separately, but the impulse (change in momentum) is a measurable quantity. A large force acting for a short time to produce a finite change in momentum is called an impulsive force. Newtonian mechanics makes no distinction between impulsive forces and other forces, except that they are large and short-acting."
  },
  {
    "topic": "Impulse",
    "content": "Example 4.4\nA batsman hits back a ball straight in the direction of the bowler without changing its initial speed of $12ms^{-1}$. If the mass of the ball is 0.15 kg, determine the impulse imparted to the ball. (Assume linear motion of the ball).\n\n**Answer**\nChange in momentum is $0.15\\times12-(-0.15\\times12)=3.6~N~s$. The impulse is 3.6 N s, in the direction from the batsman to the bowler. This example shows that the impulse can be calculated even when the force and contact time are difficult to know."
  },
  {
    "topic": "Newton's third law of motion",
    "content": "Newton's third law of motion states: To every action, there is always an equal and opposite reaction. A clear way to state the law is that forces always occur in pairs. The force on body A by B is equal and opposite to the force on body B by A ($F_{AB}=-F_{BA}$). The terms 'action' and 'reaction' mean nothing else but 'force'. There is no cause-effect relation implied; the forces act at the same instant. Action and reaction forces act on different bodies, so they cannot cancel each other out when considering the motion of a single body. However, for a system of two bodies, the internal action and reaction forces cancel away in pairs."
  },
  {
    "topic": "Newton's third law of motion",
    "content": "Example 4.5\nTwo identical billiard balls strike a rigid wall with the same speed but at different angles, and get reflected without any change in speed, as shown in Fig. 4.6. What is (i) the direction of the force on the wall due to each ball? (ii) the ratio of the magnitudes of impulses imparted to the balls by the wall?\n\n**Answer**\nAn instinctive but wrong answer is that the force on the wall in case (b) is inclined at 30 degrees to the normal. The force on the wall is normal to the wall in both cases. Let u be the speed and m be the mass of each ball. We choose x and y axes as shown in the figure.\nCase (a): The initial x-component of momentum is $p_{x,initial}=mu$, and the final x-component is $p_{x,final}=-mu$. The y-component of momentum is zero both before and after the collision. The x-component of impulse is the change in momentum, which is $-2mu$. The force on the ball is in the negative x-direction, normal to the wall. By Newton's third law, the force on the wall is in the positive x-direction, normal to the wall.\nCase (b): The initial x-component of momentum is $(p_{x})_{initial}=mu\\cos30^{\\circ}$ and the final is $(p_{x})_{final}=-mu\\cos30^{\\circ}$. The y-component of momentum does not change. The x-component of impulse is $-2mu\\cos30^{\\circ}$. The direction of force is again normal to the wall along the negative x-direction. By Newton's third law, the force on the wall is normal to the wall along the positive x-direction. The ratio of the magnitudes of the impulses in (a) and (b) is $\\frac{2mu}{2mu\\cos30^{\\circ}}=\\frac{1}{\\cos30^{\\circ}}=\\frac{2}{\\sqrt{3}}\\approx1.2$."
  },
  {
    "topic": "Conservation of momentum",
    "content": "The second and third laws of motion lead to the law of conservation of momentum. In an isolated system (one with no external force), the mutual forces between pairs of particles in the system can cause individual momentum changes, but since these forces are equal and opposite, the total momentum remains unchanged. This is the law of conservation of momentum: The total momentum of an isolated system of interacting particles is conserved. For a collision between two bodies A and B, with initial momenta $p_{A}$ and $p_{B}$, and final momenta $p'_{A}$ and $p'_{B}$ respectively, the total final momentum equals the initial momentum: $p'_{A}+p'_{B}=p_{A}+p_{B}$. This holds true for both elastic and inelastic collisions."
  },
  {
    "topic": "Equilibrium of a particle",
    "content": "Equilibrium of a particle in mechanics occurs when the net external force on it is zero. According to the first law, this means the particle is either at rest or in uniform motion. If two forces $F_{1}$ and $F_{2}$ act on a particle, equilibrium requires $F_{1}=-F_{2}$. For three concurrent forces $F_{1}$, $F_{2}$, and $F_{3}$, equilibrium requires their vector sum to be zero: $F_{1}+F_{2}+F_{3}=0$. The three forces in equilibrium can be represented by the sides of a closed triangle. This can be generalized to any number of forces, where they can be represented by the sides of a closed n-sided polygon. The component form of the equilibrium condition for three forces is $F_{1x}+F_{2x}+F_{3x}=0$, $F_{1y}+F_{2y}+F_{3y}=0$, and $F_{1z}+F_{2z}+F_{3z}=0$."
  },
  {
    "topic": "Equilibrium of a particle",
    "content": "Example 4.6\nA mass of 6 kg is suspended by a rope of length 2 m from the ceiling. A force of 50 N is applied horizontally at the midpoint P of the rope. What is the angle the rope makes with the vertical in equilibrium? (Take $g=10~m~s^{-2}$). Neglect the mass of the rope.\n\n**Answer**\nFigures 4.8(b) and 4.8(c) are free-body diagrams. Considering the equilibrium of the weight W, the tension $T_{2}=6\\times10=60$ N. For the equilibrium of point P under the three forces ($T_{1}$, $T_{2}$, and 50 N), the horizontal and vertical components of the resultant force must vanish. This gives the equations: $T_{1}\\cos\\theta=T_{2}=60~N$ and $T_{1}\\sin\\theta=50~N$. Dividing the two equations gives $\\tan\\theta=\\frac{50}{60}=\\frac{5}{6}$, so $\\theta=\\tan^{-1}(\\frac{5}{6})\\approx40^{\\circ}$. The answer does not depend on the length of the rope or where the force is applied."
  },
  {
    "topic": "Common forces in mechanics",
    "content": "In mechanics, we encounter several types of forces. The gravitational force is pervasive and can act at a distance. Other common forces are contact forces, which arise from contact with other objects. The component of a contact force normal to the surfaces is called normal reaction, and the component parallel to the surfaces is called friction. Other examples of contact forces include buoyant force, viscous force, and air resistance. Tension in a string and the force due to a spring are also common forces. For a spring, the restoring force F is proportional to the displacement x ($F=-kx$), where k is the force constant. At the microscopic level, these contact forces arise from electrical forces between the charged constituents of bodies."
  },
  {
    "topic": "Friction",
    "content": "Friction is a force that comes into play when there is an applied force on a body, and it opposes the impending or actual relative motion between surfaces in contact. Static friction ($f_{s}$) opposes impending motion, and its limiting value is $(f_{s})_{max}=\\mu_{s}N$, where $\\mu_{s}$ is the coefficient of static friction and N is the normal force. Kinetic friction ($f_{k}$) opposes actual relative motion once a body is sliding, and it is given by $f_{k}=\\mu_{k}N$, where $\\mu_{k}$ is the coefficient of kinetic friction. Experiments show that $\\mu_{k}$ is less than $\\mu_{s}$. Friction is independent of the area of contact and is nearly independent of velocity. Static friction is essential for daily activities like walking and for a car to accelerate."
  },
  {
    "topic": "Friction",
    "content": "Example 4.7\nDetermine the maximum acceleration of the train in which a box lying on its floor will remain stationary, given that the co-efficient of static friction between the box and the train's floor is 0.15.\n\n**Answer**\nSince the acceleration of the box is due to the static friction, $ma=f_{s}\\le\\mu_{s}N=\\mu_{s}mg$. This means $a\\le\\mu_{s}g$, so the maximum acceleration is $a_{max}=\\mu_{s}g=0.15\\times10~m~s^{-2}=1.5~m~s^{-2}$."
  },
  {
    "topic": "Friction",
    "content": "Example 4.8\nA mass of 4 kg rests on a horizontal plane. The plane is gradually inclined until at an angle $\\theta=15^{\\circ}$ with the horizontal, the mass just begins to slide. What is the coefficient of static friction between the block and the surface?\n\n**Answer**\nThe forces acting on the block are weight (mg), normal force (N), and static frictional force ($f_{s}$). In equilibrium, the resultant of these forces is zero. Resolving the weight along the two directions gives $mg\\sin\\theta=f_{s}$ and $mg\\cos\\theta=N$. When the block is about to slide, the static friction reaches its maximum value, $(f_{s})_{max}=\\mu_{s}N$. Therefore, $\\tan\\theta_{max}=\\mu_{s}$ or $\\theta_{max}=\\tan^{-1}\\mu_{s}$. For $\\theta_{max}=15^{\\circ}$, $\\mu_{s}=\\tan15^{\\circ}=0.27$."
  },
  {
    "topic": "Friction",
    "content": "Example 4.9\nWhat is the acceleration of the block and trolley system shown in Fig. 4.12(a), if the coefficient of kinetic friction between the trolley and the surface is 0.04? What is the tension in the string? (Take $g=10~m/s^{2}$). Neglect the mass of the string.\n\n**Answer**\nSince the string is inextensible and the pulley is smooth, the 3 kg block and the 20 kg trolley have the same magnitude of acceleration. Applying the second law to the block: $30-T=3a$. Applying the second law to the trolley: $T-f_{k}=20a$. The kinetic friction is $f_{k}=\\mu_{k}N=\\mu_{k}mg=0.04\\times(20\\times10)=8~N$. The equation for the trolley's motion is $T-8=20a$. Solving these two equations gives $a=\\frac{22}{23}~m~s^{-2}\\approx0.96~m~s^{-2}$ and $T=27.1~N$."
  },
  {
    "topic": "Rolling friction",
    "content": "A body rolling without slipping over a horizontal plane will, in an ideal situation, experience no friction. In practice, however, rolling friction does occur, and an applied force is needed to keep the body rolling. For the same weight, rolling friction is much smaller than static or sliding friction, which is why the discovery of the wheel was a major milestone. Rolling friction is caused by the slight deformation of the surfaces in contact, resulting in a finite area of contact rather than a single point. Rolling friction is often undesirable in machines, and lubricants or ball bearings are used to reduce it."
  },
  {
    "topic": "Circular motion",
    "content": "The acceleration of a body moving in a circle of radius R with uniform speed v is $v^{2}/R$ directed towards the centre. According to Newton's second law, the force providing this acceleration is the centripetal force, $f_{c}=\\frac{mv^{2}}{R}$ (4.16). This force is always directed towards the center. For a car taking a circular turn on a horizontal road, the centripetal force is provided by the force of static friction. The maximum speed for a car on a level road is given by $v_{max}=\\sqrt{\\mu_{s}Rg}$ (4.18), which is independent of the car's mass. On a banked road, the horizontal components of the normal force and the frictional force provide the centripetal force. The maximum permissible speed on a banked road is given by $v_{max}=(Rg\\frac{\\mu_{s}+tan\\theta}{1-\\mu_{s}tan\\theta})^{1/2}$ (4.21). At the optimum speed, $v_{o}=(R~g~tan~\\theta)^{1/2}$, frictional force is not needed at all."
  },
  {
    "topic": "Circular motion",
    "content": "Example 4.10\nA cyclist speeding at $18~km/h$ on a level road takes a sharp circular turn of radius 3 m without reducing the speed. The co-efficient of static friction between the tyres and the road is 0.1. Will the cyclist slip while taking the turn?\n\n**Answer**\nOn an unbanked road, the condition for not slipping is $v^{2}\\le\\mu_{s}R~g$. Given $R=3~m, g=9.8~m~s^{-2}, \\mu_{s}=0.1$, the value of $\\mu_{s}Rg$ is $2.94~m^{2}s^{-2}$. The speed of the cyclist is $v=18~km/h=5~ms^{-1}$, so $v^{2}=25~m^{2}s^{-2}$. Since the condition is not obeyed ($25 > 2.94$), the cyclist will slip."
  },
  {
    "topic": "Circular motion",
    "content": "Example 4.11\nA circular racetrack of radius 300 m is banked at an angle of 15°. If the coefficient of friction between the wheels of a race-car and the road is 0.2, what is the (a) optimum speed of the race-car to avoid wear and tear on its tyres, and (b) maximum permissible speed to avoid slipping?\n\n**Answer**\n(a) The optimum speed $v_{o}$ is given by $v_{o}=(R~g~tan~\\theta)^{1/2}$ (4.22). With $R=300~m, \\theta=15^{\\circ}, g=9.8~m~s^{-2}$, the optimum speed is $v_{o}=28.1~m~s^{-1}$.\n(b) The maximum permissible speed $v_{max}$ is given by $v_{max}=(Rg\\frac{\\mu_{s}+tan\\theta}{1-\\mu_{s}tan\\theta})^{1/2}$ (4.21). Substituting the values, we get $v_{max}=38.1~m~s^{-1}$."
  },
  {
    "topic": "Solving problems in mechanics",
    "content": "To solve problems in mechanics, one can choose any part of an assembly of bodies as a 'system' and apply the laws of motion to it, including all forces from the environment on that system. A useful tool for this is a 'free-body diagram', which is a separate diagram showing the chosen system and all the forces acting on it. When using free-body diagrams for different systems, Newton's third law should be employed: if a force on body A due to B is shown as F, then the force on B due to A must be shown as -F."
  },
  {
    "topic": "Solving problems in mechanics",
    "content": "Example 4.12\nA wooden block of mass 2 kg rests on a soft horizontal floor. An iron cylinder of mass 25 kg is placed on top of the block, and the floor yields, causing the block and cylinder to go down with an acceleration of $0.1~m~s^{-2}$. What is the action of the block on the floor (a) before and (b) after the floor yields? (Take $g=10~m~s^{-2}$). Identify the action-reaction pairs in the problem.\n\n**Answer**\n(a) Before the floor yields, the block is at rest. The force of gravity on the block is $2\\times10=20~N$ and the normal force R from the floor is also 20 N (by the First Law). By the third law, the action of the block on the floor is 20 N downwards.\n(b) After the floor yields, the total mass is $2+25=27~kg$. The system accelerates downwards with $0.1~m~s^{-2}$. The forces on the system are gravity ($27\\times10=270~N$) and the normal force $R'$ from the floor. Applying the second law to the system: $270-R'=27\\times0.1$, which gives $R'=267.3~N$. By the third law, the action of the system on the floor is 267.3 N downwards.\n**Action-reaction pairs**\n* For (a): The force of gravity (20 N) on the block by the earth and the force of gravity on the earth by the block (reaction). Also, the force on the floor by the block and the force on the block by the floor.\n* For (b): The force of gravity (270 N) on the system by the earth and the force of gravity on the earth by the system (reaction). Also, the force on the floor by the system and the force on the system by the floor. Additionally, the force on the block by the cylinder and the force on the cylinder by the block form an action-reaction pair."
  },
  {
    "topic": "SUMMARY",
    "content": "1. Aristotle's view that a force is necessary to keep a body in uniform motion is wrong. In practice, a force is necessary to counter opposing forces like friction.\n2. Newton's first law of motion is based on Galileo's law of inertia: \"Everybody continues to be in its state of rest or of uniform motion in a straight line unless compelled by some external force to act otherwise\". In simple terms, if the net external force on a body is zero, its acceleration is zero.\n3. Momentum (p) is the product of a body's mass (m) and velocity (v): $p=mv$.\n4. Newton's second law states that the rate of change of momentum is proportional to the applied force. The equation is $F=\\frac{dp}{dt}=ma$, where F is the net external force and a is acceleration. The SI unit of force is the newton ($1~N=1~kg~m~s^{-2}$).\n5. Impulse is the product of force and time, equal to the change in momentum.\n6. Newton's third law states: \"To every action, there is always an equal and opposite reaction\". Forces always occur in pairs, acting on different bodies.\n7. The law of conservation of momentum states that the total momentum of an isolated system of particles is conserved, a consequence of the second and third laws.\n8. Frictional force opposes impending or actual relative motion between surfaces. Static friction ($f_{s}$) opposes impending motion ($f_{s}\\le\\mu_{s}R$), and kinetic friction ($f_{k}$) opposes actual motion ($f_{k}=\\mu_{k}R$). The coefficient of kinetic friction $\\mu_{k}$ is less than the coefficient of static friction $\\mu_{s}$.\n9. The centripetal force is not a new kind of force but is the force that provides the inward radial acceleration for circular motion."
  }
]
