[
  {
    "topic": "MOTION IN A PLANE",
    "content": "In the last chapter we developed the concepts of position, displacement, velocity and acceleration that are needed to describe the motion of an object along a straight line. We found that the directional aspect of these quantities can be taken care of by + and signs, as in one dimension only two directions are possible. But in order to describe motion of an object in two dimensions (a plane) or three dimensions (space), we need to use vectors to describe the above- mentioned physical quantities. Therefore, it is first necessary to learn the language of vectors. How to add, subtract and multiply vectors? What is the result of multiplying a vector by a real number? We shall learn this to enable us to use vectors for defining velocity and acceleration in a plane. We then discuss motion of an object in a plane. As a simple case of motion in a plane, we shall discuss motion with constant acceleration and treat in detail the projectile motion. Circular motion is a familiar class of motion that has a special significance in daily-life situations. We shall discuss uniform circular motion in some detail. The equations developed in this chapter for motion in a plane can be easily extended to the case of three dimensions."
  },
  {
    "topic": "Scalars and Vectors",
    "content": "In physics, we can classify quantities as scalars or vectors. Basically, the difference is that a direction is associated with a vector but not with a scalar. A scalar quantity is a quantity with magnitude only. It is specified completely by a single number, along with the proper unit. Examples are the distance between two points, mass of an object, the temperature of a body and the time at which a certain event happened. The rules for combining scalars are the rules of ordinary algebra. Scalars can be added, subtracted, multiplied and divided just as the ordinary numbers. For example, if the length and breadth of a rectangle are 1.0 m and 0.5 m respectively, then its perimeter is the sum of the lengths of the four sides, $1.0~m+0.5~m+1.0~m+0.5~m = 3.0~m$. The length of each side is a scalar and the perimeter is also a scalar. A vector quantity is a quantity that has both a magnitude and a direction and obeys the triangle law of addition or equivalently the parallelogram law of addition. So, a vector is specified by giving its magnitude by a number and its direction. Some physical quantities that are represented by vectors are displacement, velocity, acceleration and force. To represent a vector, we use a bold face type in this book. Thus, a velocity vector can be represented by a symbol v. Since bold face is difficult to produce, when written by hand, a vector is often represented by an arrow placed over a letter, say $\\vec{v}$. Thus, both v and $\\vec{v}$ represent the velocity vector. The magnitude of a vector is often called its absolute value, indicated by $|v|$. A vector is represented by a bold face, e.g. by A, a, p, q, r, ... x, y, with respective magnitudes denoted by light face A, a, p, q, r, ... x, y."
  },
  {
    "topic": "Position and Displacement Vectors",
    "content": "To describe the position of an object moving in a plane, we need to choose a convenient point, say O as origin. Let P and P' be the positions of the object at time t and t', respectively. We join O and P by a straight line. Then, OP is the position vector of the object at time t. An arrow is marked at the head of this line. It is represented by a symbol r, i.e. $OP=r$. Point P' is represented by another position vector, OP' denoted by r'. The length of the vector r represents the magnitude of the vector and its direction is the direction in which P lies as seen from O. If the object moves from P to P', the vector PP' (with tail at P and tip at P') is called the displacement vector corresponding to motion from point P (at time t) to point P' (at time t'). It is important to note that displacement vector is the straight line joining the initial and final positions and does not depend on the actual path undertaken by the object between the two positions. For example, given the initial and final positions as P and Q, the displacement vector is the same PQ for different paths of journey. Therefore, the magnitude of displacement is either less or equal to the path length of an object between two points. This fact was emphasised in the previous chapter also while discussing motion along a straight line."
  },
  {
    "topic": "Equality of Vectors",
    "content": "Two vectors A and B are said to be equal if, and only if, they have the same magnitude and the same direction. Note that vectors A' and B' have the same magnitude but they are not equal because they have different directions. Even if we shift B' parallel to itself so that its tail Q' coincides with the tail O' of A', the tip S' of B' does not coincide with the tip P' of A'."
  },
  {
    "topic": "Multiplication of Vectors by Real Numbers",
    "content": "Multiplying a vector A with a positive number $\\lambda$ gives a vector whose magnitude is changed by the factor $\\lambda$ but the direction is the same as that of A: $|lambda A|=\\lambda|A|if~\\lambda>0$. For example, if A is multiplied by 2, the resultant vector 2A is in the same direction as A and has a magnitude twice of $|A|$. Multiplying a vector A by a negative number $-\\lambda$ gives another vector whose direction is opposite to the direction of A and whose magnitude is $\\lambda$ times A. The factor $\\lambda$ by which a vector A is multiplied could be a scalar having its own physical dimension. Then, the dimension of A is the product of the dimensions of $\\lambda$ and A. For example, if we multiply a constant velocity vector by duration (of time), we get a displacement vector."
  },
  {
    "topic": "Addition and Subtraction of Vectors - Graphical Method",
    "content": "Vectors, by definition, obey the triangle law or equivalently, the parallelogram law of addition. To find the sum $A+B$, we place vector B so that its tail is at the head of the vector A. Then, we join the tail of A to the head of B. This line OQ represents a vector R, that is, the sum of the vectors A and B. This graphical method is called the head-to-tail method. The two vectors and their resultant form three sides of a triangle, so this method is also known as triangle method of vector addition. If we find the resultant of $B+A$, the same vector R is obtained. Thus, vector addition is commutative: $A+B=B+A$. The addition of vectors also obeys the associative law: $(A+B)+C=A+(B+C)$. The sum of two equal and opposite vectors, A and -A, is a null vector or a zero vector, represented by 0, with zero magnitude: $A-A=0$. Subtraction of vectors is defined as the sum of two vectors A and -B: $A-B=A+(-B)$. We can also use the parallelogram method: bring their tails to a common origin, and the resultant vector R is the diagonal of the parallelogram from the common origin. The two methods are equivalent."
  },
  {
    "topic": "Addition and Subtraction of Vectors - Graphical Method",
    "content": "Example 3.1\nRain is falling vertically with a speed of $35~m~s^{-1}$. Winds starts blowing after sometime with a speed of $12ms^{-1}$ in east to west direction. In which direction should a boy waiting at a bus stop hold his umbrella? The velocity of the rain ($v_r$) and the wind ($v_w$) are represented by vectors. The resultant of $v_r$ and $v_w$ is R. The magnitude of R is $R=\\sqrt{v_{r}^{2}+v_{w}^{2}}=\\sqrt{35^{2}+12^{2}}m~s^{-1}=37~m~s^{-1}$. The direction $\\theta$ that R makes with the vertical is given by $\\tan\\theta=\\frac{v_{w}}{v_{r}}=\\frac{12}{35}=0.343$. This gives $\\theta=\\tan^{-1}(0.343)=19^{\\circ}$. Therefore, the boy should hold his umbrella in the vertical plane at an angle of about 19째 with the vertical towards the east."
  },
  {
    "topic": "Resolution of Vectors",
    "content": "Any vector A in a plane can be expressed as a sum of two vectors, $\\lambda a$ and $\\mu b$, along two non-zero, non-collinear vectors a and b in that plane: $A = \\lambda a + \\mu b$. This is called resolving a vector into its component vectors. It is convenient to resolve a vector along the axes of a rectangular coordinate system using unit vectors $\\hat{i}$, $\\hat{j}$, and $\\hat{k}$ for the x-, y-, and z-axes, respectively. A vector A lying in the x-y plane can be expressed as $A=A_{x}\\hat{i}+A_{y}\\hat{j}$. The quantities $A_x$ and $A_y$ are the x- and y-components of A. These components can be expressed in terms of the magnitude A and angle $\\theta$ as $A_x = A \\cos\\theta$ and $A_y=A\\sin\\theta$. Conversely, the magnitude and direction can be found from the components using $A=\\sqrt{A_{x}^{2}+A_{y}^{2}}$ and $\\tan\\theta=\\frac{A_{y}}{A_{x}}$. For a vector A in three dimensions, the components are $A_x=A\\cos\\alpha$, $A_y=A\\cos\\beta$, and $A_z=A\\cos\\gamma$. The vector is then $A=A_x\\hat{i}+A_y\\hat{j}+A_z\\hat{k}$ and its magnitude is $A=\\sqrt{A_{x}^{2}+A_{y}^{2}+A_{z}^{2}}$."
  },
  {
    "topic": "Vector Addition Analytical Method",
    "content": "The analytical method of adding vectors is often easier and more accurate than the graphical method. To add two vectors A and B, you add their corresponding components. For two vectors in the x-y plane, $A=A_{x}\\hat{i}+A_{y}\\hat{j}$ and $B=B_{x}\\hat{i}+B_{y}\\hat{j}$, their sum is $R=A+B=(A_{x}+B_{x})\\hat{i}+(A_{y}+B_{y})\\hat{j}$. Thus, the components of the resultant vector are $R_{x}=A_{x}+B_{x}$ and $R_{y}=A_{y}+B_{y}$. This method can be extended to three dimensions. For a vector $T=a+b-c$, the components would be $T_{x}=a_{x}+b_{x}-c_{x}$, $T_{y}=a_{y}+b_{y}-c_{y}$, and $T_{z}=a_{z}+b_{z}-c_{z}$."
  },
  {
    "topic": "Vector Addition Analytical Method",
    "content": "Example 3.2\nFind the magnitude and direction of the resultant of two vectors A and B in terms of their magnitudes and angle $\\theta$ between them. The resultant vector R is represented by the diagonal of a parallelogram. Its magnitude is given by the Law of Cosines: $R=\\sqrt{A^{2}+B^{2}+2AB\\cos\\theta}$. The direction can be determined using the Law of Sines: $\\frac{R}{\\sin\\theta}=\\frac{B}{\\sin\\alpha}=\\frac{A}{\\sin\\beta}$, or by the tangent function: $\\tan\\alpha=\\frac{B\\sin\\theta}{A+B\\cos\\theta}$."
  },
  {
    "topic": "Vector Addition Analytical Method",
    "content": "Example 3.3\nA motorboat is racing towards north at $25~km/h$ and the water current in that region is $10~km/h$ in the direction of $60^{\\circ}$ east of south. Find the resultant velocity of the boat. The velocities of the boat ($v_b$) and current ($v_c$) are represented by vectors. The magnitude of the resultant velocity R is found using the Law of Cosines: $R=\\sqrt{v_{b}^{2}+v_{c}^{2}+2v_{b}v_{c}\\cos120^{\\circ}}=\\sqrt{25^{2}+10^{2}+2\\times25\\times10(-1/2)}\\approx22~km/h$. To find the direction, we apply the Law of Sines: $\\frac{R}{\\sin\\theta}=\\frac{v_{c}}{\\sin\\phi}$, which gives $\\sin\\phi=\\frac{v_{c}}{R}\\sin\\theta\\approx\\frac{10\\times\\sin120^{\\circ}}{21.8}\\approx0.397$. This results in $\\phi\\approx23.4^{\\circ}$."
  },
  {
    "topic": "Motion in a Plane",
    "content": "In this section, we describe motion in two dimensions using vectors. The position vector r of a particle P is given by $r=x\\hat{i}+y\\hat{j}$. The displacement from P to P' is $\\Delta r=r'-r=\\hat{i}\\Delta x+\\hat{j}\\Delta y$. The average velocity is $\\overline{v}=\\frac{\\Delta r}{\\Delta t}$, and the instantaneous velocity is $v=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta r}{\\Delta t}=\\frac{dr}{dt}$. The direction of velocity is always tangential to the path of motion. In component form, $v=v_{x}\\hat{i}+v_{y}\\hat{j}$ where $v_{x}=\\frac{dx}{dt}$ and $v_{y}=\\frac{dy}{dt}$. The magnitude of velocity is $v=\\sqrt{v_{x}^{2}+v_{y}^{2}}$, and its direction is given by $\\tan\\theta=\\frac{v_{y}}{v_{x}}$. Similarly, the average acceleration is $\\overline{a}=\\frac{\\Delta v}{\\Delta t}$, and the instantaneous acceleration is $a=lim_{\\Delta t\\rightarrow0}\\frac{\\Delta v}{\\Delta t}=\\frac{dv}{dt}$. The direction of acceleration changes as the velocity vector changes direction. The acceleration is a constant vector only in one dimension or if the motion is in a straight line. In two or three dimensions, the velocity and acceleration vectors can have any angle between $0^{\\circ}$ and 180째 between them."
  },
  {
    "topic": "Motion in a Plane",
    "content": "Example 3.4\nThe position of a particle is given by $r=3.0t\\hat{i}+2.0t^{2}\\hat{j}+5.0\\hat{k}$ where t is in seconds and the coefficients have the proper units for r to be in metres. (a) Find $v(t)$ and $a(t)$ of the particle. (b) Find the magnitude and direction of $v(t)$ at $t=1.0s$. \n\n**Answer**\n(a) The velocity is $v(t)=\\frac{dr}{d~t}=3.0\\hat{i}+4.0t\\hat{j}$. The acceleration is $a(t)=\\frac{dv}{dt}=+4.0\\hat{j}$, so the acceleration is constant with a magnitude of $4.0~m~s^{-2}$ along the y-direction. (b) At $t=1.0s$, the velocity is $v=3.0\\hat{i}+4.0\\hat{j}$. Its magnitude is $v=\\sqrt{3^{2}+4^{2}}=5.0~m~s^{-1}$. The direction $\\theta$ is given by $\\tan\\theta=\\frac{v_y}{v_x}=\\frac{4}{3}$, so $\\theta\\approx53^{\\circ}$ with the x-axis."
  },
  {
    "topic": "Motion in a Plane with Constant Acceleration",
    "content": "For an object moving in the x-y plane with a constant acceleration, the average acceleration will equal this constant value. The velocity at any time t is given by $v=v_0+at$. In component form, this is $v_x=v_{0x}+a_xt$ and $v_y=v_{0y}+a_yt$. The position vector changes with time according to $r=r_{0}+v_{0}t+\\frac{1}{2}at^{2}$. This can also be written in component form as $x=x_{o}+v_{ox}t+\\frac{1}{2}a_{x}t^{2}$ and $y=y_{o}+v_{oy}t+\\frac{1}{2}a_{y}t^{2}$. A key interpretation is that motions in the x- and y-directions can be treated independently of each other. Motion in a plane (two-dimensions) can be treated as two separate simultaneous one-dimensional motions with constant acceleration along two perpendicular directions."
  },
  {
    "topic": "Motion in a Plane with Constant Acceleration",
    "content": "Example 3.5\nA particle starts from the origin at $t=0$ with a velocity $5.0\\hat{i}~m/s$ and moves in the x-y plane with a constant acceleration of $(3.0\\hat{i}+2.0\\hat{j})~m/s^{2}$. (a) What is the y-coordinate of the particle at the instant its x-coordinate is 84 m? (b) What is the speed of the particle at this time?. \n\n**Answer**\n(a) The position vector is $r(t)=v_{0}t+\\frac{1}{2}at^{2}=(5.0t+1.5t^{2})\\hat{i}+1.0t^{2}\\hat{j}$. The x- and y-coordinates are $x(t)=5.0t+1.5t^{2}$ and $y(t)=1.0t^{2}$ respectively. Setting $x(t)=84m$ gives $t=6s$. At this time, the y-coordinate is $y=1.0(6)^2=36.0~m$. (b) The velocity is $v=\\frac{dr}{dt}=(5.0+3.0t)\\hat{i}+2.0t\\hat{j}$. At $t=6s$, $v=23.0\\hat{i}+12.0\\hat{j}$. The speed is the magnitude of the velocity: $|v|=\\sqrt{23^{2}+12^{2}}\\cong26~m~s^{-1}$."
  },
  {
    "topic": "Projectile Motion",
    "content": "Projectile motion is the motion of an object in flight, such as a football or a baseball. The motion can be analyzed as two independent, simultaneous components: a horizontal motion with zero acceleration and a vertical motion with constant acceleration due to gravity. This independence was first stated by Galileo. For a projectile launched from the origin with initial velocity $v_0$ at an angle $\\theta_0$, the acceleration is $a=-g\\hat{j}$. The position and velocity components at time t are $x=(v_{o}\\cos\\theta_{o})t$ and $y=(v_{o}\\sin\\theta_{o})t-\\frac{1}{2}gt^{2}$, and $V_x = V_{ox} = V_o \\cos\\theta_o$ and $V_y=V_o\\sin\\theta_o-gt$. The path of the projectile is a parabola, described by the equation $y=(tan~\\theta_{o})x-\\frac{g}{2(v_{o}\\cos\\theta_{o})^{2}}x^{2}$. The time to reach maximum height is $t_m=\\frac{v_{o}\\sin\\theta_{o}}{g}$. The total time of flight is $T_f=\\frac{2v_{o}\\sin\\theta_{o}}{g}$. The maximum height is $h_m=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}$, and the horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{0}}{g}$. The range is maximum when the projection angle is $45^{\\circ}$."
  },
  {
    "topic": "Projectile Motion",
    "content": "Example 3.6\nGalileo stated that 'for elevations which exceed or fall short of 45째 by equal amounts, the ranges are equal'. For a projectile with velocity $v_{o}$ at an angle $\\theta_{o}$, the range is $R=\\frac{v_{0}^{2}\\sin2\\theta_{0}}{g}$. For angles $(45+\\alpha)$ and $(45-\\alpha)$, the value of $2\\theta_0$ is $(90+2\\alpha)$ and $(90-2\\alpha)$ respectively. Since $\\sin(90+2\\alpha)$ and $\\sin(90-2\\alpha)$ are both equal to $\\cos(2\\alpha)$, the ranges are equal."
  },
  {
    "topic": "Projectile Motion",
    "content": "Example 3.7\nA hiker on a cliff 490 m high throws a stone horizontally with an initial speed of $15~m~s^{-1}$. Find the time to reach the ground and the speed with which it hits. We choose the origin at the cliff's edge, with the y-axis pointing up. The equations of motion are $x(t)=x_{o}+v_{ox}t$ and $y(t)=y_{o}+v_{oy}t+\\frac{1}{2}a_{y}t^{2}$. We have $x_{o}=y_{o}=0$, $v_{oy}=0$, $a_{y}=-g=-9.8~m~s^{-2}$, and $v_{ox}=15~m~s^{-1}$. The stone hits the ground when $y(t)=-490~m$. Solving $-490=-\\frac{1}{2}(9.8)t^{2}$ gives $t=10~s$. The velocity components are $v_x=15~m~s^{-1}$ and $v_y=v_{oy}-gt = 0-9.8(10)=-98~m~s^{-1}$. The speed is the magnitude of the velocity, $\\sqrt{v_{x}^{2}+v_{y}^{2}}=\\sqrt{15^{2}+98^{2}}=99~m~s^{-1}$."
  },
  {
    "topic": "Projectile Motion",
    "content": "Example 3.8\nA cricket ball is thrown at a speed of 28 m $s^{-1}$ in a direction 30째 above the horizontal. Calculate: (a) the maximum height, (b) the time taken by the ball to return to the same level, and (c) the distance from the thrower to the point where the ball returns to the same level.\n\n**Answer**\n(a) The maximum height is $h_m=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}=\\frac{(28\\sin30^{\\circ})^{2}}{2(9.8)}m=10.0~m$. (b) The time of flight is $T_f=\\frac{2v_{o}\\sin\\theta_{o}}{g}=\\frac{2(28)\\sin30^{\\circ}}{9.8}\\approx2.9~s$. (c) The horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{o}}{g}=\\frac{28^{2}\\sin60^{\\circ}}{9.8}\\approx69~m$."
  },
  {
    "topic": "Uniform Circular Motion",
    "content": "Uniform circular motion is when an object follows a circular path at a constant speed. Since the velocity's direction continuously changes, the object undergoes acceleration. The acceleration, called centripetal acceleration, is directed towards the center of the circle and has a magnitude of $a_{c}=\\frac{v^{2}}{R}$. The angular speed $\\omega$ is the time rate of change of angular displacement, $\\omega=\\frac{\\Delta\\theta}{\\Delta t}$. The linear speed v is related to the angular speed by $v=R\\omega$. Therefore, centripetal acceleration can also be expressed as $a_{c}=\\omega^{2}R$. The time for one revolution is the time period T, and the frequency $\\nu$ is the number of revolutions per second ($v=1/T$). This leads to the relations $\\omega=2\\pi\\nu$, $v=2\\pi R\\nu$ and $a_{c}=4\\pi^{2}\\nu^{2}R$."
  },
  {
    "topic": "Uniform Circular Motion",
    "content": "Example 3.9\nAn insect trapped in a circular groove of radius 12 cm moves along the groove steadily and completes 7 revolutions in 100 s. (a) What is the angular speed and linear speed? (b) Is the acceleration vector a constant vector? What is its magnitude?. \n\n**Answer**\n(a) The angular speed is $\\omega = \\frac{2\\pi}{T} = \\frac{2\\pi \\times 7}{100} \\approx 0.44~rad/s$. The linear speed is $v=\\omega R=0.44~rad/s\\times12~cm=5.3~cm/s$. (b) The acceleration vector is not a constant vector because its direction continuously changes, always pointing towards the center of the circle. However, its magnitude is constant: $a=\\omega^{2}R=(0.44~s^{-1})^2(12~cm)\\approx2.3~cm~s^{-2}$."
  },
  {
    "topic": "SUMMARY",
    "content": "1. Scalar quantities have only magnitude, while vectors have both magnitude and direction.\n2. A vector multiplied by a real number changes its magnitude by that factor, and its direction may reverse if the scalar is negative.\n3. Vectors are added using graphical methods (head-to-tail, parallelogram). Vector addition is commutative ($A+B=B+A$) and associative ($(A+B)+C=A+(B+C)$).\n4. A null vector has zero magnitude. Vector subtraction is defined as the addition of the negative of a vector.\n5. A vector can be resolved into components along perpendicular axes, such as $A=A_{x}\\hat{i}+A_{y}\\hat{j}$.\n6. The analytical method of vector addition involves summing the corresponding components.\n7. The velocity is the derivative of the position vector with respect to time ($v=\\frac{dr}{dt}$). Acceleration is the derivative of the velocity vector with respect to time ($a=\\frac{dv}{dt}$).\n8. For motion with constant acceleration, the kinematic equations are $r=r_{o}+v_{o}t+\\frac{1}{2}at^{2}$ and $v=v_{0}+at$.\n9. A projectile follows a parabolic path. The maximum height is $h_{m}=\\frac{(v_{o}\\sin\\theta_{o})^{2}}{2g}$, and the horizontal range is $R=\\frac{v_{o}^{2}\\sin2\\theta_{0}}{g}$.\n10. Uniform circular motion involves a constant speed but a continuously changing velocity and acceleration. The centripetal acceleration is $a_c=\\frac{v^2}{R}=\\omega^2R$."
  }
]
