[
  {
    "topic": "WORK, ENERGY AND POWER",
    "content": "The terms 'work', 'energy' and 'power' are frequently used in everyday language. A farmer ploughing the field, a construction worker carrying bricks, a student studying for a competitive examination, an artist painting a beautiful landscape, all are said to be working. In physics, however, the word 'Work' covers a definite and precise meaning. Somebody who has the capacity to work for 14-16 hours a day is said to have a large stamina or energy. We admire a long distance runner for her stamina or energy. Energy is thus our capacity to do work. In Physics too, the term 'energy' is related to work in this sense, but as said above the term 'work' itself is defined much more precisely. The word 'power' is used in everyday life with different shades of meaning. In karate or boxing we talk of 'powerful' punches. These are delivered at a great speed. This shade of meaning is close to the meaning of the word 'power' used in physics. We shall find that there is at best a loose correlation between the physical definitions and the physiological pictures these terms generate in our minds. The aim of this chapter is to develop an understanding of these three physical quantities. Before we proceed to this task, we need to develop a mathematical prerequisite, namely the scalar product of two vectors."
  },
  {
    "topic": "The Scalar Product",
    "content": "We have learnt about vectors and their use in Chapter 3. Physical quantities like displacement, velocity, acceleration, force etc. are vectors. We have also learnt how vectors are added or subtracted. We now need to know how vectors are multiplied. There are two ways of multiplying vectors which we shall come across: one way known as the scalar product gives a scalar from two vectors and the other known as the vector product produces a new vector from two vectors. The scalar product or dot product of any two vectors A and B, denoted as (A cdot B) is defined as: \n[ A \\cdot B=A B \\cos \\theta \\] \nwhere (\\theta) is the angle between the two vectors. Since A, B and \\(cos \\theta\\) are scalars, the dot product of A and B is a scalar quantity. Each vector, A and B, has a direction but their scalar product does not have a direction. From the equation, we have: \n(A \\cdot B=A(B \\cos \\theta) = B(A \\cos \\theta)) \nGeometrically, (B \\cos \\theta) is the projection of B onto A and (A \\cos \\theta) is the projection of A onto B. So, (A \\cdot B) is the product of the magnitude of A and the component of B along A. Alternatively, it is the product of the magnitude of B and the component of A along B. The scalar product follows the commutative law: (A \\cdot B=B \\cdot A). Scalar product obeys the distributive law: (A \\cdot(B+C)=A \\cdot B+A \\cdot C). Further, (A \\cdot(\\lambda B)=\\lambda(A \\cdot B)) where (\\lambda) is a real number. For unit vectors \\(\\hat{i}, \\hat{j}, \\hat{k}\\) we have \\(\\hat{i} \\cdot \\hat{i}=\\hat{j} \\cdot \\hat{j}=\\hat{k} \\cdot \\hat{k}=1\\) and \\(\\hat{i} \\cdot \\hat{j}=\\hat{j} \\cdot \\hat{k}=\\hat{k} \\cdot \\hat{i}=0\\). Given two vectors in component form: (A=A_{x} \\hat{i}+A_{y} \\hat{j}+A_{z} \\hat{k}) and (B=B_{x} \\hat{i}+B_{y} \\hat{j}+B_{z} \\hat{k}), their scalar product is (A \\cdot B=A_{x} B_{x}+A_{y} B_{y}+A_{z} B_{z}). From this definition, we have (A \\cdot A = A^{2} = A_{x}^{2}+A_{y}^{2}+A_{z}^{2}), and (A \\cdot B=0) if A and B are perpendicular."
  },
  {
    "topic": "The Scalar Product",
    "content": "Example 5.1\nFind the angle between force (F=(3\\hat{i}+4\\hat{j}-5\\hat{k})) unit and displacement (d=(5\\hat{i}+4\\hat{j}+3\\hat{k})) unit. Also find the projection of F on d. \n\n**Answer**\nThe dot product is (F \\cdot d=F_{x}d_{x}+F_{y}d_{y}+F_{z}d_{z} = 3(5)+4(4)+(-5)(3) = 16\\) unit. The magnitudes squared are (F^{2}=F_{x}^{2}+F_{y}^{2}+F_{z}^{2} = 9+16+25 = 50) unit and (d^{2}=d_{x}^{2}+d_{y}^{2}+d_{z}^{2} = 25+16+9 = 50) unit. The angle is found from (F \\cdot d=Fd \\cos \\theta), so (\\cos \\theta=\\frac{16}{\\sqrt{50}\\sqrt{50}}=\\frac{16}{50}=0.32), which gives (\\theta=\\cos^{-1}0.32). The projection of F on d is (F \\cos \\theta = \\frac{F \\cdot d}{d} = \\frac{16}{\\sqrt{50}}\\) unit."
  },
  {
    "topic": "Notions of Work and Kinetic Energy: The Work-Energy Theorem",
    "content": "The relation for rectilinear motion under constant acceleration is (v^{2}-u^{2}=2 as). Multiplying both sides by (m/2) gives (\\frac{1}{2}mv^{2}-\\frac{1}{2}mu^{2}=mas=Fs), where (F=ma) from Newton's Second Law. This can be generalized to three dimensions as (\\frac{1}{2}mv^{2}-\\frac{1}{2}mu^{2}=m a\\cdot d=F\\cdot d). The quantity (\\frac{1}{2}mv^{2}) is defined as kinetic energy (K). The quantity (W = F \\cdot d) is defined as work. The work-energy (WE) theorem states that the change in kinetic energy of a particle is equal to the work done on it by the net force: (K_f - K_i = W). Work is done by a force on a body over a certain displacement."
  },
  {
    "topic": "Notions of Work and Kinetic Energy: The Work-Energy Theorem",
    "content": "Example 5.2\nA raindrop of mass 1.00 g falls from a height of 1.00 km and hits the ground with a speed of (50.0~m~s^{-1}). (a) What is the work done by the gravitational force? (b) What is the work done by the unknown resistive force? \n\n**Answer**\n(a) The work done by the gravitational force is (W_g=mgh = 10^{-3} \\times 10 \\times 10^{3} = 10.0~J). (b) The change in kinetic energy of the drop is (\\Delta K=\\frac{1}{2}m v^{2}-0 = \\frac{1}{2}\\times10^{-3}\\times50\\times50 = 1.25~J). From the work-energy theorem, (\\Delta K = W_g + W_r), where (W_r) is the work done by the resistive force. Thus, (W_r = \\Delta K - W_g = 1.25 - 10 = -8.75~J). The work done by the resistive force is negative."
  },
  {
    "topic": "Work",
    "content": "Work is related to force and the displacement over which it acts. For a constant force F acting on an object that undergoes a displacement d, the work done is defined as the scalar product of the force and displacement vectors: (W=(F \\cos \\theta)d=F\\cdot d). Work done is zero if (i) the displacement is zero, (ii) the force is zero, or (iii) the force and displacement are mutually perpendicular ((\\theta=90^{\\circ})). Work can be positive (if (0^{\\circ} \\le \\theta < 90^{\\circ})) or negative (if (90^{\\circ} < \\theta \\le 180^{\\circ})). The work done by a frictional force, which opposes displacement, is typically negative. The dimensions of work are ([ML^{2}T^{-2}]), and its SI unit is the joule (J). The work done on a body A by body B is not necessarily equal and opposite to the work done on B by A, even though the forces between them are equal and opposite (Newton's Third Law)."
  },
  {
    "topic": "Work",
    "content": "Example 5.3\nA cyclist comes to a skidding stop in 10 m. During this process, the force on the cycle due to the road is 200 N and is directly opposed to the motion. (a) How much work does the road do on the cycle? (b) How much work does the cycle do on the road? \n\n**Answer**\n(a) The work done on the cycle by the road is the work done by the frictional force. The angle between the force and displacement is 180°. The work done is (W_r=Fd \\cos \\theta = 200\\times10\\times\\cos\\pi = -2000~J). (b) By Newton's Third Law, an equal and opposite force acts on the road due to the cycle. However, the road undergoes no displacement, so the work done by the cycle on the road is zero."
  },
  {
    "topic": "Kinetic energy",
    "content": "If an object of mass m has velocity v, its kinetic energy K is (K=\\frac{1}{2}mv^{2}). It is a scalar quantity and a measure of the work an object can do by virtue of its motion. The dimensions of kinetic energy are ([ML^{2}T^{-2}]), and its SI unit is the joule (J). The kinetic energy of various objects is listed in Table 5.2."
  },
  {
    "topic": "Kinetic energy",
    "content": "Example 5.4\nIn a ballistics demonstration, a police officer fires a bullet of mass 50.0 g with speed (200~m~s^{-1}) on soft plywood of thickness 2.00 cm. The bullet emerges with only 10% of its initial kinetic energy. What is the emergent speed of the bullet? \n\n**Answer**\nThe initial kinetic energy is (K_i = \\frac{1}{2}mv^2 = \\frac{1}{2}(0.05~kg)(200~m~s^{-1})^2=1000~J). The final kinetic energy is 10% of this, or (K_f=100~J). The emergent speed (v_f) is found from (K_f = \\frac{1}{2}mv_f^2). Solving for (v_f) gives (v_f=\\sqrt{\\frac{2\\times100~J}{0.05~kg}}=63.2~m~s^{-1})."
  },
  {
    "topic": "Work done by a variable force",
    "content": "For a variable force, work is calculated differently. If the force (F(x)) is a function of displacement x, the work done over a small displacement (\\Delta x) can be approximated as (\\Delta W=F(x)\\Delta x). The total work done over a larger displacement from (x_i) to (x_f) is the sum of these small work elements. As (\\Delta x \\rightarrow 0), this sum becomes a definite integral: \n[ W=\\lim_{\\Delta x\\rightarrow0}\\sum_{x_{i}}^{x_{f}}F(x)\\Delta x =\\int_{x_{i}}^{x_{f}}F(x)dx \\]"
  },
  {
    "topic": "Work done by a variable force",
    "content": "Example 5.5\nA woman pushes a trunk on a rough railway platform. She applies a force of 100 N over 10 m, then her force reduces linearly to 50 N over the next 10 m. The frictional force is a constant 50 N. Plot the forces versus displacement and calculate the work done by the woman and by friction over the total 20 m. \n\n**Answer**\nThe plot of the applied force F is a rectangle from 0 to 10 m and a trapezium from 10 m to 20 m. The work done by the woman is the area under this curve, which is (W_F = 100\\times10 + \\frac{1}{2}(100+50)\\times10 = 1000+750 = 1750~J). The frictional force f is constant at -50 N (opposing the motion). The work done by friction is the area of a rectangle with height -50 N and base 20 m, which is (W_f=(-50)\\times20=-1000~J)."
  },
  {
    "topic": "The work-energy theorem for a variable force",
    "content": "The work-energy theorem can be extended to a variable force. The time rate of change of kinetic energy is (\\frac{dK}{dt}=\\frac{d}{dt}(\\frac{1}{2}m v^{2})=m v\\frac{dv}{dt}=F\\frac{dx}{dt}). This gives (dK=Fdx). Integrating from an initial position (x_i) to a final position (x_f), we get: \n[ K_{f}-K_{i}=\\int_{x_{i}}^{x_{f}}Fdx = W \\] \nThus, the change in kinetic energy equals the work done, even for a variable force. However, the WE theorem is a scalar form of Newton's second law and does not explicitly contain all the temporal and directional information present in the vector form of Newton's law. It is an integral form of Newton's second law."
  },
  {
    "topic": "The work-energy theorem for a variable force",
    "content": "Example 5.6\nA block of mass (m=1~kg) moving on a horizontal surface with speed (v_i=2~m~s^{-1}) enters a rough patch from (x=0.10~m) to (x=2.01~m). The retarding force is (F_r=-\\frac{k}{x}) in this range, where (k=0.5~J). What is the final kinetic energy and speed (v_f) of the block as it crosses this patch? \n\n**Answer**\nUsing the work-energy theorem, (K_f=K_i+\\int_{0.1}^{2.01}F_r~dx). The initial kinetic energy is (K_i=\\frac{1}{2}mv_i^2 = \\frac{1}{2}(1)(2)^2=2~J). The work done by the retarding force is (W = \\int_{0.1}^{2.01}\\frac{-k}{x}dx = -k[\\ln x]_{0.1}^{2.01} = -0.5(\\ln 2.01 - \\ln 0.1) = -0.5\\ln(20.1) \\approx -1.5~J). The final kinetic energy is (K_f = 2 - 1.5 = 0.5~J). The final speed is (v_f=\\sqrt{\\frac{2K_f}{m}} = \\sqrt{\\frac{2\\times0.5}{1}}=1~m~s^{-1})."
  },
  {
    "topic": "The concept of potential energy",
    "content": "Potential energy is 'stored' energy by virtue of a body's position or configuration. A stretched bow-string or fault lines in the earth's crust are examples. Gravitational potential energy is defined as the negative of the work done by the gravitational force in raising an object to a certain height. For an object of mass m raised to a height h near the earth's surface, the potential energy is (V(h)=mgh), where g is considered constant. The gravitational force can be expressed as the negative derivative of the potential energy with respect to height, (F=-\\frac{d}{dh}V(h)=-mg). The notion of potential energy is only applicable to conservative forces, where the work done against the force is stored as energy and depends only on the initial and final positions. The dimensions of potential energy are ([ML^{2}T^{-2}]). The zero of potential energy is arbitrary and is chosen for convenience, such as the ground level for gravitational potential energy."
  },
  {
    "topic": "The conservation of mechanical energy",
    "content": "For a body acted upon by a conservative force, the sum of its kinetic energy (K) and potential energy (V) is constant. This is the principle of conservation of mechanical energy: (\\Delta(K+V)=0), or (K_i+V(x_i)=K_f+V(x_f)). The total mechanical energy (E = K+V) is conserved. A force is conservative if it can be derived from a scalar potential energy function, (F(x)=-\\frac{dV}{dx}), or if the work it does over a closed path is zero. The example of a ball dropped from a cliff demonstrates this conservation, as the initial potential energy (E_H=mgH) is converted into kinetic energy, becoming fully kinetic at the ground, (E_0 = \\frac{1}{2}mv_f^2)."
  },
  {
    "topic": "The conservation of mechanical energy",
    "content": "Example 5.7\nA bob of mass m is suspended by a string of length L. It is imparted a horizontal velocity (v_0) at the lowest point A such that it completes a semi-circular trajectory, becoming slack at the topmost point C. Obtain an expression for (i) (v_0), (ii) the speeds at points B and C, and (iii) the ratio of the kinetic energies at B and C. \n\n**Answer**\n(i) The total mechanical energy is conserved since the string tension does no work. Taking potential energy as zero at A, the energy at A is (E_A=\\frac{1}{2}mv_0^2). At the highest point C, the tension (T_C=0), so from Newton's second law, the gravitational force provides the centripetal force: (mg=\\frac{mv_C^2}{L}). The energy at C is (E_C=\\frac{1}{2}mv_C^2+2mgL). By conservation of energy, (E_A=E_C), which gives (v_0=\\sqrt{5gL}). \n(ii) From the tension equation at C, (v_C=\\sqrt{gL}). At point B, the energy is (E_B=\\frac{1}{2}mv_B^2+mgL). Equating this to (E_A), we get (v_B=\\sqrt{3gL}). \n(iii) The ratio of kinetic energies is (\\frac{K_B}{K_C}=\\frac{\\frac{1}{2}mv_B^2}{\\frac{1}{2}mv_C^2}=\\frac{3gL}{gL}=3). \nAfter the string breaks at C, the bob will undergo projectile motion with a horizontal projection."
  },
  {
    "topic": "The potential energy of a spring",
    "content": "The spring force is a conservative, variable force that obeys Hooke's law: (F_s=-kx), where k is the spring constant and x is the displacement from equilibrium. The work done by the spring force when it is stretched or compressed from (x_i) to (x_f) is (W_s=\\int_{x_{i}}^{x_{f}}(-kx)dx = \\frac{1}{2}kx_{i}^{2}-\\frac{1}{2}kx_{f}^{2}). Since the work done depends only on the end points, the spring force is a conservative force. The potential energy of a spring is defined as (V(x)=\\frac{1}{2}kx^{2}), with the zero of potential energy at the equilibrium position. The total mechanical energy of a spring-mass system is conserved, so (\\frac{1}{2}kx_m^2=\\frac{1}{2}kx^2+\\frac{1}{2}mv^2). The speed and kinetic energy are maximum at the equilibrium position, (v_m=\\sqrt{\\frac{k}{m}}x_m)."
  },
  {
    "topic": "The potential energy of a spring",
    "content": "Example 5.8\nA car of mass 1000 kg moving with a speed of (18.0~km/h) collides with a horizontally mounted spring of spring constant (5.25\\times10^{3}~N~m^{-1}). What is the maximum compression of the spring? \n\n**Answer**\nAt maximum compression, the kinetic energy of the car is entirely converted into the potential energy of the spring. The car's speed is (18~km~h^{-1}=5~m~s^{-1}). The initial kinetic energy is (K=\\frac{1}{2}mv^2=\\frac{1}{2}(1000)(5)^2=1.25\\times10^{4}~J). At maximum compression (x_m), the potential energy is (V=\\frac{1}{2}kx_m^2). By conservation of mechanical energy, (V=K), so (\\frac{1}{2}(5.25\\times10^3)x_m^2=1.25\\times10^4), which gives (x_m\\approx2.00~m)."
  },
  {
    "topic": "The potential energy of a spring",
    "content": "Example 5.9\nConsider Example 5.8 taking the coefficient of friction, (\\mu), to be 0.5 and calculate the maximum compression of the spring. \n\n**Answer**\nWith friction, we use the work-energy theorem instead of conservation of energy. The work done by the net force is the sum of the work done by the spring force ((W_s=-\\frac{1}{2}kx_m^2)) and the work done by friction ((W_f=-\\mu mg x_m)). The change in kinetic energy is (\\Delta K = 0-\\frac{1}{2}mv^2). Equating these, we get (\\frac{1}{2}mv^2=\\frac{1}{2}kx_m^2+\\mu mg x_m). Rearranging gives a quadratic equation in (x_m): (kx_m^2+2\\mu mg x_m-mv^2=0). Solving for (x_m) using the positive root gives (x_m\\approx1.35~m), which is less than the frictionless case."
  },
  {
    "topic": "Power",
    "content": "Power is the time rate at which work is done or energy is transferred. The average power is (P_{av}=\\frac{W}{t}), and the instantaneous power is (P=\\frac{dW}{dt}). The instantaneous power can also be expressed as the dot product of force and velocity: (P=F\\cdot v). Power is a scalar quantity with dimensions ([ML^{2}T^{-3}]). The SI unit of power is the watt (W), where (1~W=1~J~s^{-1}). Another unit is horsepower (hp), where (1~hp=746~W). Electrical energy consumption is often measured in kilowatt-hours (kWh), which is a unit of energy, not power, with (1~kWh=3.6\\times10^{6}~J)."
  },
  {
    "topic": "Power",
    "content": "Example 5.10\nAn elevator can carry a maximum load of 1800 kg and moves up with a constant speed of (2~m~s^{-1}). The frictional force opposing the motion is 4000 N. Determine the minimum power delivered by the motor to the elevator in watts and in horsepower.\n\n**Answer**\nThe total downward force is the sum of the gravitational force and the frictional force: (F=mg+F_{f}=(1800\\times10)+4000=22000~N). To move at a constant speed, the motor must apply an upward force of this magnitude. The minimum power delivered by the motor is (P=Fv=22000\\times2=44000~W). In horsepower, this is (P=\\frac{44000}{746}\\approx59~hp)."
  },
  {
    "topic": "Collisions",
    "content": "In physics, we study collisions as a way to understand the conservation of momentum and energy. In all collisions, the total linear momentum is conserved because the internal forces between the colliding objects cancel out according to Newton's Third Law. However, the total kinetic energy may not be conserved due to energy transformations into heat, sound, or deformation. An elastic collision is one where the total kinetic energy is conserved. A completely inelastic collision is one where the two particles stick together and move as one after the collision. An inelastic collision is an intermediate case where some kinetic energy is lost."
  },
  {
    "topic": "Collisions",
    "content": "Example 5.11\nSlow down of neutrons: In a nuclear reactor, a neutron of high speed must be slowed to a lower speed so that it can cause fission. Show that a neutron can lose most of its kinetic energy in an elastic collision with a light nucleus like deuterium or carbon, which has a mass of only a few times the neutron mass. \n\n**Answer**\nThe fractional kinetic energy lost by the neutron ($m_1$) in a head-on elastic collision with a stationary nucleus ($m_2$) is given by (f_1=\\frac{K_{1f}}{K_{1i}}=(\\frac{m_1-m_2}{m_1+m_2})^2). The fractional kinetic energy gained by the moderating nucleus is (f_2=1-f_1=\\frac{4m_1m_2}{(m_1+m_2)^2}). For deuterium ($m_2=2m_1$), (f_1 = (\\frac{1-2}{1+2})^2 = \\frac{1}{9}), so almost 90% of the neutron's energy is transferred. For carbon, the fractional loss is smaller, but still significant."
  },
  {
    "topic": "Collisions",
    "content": "Example 5.12\nConsider the collision of two billiard balls with equal masses ($m_1=m_2$). The first ball (cue) strikes the second ball (target) which is at rest. The player wants to 'sink' the target ball in a corner pocket at an angle $\\theta_2=37^{\\circ}$. Assuming an elastic collision and that friction and rotational motion are negligible, obtain $\\theta_1$.\n\n**Answer**\nFrom momentum conservation, (v_{1i}=v_{1f}+v_{2f}) since (m_1=m_2). Squaring this gives (v_{1i}^2=v_{1f}^2+v_{2f}^2+2v_{1f}v_{2f}\\cos(\\theta_1+\\theta_2)). From conservation of kinetic energy for an elastic collision, (v_{1i}^2=v_{1f}^2+v_{2f}^2). Comparing these two equations, we find that (2v_{1f}v_{2f}\\cos(\\theta_1+\\theta_2)=0). Since the velocities are non-zero, this implies (\\cos(\\theta_1+\\theta_2)=0), so (\\theta_1+\\theta_2=90^{\\circ}). Given (\\theta_2=37^{\\circ}), we find (\\theta_1=53^{\\circ}). This proves that for a glancing elastic collision between two equal masses, one initially at rest, they will move at right angles to each other after the collision."
  },
  {
    "topic": "SUMMARY OF WORK, ENERGY AND POWER",
    "content": "1. The work-energy theorem states that the change in kinetic energy of a body is the work done by the net force on the body: (K_f-K_i=W_{net}).\n2. A force is conservative if the work it does is path-independent, or if the work done over a closed loop is zero. For a conservative force in one dimension, a potential energy function (V(x)) can be defined such that (F(x)=-\\frac{dV(x)}{dx}).\n3. The principle of conservation of mechanical energy states that the total mechanical energy ((E=K+V)) of a body remains constant if the only forces doing work on it are conservative.\n4. The gravitational potential energy of a particle of mass m at height x is (V(x)=mgx). The elastic potential energy of a spring with force constant k and extension x is (V(x)=\\frac{1}{2}kx^{2}).\n5. The scalar or dot product of two vectors A and B is a scalar quantity defined as (A\\cdot B=AB\\cos\\theta). The scalar product of unit vectors is: (\\hat{i}\\cdot\\hat{i}=\\hat{j}\\cdot\\hat{j}=\\hat{k}\\cdot\\hat{k}=1) and (\\hat{i}\\cdot\\hat{j}=\\hat{j}\\cdot\\hat{k}=\\hat{k}\\cdot\\hat{i}=0).\n6. Power is the rate at which work is done, (P=\\frac{dW}{dt}), and can be expressed as the dot product of force and velocity, (P=F\\cdot v). Its SI unit is the watt (W).\n7. In all collisions, total linear momentum is conserved. In an elastic collision, total kinetic energy is also conserved. In a completely inelastic collision, the two bodies stick together."
  }
]