[
  {
    "topic": "SYSTEMS OF PARTICLES AND ROTATIONAL MOTION",
    "content": "In the earlier chapters we primarily considered the motion of a single particle. A particle is ideally represented as a point mass having no size. We applied the results of our study even to the motion of bodies of finite size, assuming that motion of such bodies can be described in terms of the motion of a particle. Any real body which we encounter in daily life has a finite size. In dealing with the motion of extended bodies (bodies of finite size) often the idealised model of a particle is inadequate. In this chapter we shall try to go beyond this inadequacy. We shall attempt to build an understanding of the motion of extended bodies. An extended body, in the first place, is a system of particles. We shall begin with the consideration of motion of the system as a whole. The centre of mass of a system of particles will be a key concept here. We shall discuss the motion of the centre of mass of a system of particles and usefulness of this concept in understanding the motion of extended bodies. A large class of problems with extended bodies can be solved by considering them to be rigid bodies. Ideally a rigid body is a body with a perfectly definite and unchanging shape. The distances between all pairs of particles of such a body do not change. It is evident from this definition of a rigid body that no real body is truly rigid, since real bodies deform under the influence of forces. But in many situations the deformations are negligible. In a number of situations involving bodies such as wheels, tops, steel beams, molecules and planets on the other hand, we can ignore that they warp (twist out of shape), bend or vibrate and treat them as rigid."
  },
  {
    "topic": "What kind of motion can a rigid body have?",
    "content": "Let us try to explore this question by taking some examples of the motion of rigid bodies. Let us begin with a rectangular block sliding down an inclined plane without any sidewise movement. The block is taken as a rigid body. Its motion down the plane is such that all the particles of the body are moving together, i.e. they have the same velocity at any instant of time. The rigid body here is in pure translational motion. In pure translational motion at any instant of time, all particles of the body have the same velocity. Consider now the rolling motion of a solid metallic or wooden cylinder down the same inclined plane. The rigid body in this problem, namely the cylinder, shifts from the top to the bottom of the inclined plane, and thus, seems to have translational motion. But as Fig. 6.2 shows, all its particles are not moving with the same velocity at any instant. The body, therefore, is not in pure translational motion. Its motion is translational plus 'something else.' In order to understand what this 'something else' is, let us take a rigid body so constrained that it cannot have translational motion. The most common way to constrain a rigid body so that it does not have translational motion is to fix it along a straight line. The only possible motion of such a rigid body is rotation. The line or fixed axis about which the body is rotating is its axis of rotation. If you look around, you will come across many examples of rotation about an axis, a ceiling fan, a potter's wheel, a giant wheel in a fair, a merry-go-round and so on. You may notice that in rotation of a rigid body about a fixed axis, every particle of the body moves in a circle, which lies in a plane perpendicular to the axis and has its centre on the axis. Fig. 6.4 shows the rotational motion of a rigid body about a fixed axis (the z-axis of the frame of reference). Note that the circles described by (P_1) and (P_2) may lie in different planes; both these planes, however, are perpendicular to the fixed axis. For any particle on the axis like (P_3), (r=0). Any such particle remains stationary while the body rotates. In some examples of rotation, however, the axis may not be fixed. A prominent example of this kind of rotation is a top spinning in place. We know from experience that the axis of such a spinning top moves around the vertical through its point of contact with the ground, sweeping out a cone. Another simple example of this kind of rotation is the oscillating table fan or a pedestal fan. You may have observed that the axis of rotation of such a fan has an oscillating (sidewise) movement in a horizontal plane about the vertical through the point at which the axis is pivoted. While the fan rotates and its axis moves sidewise, this point is fixed. Thus, in more general cases of rotation, one point and not one line, of the rigid body is fixed. In our study, however, we mostly deal with the simpler and special case of rotation in which one line (i.e. the axis) is fixed. The rolling motion of a cylinder down an inclined plane is a combination of rotation about a fixed axis and translation. The 'something else' in the case of rolling motion which we referred to earlier is rotational motion. We now recapitulate the most important observations of the present section: The motion of a rigid body which is not pivoted or fixed in some way is either a pure translation or a combination of translation and rotation. The motion of a rigid body which is pivoted or fixed in some way is rotation. The rotation may be about an axis that is fixed (e.g. a ceiling fan) or moving (e.g. an oscillating table fan). We shall, in the present chapter, consider rotational motion about a fixed axis only."
  },
  {
    "topic": "Centre of mass",
    "content": "We shall first see what the centre of mass of a system of particles is and then discuss its significance. For simplicity we shall start with a two particle system. We shall take the line joining the two particles to be the x- axis. Let the distances of the two particles be (x_1) and (x_2) respectively from some origin O. Let (m_1) and (m_2) be respectively the masses of the two particles. The centre of mass of the system is that point C which is at a distance X from O, where X is given by: \n[ X=\\frac{m_{1}x_{1}+m_{2}x_{2}}{m_{1}+m_{2}} ] \nIn this equation, X can be regarded as the mass- weighted mean of (x_1) and (x_2). If we have n particles of masses (m_1, m_2, ... m_n) respectively, along a straight line taken as the x-axis, then by definition the position of the centre of the mass of the system of particles is given by: \n[ X=\\frac{m_{1}x_{1}+m_{2}x_{2}+...+m_{n}x_{n}}{m_{1}+m_{2}+...+m_{n}} = \\frac{\\sum_{i=1}^{n}m_{i}x_{i}}{\\sum_{i=1}^{n}m_{i}} = \\frac{\\sum m_{i}x_{i}}{M} ] \nwhere (M=\\sum m_{i}) is the total mass of the system. For a system of n particles distributed in space, the centre of mass is at (X, Y, Z), where: \n[ X=\\frac{\\sum m_{i}x_{i}}{M} ] \n[ Y=\\frac{\\sum m_{i}y_{i}}{M} ] \n[ Z=\\frac{\\sum m_{i}z_{i}}{M} ] \nThese can be combined into one vector equation: \n[ R=\\frac{\\sum m_{i}r_{i}}{M} ] \nIf the origin is chosen to be the centre of mass, then (\\sum m_i r_i=0). For a rigid body, treated as a continuous distribution of mass, the coordinates of the centre of mass are given by: \n[ X=\\frac{1}{M}\\int x~dm, Y=\\frac{1}{M}\\int y~dm, Z=\\frac{1}{M}\\int z~dm ] \nFor homogeneous bodies of regular shapes, their centre of mass coincides with their geometric centre due to symmetry. This can be seen by considering that for every mass element at a point (x, y, z), there is a corresponding element at (-x, y, z), making the integrals zero."
  },
  {
    "topic": "Centre of mass",
    "content": "Example 6.1\nFind the centre of mass of three particles at the vertices of an equilateral triangle. The masses of the particles are 100g, 150g, and 200g respectively. Each side of the equilateral triangle is 0.5m long. \n\n**Answer**\nWith the x- and y-axes chosen as shown in Fig. 6.9, the coordinates of the vertices O, A and B are respectively (0,0), (0.5,0), and $(0.25,0.25\\sqrt{3})$. Let the masses 100 g, 150g and 200g be located at O, A and B. Then the coordinates of the centre of mass (X, Y) are: \n[ X=\\frac{100(0)+150(0.5)+200(0.25)gm}{(100+150+200)g} = \\frac{75+50}{450}m=\\frac{125}{450}m=\\frac{5}{18}m ] \n[ Y=\\frac{100(0)+150(0)+200(0.25\\sqrt{3})}{450g} = \\frac{50\\sqrt{3}}{450}m=\\frac{\\sqrt{3}}{9}m=\\frac{1}{3\\sqrt{3}}m ] \nThe centre of mass is shown in the figure. It is not the geometric centre of the triangle because the masses are not equal."
  },
  {
    "topic": "Centre of mass",
    "content": "Example 6.2\nFind the centre of mass of a triangular lamina. \n\n**Answer**\nBy subdividing the lamina into narrow strips parallel to the base, we can see that the centre of mass of each strip is at its midpoint. The line joining the midpoints of all the strips forms the median. Therefore, the centre of mass of the triangle must lie on the median. By repeating this argument for other medians, we find that the centre of mass of the triangle is at the point of concurrence of the medians, which is the centroid G of the triangle."
  },
  {
    "topic": "Centre of mass",
    "content": "Example 6.3\nFind the centre of mass of a uniform L-shaped lamina (a thin flat plate) with dimensions as shown. The mass of the lamina is 3 kg. \n\n**Answer**\nWe can divide the L-shaped lamina into three 1m x 1m squares, each with a mass of 1 kg. The center of mass of each square is at its geometric center. These centers of mass have coordinates (C_1=(1/2,1/2)), (C_2=(3/2,1/2)), and (C_3=(1/2,3/2)). The center of mass of the entire L-shaped lamina (X, Y) is the center of mass of these three points: \n[ X=\\frac{1(1/2)+1(3/2)+1(1/2)}{1+1+1}m = \\frac{5}{6}m ] \n[ Y=\\frac{1(1/2)+1(1/2)+1(3/2)}{1+1+1}m = \\frac{5}{6}m ] \nThus, the center of mass is at ((\\frac{5}{6}, \\frac{5}{6}))."
  },
  {
    "topic": "Motion of centre of mass",
    "content": "The motion of the centre of mass of a system of particles is a key concept. Differentiating the position vector of the centre of mass with respect to time gives the velocity of the centre of mass: \n[ MV = m_1 v_1 + m_2 v_2 + ... + m_n v_n = \\sum m_i v_i ] \nwhere V is the velocity of the centre of mass. Differentiating again gives the acceleration of the centre of mass: \n[ MA = m_1 a_1 + m_2 a_2 + ... + m_n a_n = \\sum F_i = F_{ext} ] \nwhere (F_{ext}) is the sum of all external forces on the system. This equation states that the centre of mass of a system of particles moves as if all the mass was concentrated at that point and all external forces were applied there. This is a powerful concept because it means we don't need to know the internal forces to determine the motion of the centre of mass. The motion of the center of mass of a projectile is a good illustration: even if the projectile explodes, the center of mass continues along the same parabolic trajectory as if no explosion had occurred, because the explosion forces are internal to the system."
  },
  {
    "topic": "Linear momentum of a system of particles",
    "content": "The linear momentum of a system of particles is defined as the vector sum of all individual particle momenta: \n[ P = p_1 + p_2 + ... + p_n = m_1 v_1 + m_2 v_2 + ... + m_n v_n ] \nThis can be written in terms of the total mass M and the velocity of the center of mass V as (P=MV). Newton's second law for a system of particles is then (\\frac{dP}{dt}=F_{ext}). If the total external force acting on the system is zero, the total linear momentum is conserved: (\\frac{dP}{dt}=0 \\implies P=\\text{constant}). This means the velocity of the centre of mass remains constant. This principle is widely used, for example, in analyzing the radioactive decay of a nucleus, where the fragments move in a way that the centre of mass of the system continues along the original path of the nucleus."
  },
  {
    "topic": "Vector product of two vectors",
    "content": "The vector product (or cross product) of two vectors a and b is a vector c, defined such that its magnitude is (c=ab\\sin\\theta), where (\\theta) is the angle between a and b. The vector c is perpendicular to the plane containing a and b, with its direction given by the right-hand screw rule or the right-hand rule. The vector product is not commutative, i.e. (a\\times b = -b\\times a). A vector product of a vector with itself is the null vector, (a\\times a=0). This leads to elementary cross products for unit vectors: (\\hat{i}\\times\\hat{i}=0, \\hat{j}\\times\\hat{j}=0, \\hat{k}\\times\\hat{k}=0), and (\\hat{i}\\times\\hat{j}=\\hat{k}, \\hat{j}\\times\\hat{k}=\\hat{i}, \\hat{k}\\times\\hat{i}=\\hat{j}). The component form of the vector product (c = a\\times b) is (c=(a_{y}b_{z}-a_{z}b_{y})\\hat{i}+(a_{z}b_{x}-a_{x}b_{z})\\hat{j}+(a_{x}b_{y}-a_{y}b_{x})\\hat{k})."
  },
  {
    "topic": "Vector product of two vectors",
    "content": "Example 6.4\nFind the scalar and vector products of two vectors: (a=(3\\hat{i}-4\\hat{j}+5\\hat{k})) and (b=(-2\\hat{i}+\\hat{j}+3\\hat{k})). \n\n**Answer**\nThe scalar product is (a\\cdot b=(3\\hat{i}-4\\hat{j}+5\\hat{k})\\cdot(-2\\hat{i}+\\hat{j}+3\\hat{k}) = (3)(-2)+(-4)(1)+(5)(3) = -6-4+15 = 5). The vector product is (a\\times b = ((-4)(3)-(5)(1))\\hat{i}+((5)(-2)-(3)(3))\\hat{j}+((3)(1)-(-4)(-2))\\hat{k} = -17\\hat{i}-19\\hat{j}-5\\hat{k})."
  },
  {
    "topic": "Angular velocity and its relation with linear velocity",
    "content": "For a rigid body rotating about a fixed axis, every particle moves in a circle in a plane perpendicular to the axis. All particles have the same angular velocity (\\omega), which is defined as the time rate of change of angular displacement: (\\omega = d\\theta/dt). The angular velocity is a vector that lies along the axis of rotation, and its direction is given by the right-hand screw rule. The linear velocity v of a particle at a perpendicular distance r from the axis is given by (v=\\omega r). In vector form, the relationship is (v=\\omega\\times r). The angular acceleration (\\alpha) is defined as the time rate of change of angular velocity: (\\alpha=d\\omega/dt). For a fixed axis, the vector equation reduces to the scalar equation (\\alpha=d\\omega/dt)."
  },
  {
    "topic": "Torque and angular momentum",
    "content": "Torque (or moment of force) is the rotational analogue of force in linear motion. For a force F acting on a particle with position vector r, the torque (\\tau) with respect to the origin is defined as the vector product (\\tau=r\\times F). The magnitude is (\\tau=rF\\sin\\theta), and the direction is given by the right-hand rule. Angular momentum is the rotational analogue of linear momentum. For a single particle, the angular momentum l is defined as (l=r\\times p), where p is the linear momentum. The time rate of change of angular momentum is equal to the torque acting on it: (\\frac{dl}{dt}=\\tau). For a system of particles, the total angular momentum L is the vector sum of individual angular momenta, (L=\\sum_i l_i). The total external torque on a system is equal to the time rate of change of the total angular momentum: (\\frac{dL}{dt}=\\tau_{ext}). If the total external torque is zero, the total angular momentum is conserved ((L=\\text{constant}))."
  },
  {
    "topic": "Torque and angular momentum",
    "content": "Example 6.5\nFind the torque of a force (F=7\\hat{i}+3\\hat{j}-5\\hat{k}) about the origin. The force acts on a particle whose position vector is (r=\\hat{i}-\\hat{j}+\\hat{k}). \n\n**Answer**\nThe torque is given by (\\tau=r\\times F). Using the determinant rule: \n[ \\tau=\\begin{vmatrix} \\hat{i} & \\hat{j} & \\hat{k} \\\\ 1 & -1 & 1 \\\\ 7 & 3 & -5 \\end{vmatrix} = ((-1)(-5)-(1)(3))\\hat{i}-((1)(-5)-(1)(7))\\hat{j}+((1)(3)-(-1)(7))\\hat{k} = (5-3)\\hat{i}-(-5-7)\\hat{j}+(3-(-7))\\hat{k} = 2\\hat{i}+12\\hat{j}+10\\hat{k} ] \nThus, (\\tau=2\\hat{i}+12\\hat{j}+10\\hat{k})."
  },
  {
    "topic": "Torque and angular momentum",
    "content": "Example 6.6\nShow that the angular momentum about any point of a single particle moving with constant velocity remains constant throughout the motion. \n\n**Answer**\nThe angular momentum is given by (l=r\\times p = r\\times mv). Its magnitude is (l=mvr\\sin\\theta), where (\\theta) is the angle between r and v. For constant velocity, the line of direction of v remains the same, so the perpendicular distance of the line of direction of v from the origin, (r\\sin\\theta), is a constant. The direction of l is perpendicular to the plane of r and v, and this direction also remains constant. Thus, l remains constant in both magnitude and direction, and is conserved. The external torque on the particle is (\\tau=\\frac{dl}{dt}=0)."
  },
  {
    "topic": "Equilibrium of a rigid body",
    "content": "A rigid body is in mechanical equilibrium if its linear momentum and angular momentum are constant. This means the total force and total torque on the body are both zero. The conditions for equilibrium are: 1. Translational equilibrium: The vector sum of all forces is zero, (\\sum F_{i}=0). This is equivalent to three scalar equations: (\\sum F_{ix}=0), (\\sum F_{iy}=0), and (\\sum F_{iz}=0). 2. Rotational equilibrium: The vector sum of all torques is zero, (\\sum \\tau_{i}=0). This is also equivalent to three scalar equations: (\\sum \\tau_{ix}=0), (\\sum \\tau_{iy}=0), and (\\sum \\tau_{iz}=0). These six conditions must be satisfied for mechanical equilibrium. A body can be in partial equilibrium. A couple is a pair of equal and opposite forces with different lines of action, which produces rotation without translation. The moment of a couple is independent of the point about which it is taken."
  },
  {
    "topic": "Equilibrium of a rigid body",
    "content": "Example 6.7\nShow that moment of a couple does not depend on the point about which you take the moments. \n\n**Answer**\nConsider a couple with forces F and -F acting at points B and A, with position vectors (r_2) and (r_1) from an origin O. The moment of the couple is the sum of the moments of the two forces: (\\tau = r_2 \\times F + r_1 \\times (-F) = (r_2 - r_1) \\times F). Since (r_2 - r_1) is the vector from A to B, the moment is (AB \\times F), which is independent of the origin O."
  },
  {
    "topic": "Centre of gravity",
    "content": "The centre of gravity (CG) of a body is the point where the total gravitational torque on the body is zero. In a uniform gravitational field, the centre of gravity coincides with the centre of mass. The position vectors (r_i) of all particles relative to the CG satisfy (\\sum m_i r_i=0). The CG can be determined experimentally by suspending the body from different points; the intersection of the vertical lines through the suspension points gives the CG."
  },
  {
    "topic": "Equilibrium of a rigid body",
    "content": "Example 6.8\nA metal bar 70 cm long and 4.00 kg in mass is supported on two knife-edges placed 10 cm from each end. A 6.00 kg load is suspended at 30 cm from one end. Find the reactions at the knife-edges. \n\n**Answer**\nLet the left end be A and the right end be B. The knife-edges are at (K_1) and (K_2). The weight of the rod W acts at its center of gravity G, which is at 35 cm from A. The suspended load (W_1) is at P, 30 cm from A. For translational equilibrium, the upward normal reactions (R_1) and (R_2) balance the downward weights: (R_1+R_2-W_1-W=0). Taking moments about G, for rotational equilibrium, the sum of moments is zero: (-R_1(0.25)+W_1(0.05)+R_2(0.25)=0). Solving these two equations with the given values for masses and distances gives (R_1=54.88~N) and (R_2=43.12~N)."
  },
  {
    "topic": "Equilibrium of a rigid body",
    "content": "Example 6.9\nA 3m long ladder weighing 20 kg leans on a frictionless wall. Its feet rest on the floor 1 m from the wall. Find the reaction forces of the wall and the floor. \n\n**Answer**\nThe ladder AB is 3 m long, its foot A is at distance $AC=1$ m from the wall. From Pythagoras theorem, $BC=2\\sqrt{2}$ m. The forces on the ladder are its weight W acting at its centre of gravity D, reaction forces $F_1$ and $F_2$ of the wall and the floor respectively. Force $F_1$ is perpendicular to the wall, since the wall is frictionless. Force $F_2$ is resolved into two components, the normal reaction N and the force of friction F. For translational equilibrium, taking the forces in the vertical direction gives $N-W=0$, and in the horizontal direction gives $F-F_1=0$. For rotational equilibrium, taking the moments of the forces about A, we have $BC~F_1 - AD~W = 0$, where D is the midpoint of the ladder. This simplifies to $2\\sqrt{2}F_{1}-(1/2)W=0$. Solving these equations gives $N=196.0~N$, $F_1=34.6~N$ and $F=34.6~N$. The total reaction force of the floor is $F_2=\\sqrt{F^2+N^2}\\approx199.0~N$. The angle it makes with the horizontal is $\\tan\\alpha=N/F=4\\sqrt{2}$, or $\\alpha=\\tan^{-1}(4\\sqrt{2})\\approx80^{\\circ}$."
  },
  {
    "topic": "Moment of Inertia",
    "content": "Moment of inertia (I) is the rotational analogue of mass in linear motion. It measures a body's rotational inertia. For a rigid body rotating about a fixed axis, the total kinetic energy is $K=\\frac{1}{2}I\\omega^{2}$, where I is defined as $I=\\sum_{i=1}^{n}m_{i}r_{i}^{2}$. Here, (m_i) is the mass of the (i^{th}) particle and (r_i) is its perpendicular distance from the axis of rotation. The moment of inertia depends on the mass distribution and the axis of rotation. The radius of gyration (k) is defined as the distance from the axis of a point mass whose moment of inertia is equal to that of the body, so $I=Mk^2$. Moment of inertia has dimensions of ([ML^2]) and SI units of (kg~m^2). A flywheel has a large moment of inertia to resist sudden changes in speed."
  },
  {
    "topic": "Kinematics of rotational motion about a fixed axis",
    "content": "The kinematics of rotational motion about a fixed axis are analogous to those of linear motion. The corresponding quantities are: angular displacement (\\theta), angular velocity (\\omega), and angular acceleration (\\alpha). For uniform angular acceleration, the kinematic equations are: \n[ \\omega = \\omega_0 + \\alpha t ] \n[ \\theta = \\theta_0 + \\omega_0 t + \\frac{1}{2}\\alpha t^2 ] \n[ \\omega^2 = \\omega_0^2 + 2\\alpha(\\theta-\\theta_0) ] \nwhere (\\theta_0) and (\\omega_0) are the initial angular displacement and velocity, respectively."
  },
  {
    "topic": "Kinematics of rotational motion about a fixed axis",
    "content": "Example 6.10\nObtain Eq. (6.36) from first principles. \n\n**Answer**\nThe angular acceleration is uniform, so (\\alpha = d\\omega/dt = \\text{constant}). Integrating this equation gives (\\omega = \\int\\alpha~dt+c=\\alpha t+c). At (t=0), (\\omega = \\omega_0), so the constant (c=\\omega_0). Thus, (\\omega=\\omega_0+\\alpha t)."
  },
  {
    "topic": "Kinematics of rotational motion about a fixed axis",
    "content": "Example 6.11\nThe angular speed of a motor wheel is increased from 1200 rpm to 3120 rpm in 16 seconds. (i) What is its angular acceleration, assuming the acceleration to be uniform? (ii) How many revolutions does the engine make during this time? \n\n**Answer**\n(i) The initial angular speed is (\\omega_0 = 1200~rev/min = \\frac{1200\\times2\\pi}{60}~rad/s=40\\pi~rad/s). The final angular speed is (\\omega = 3120~rev/min = \\frac{3120\\times2\\pi}{60}~rad/s=104\\pi~rad/s). The angular acceleration is (\\alpha=\\frac{\\omega-\\omega_0}{t}=\\frac{104\\pi-40\\pi}{16}=4\\pi~rad~s^{-2}). \n(ii) The angular displacement is (\\theta=\\omega_0t+\\frac{1}{2}\\alpha t^2 = 40\\pi(16)+\\frac{1}{2}(4\\pi)(16)^2 = 640\\pi+512\\pi=1152\\pi~rad). The number of revolutions is (\\frac{1152\\pi}{2\\pi}=576)."
  },
  {
    "topic": "Dynamics of rotational motion about a fixed axis",
    "content": "The rotational analogue of Newton's second law is (\\tau=I\\alpha), where (\\tau) is the torque and I is the moment of inertia. This equation relates torque to angular acceleration. The instantaneous power for rotational motion is (P=\\tau\\omega). For a rigid body rotating about a fixed axis, the work done by the total external torque is (W=\\int\\tau d\\theta). The rate at which work is done is equated to the rate of increase of kinetic energy, (\\tau\\omega = I\\omega\\alpha), which leads to (\\tau=I\\alpha)."
  },
  {
    "topic": "Dynamics of rotational motion about a fixed axis",
    "content": "Example 6.12\nA cord of negligible mass is wound round the rim of a flywheel of mass 20 kg and radius 20 cm. A steady pull of 25 N is applied. (a) Compute the angular acceleration. (b) Find the work done by the pull when 2m of the cord is unwound. (c) Find the kinetic energy of the wheel. (d) Compare answers to (b) and (c).\n\n**Answer**\n(a) The torque is (\\tau=FR = 25~N \\times 0.20~m = 5.0~N~m). The moment of inertia of the flywheel is (I=\\frac{1}{2}MR^2 = \\frac{1}{2}(20~kg)(0.2~m)^2=0.4~kg~m^2). The angular acceleration is (\\alpha=\\frac{\\tau}{I}=\\frac{5.0}{0.4}=12.5~s^{-2}). \n(b) The work done is (W = F\\times s = 25~N\\times2~m=50~J). \n(c) The angular displacement is (\\theta=s/R = 2~m/0.2~m=10~rad). The final angular velocity squared is (\\omega^2=\\omega_0^2+2\\alpha\\theta = 0+2(12.5)(10)=250~(rad/s)^2). The kinetic energy is (K=\\frac{1}{2}I\\omega^2=\\frac{1}{2}(0.4)(250)=50~J). \n(d) The work done by the force is equal to the kinetic energy gained by the wheel, confirming the work-energy theorem."
  },
  {
    "topic": "Angular momentum in case of rotation about a fixed axis",
    "content": "The total angular momentum of a system of particles about a point is given by (L=\\sum_{i=1}^{n}r_{i}\\times p_{i}). For a rigid body rotating about a fixed axis, the component of the angular momentum along the fixed axis is (L_z=I\\omega\\hat{k}). In general, the angular momentum vector L for a particle is not parallel to the angular velocity vector (\\omega). However, for symmetric rigid bodies rotating about an axis of symmetry, the angular momentum is parallel to the axis of rotation, (L=I\\omega\\hat{k}). For rotation about a fixed axis, the component of angular momentum perpendicular to the axis is constant. The time rate of change of the component of angular momentum along the axis is equal to the external torque along that axis: (\\frac{dL_z}{dt}=\\tau_{ext}). If the external torque is zero, the angular momentum along the axis is conserved, (L_z=I\\omega=\\text{constant})."
  },
  {
    "topic": "SUMMARY OF SYSTEMS OF PARTICLES AND ROTATIONAL MOTION",
    "content": "1. A rigid body is one for which the distances between different particles do not change.\n2. A rigid body fixed at one point or along a line can have only rotational motion. A rigid body not fixed in some way can have either pure translational motion or a combination of translational and rotational motions.\n3. In rotation about a fixed axis, every particle of the rigid body moves in a circle which lies in a plane perpendicular to the axis and has its centre on the axis. Every Point in the rotating rigid body has the same angular velocity at any instant of time.\n4. In pure translation, every particle of the body moves with the same velocity at any instant of time.\n5. Angular velocity is a vector. Its magnitude is (\\omega=d\\theta/dt) and it is directed along the axis of rotation. For rotation about a fixed axis, this vector has a fixed direction.\n6. The vector or cross product of two vector a and b is a vector written as $a\\times b$ The magnitude of this vector is absin(\\theta) and its direction is given by the right handed screw or the right hand rule.\n7. The linear velocity of a particle of a rigid body rotating about a fixed axis is given by $v=\\omega\\times r$, where r is the position vector of the particle with respect to an origin along the fixed axis. The relation applies even to more general rotation of a rigid body with one point fixed. In that case r is the position vector of the particle with respect to the fixed point taken as the origin.\n8. The centre of mass of a system of n particles is defined as the point whose position vector is $R=\\frac{\\sum m_{i}r_{i}}{M}$. The centre of mass moves as if all the mass of the system is concentrated at this point and all the external forces act at it. If the total external force on the system is zero, then the total linear momentum of the system is constant.\n9. The angular momentum of a system of n particles about the origin is $L=\\sum_{l=1}^{n}r_{l}\\times p_{l}$. The torque or moment of force on a system of n particles about the origin is $\\tau=\\sum_{l}r_{i}\\times F_{i}$. The force $F_i$ acting on the $i^{th}$ particle includes the external as well as internal forces. Assuming Newton's third law of motion and that forces between any two particles act along the line joining the particles, we can show that (\\tau_{int}=0) and (\\frac{dL}{dt}=\\tau_{ext}).\n10. A rigid body is in mechanical equilibrium if it is in translational equilibrium, i.e., the total external force on it is zero: $\\sum F_{i}=0$ and it is in rotational equilibrium, i.e. the total external torque on it is zero: $\\sum\\tau_{i}=\\sum\\tau_{i}\\times F_{i}=0$. \n11. The centre of gravity of an extended body is that point where the total gravitational torque on the body is zero. \n12. The moment of intertia of a rigid body about an axis is defined by the formula $I=\\sum m_{i}r_{i}^{2}$ where $r_i$ is the perpendicular distance of the ith point of the body from the axis. The kinetic energy of rotation is $K=\\frac{1}{2}I\\omega^{2}$."
  }
]